{"id":9173939,"author":"jsnell","title":"Announcing Starfighter","url":"http://www.kalzumeus.com/2015/03/09/announcing-starfighter/","text":null,"children":[{"id":9174272,"text":"<p>I wonder if this was inspired in part by the recent Alan Turing movie :)</p>","children":[]},{"id":9174274,"text":"<p>Would like to try this as an employer, particularly targeted towards developers here in South Africa.</p>","children":[]},{"id":9174276,"text":"<p>This looks fantastic. One possible wrinkle: I predict that, although top-performing Starfighters will be a diverse lot, they will lack &quot;diversity&quot;. I hope the Starfighter founders have a plan to push back against the carping complainers a venture such as this is likely to attract. (My suggestion is to point out that CTFs are the ultimate expression of &quot;Shut up and show us the code.&quot; [1])</p><p>[1]: <a href=\"http://esr.ibiblio.org/?p=6642\" rel=\"nofollow\">http:&#x2F;&#x2F;esr.ibiblio.org&#x2F;?p=6642</a></p>","children":[{"id":9175624,"text":"<p>I don&#x27;t understand your point. I&#x27;ve worked with mediocrity far too often in the programming world, and outright incompetence as well. These kinds of contests&#x2F;games are designed to weed that out.</p><p>If you&#x27;re talking about the &quot;winners&quot; having personality issues, then hopefully that will be caught in the interview process.</p><p>Perhaps I&#x27;m completely missing your point though.</p>","children":[]}]},{"id":9175049,"text":"<p>May be interesting. But the claims made in the announcement are very hard to believe. The admission of not being ready to show that the claims have been achieved aren&#x27;t helping my scepticism either.</p><p>Still... if it works, and is actually better than most other attempts at code-gaming this may be fun. Profitable? They will have to see.</p>","children":[{"id":9175598,"text":"<p>The origin story of this company is the application of exactly this process in a real business, to great effect.</p>","children":[{"id":9175691,"text":"<p>But it worked in a very specific context (security) and a specific company (Matasano), no? I know Stripe has done these CTFs in the past (and mostly security related), but they only spin them up on occasion. If the promise of such a technique is so effective, then why wouldn&#x27;t Stripe invest the money (they&#x27;ve got plenty, let&#x27;s be honest) in doing this all of the time? Especially given that a recruiter who would place someone at Stripe is probably taking home $20-40k on a placement.</p><p>Also, what are the plans outside of security related (if any)? Can you do a CTF style process for non-security?</p>","children":[{"id":9175712,"text":"<p>The answer to the &quot;why hasn&#x27;t stripe done this&quot; question is simple.  They aren&#x27;t in the business of doing it.  You might as well ask why stripe doesn&#x27;t sell database systems. I mean, they probably have some expertise in building those out as well.</p><p>Stripe is going to hire a couple of hundred developers over the next decade (assuming things go well).  It sounds to me like Starfighter&#x27;s goals don&#x27;t translate to a couple of hundred X 20-40k.  They seem a touch more ambitious.</p>","children":[]}]}]}]},{"id":9175058,"text":"<p>I get that this is work sample testing - but it seems to be for an extremely limited work sample.</p><p>Most &#x2F; much of the success of a valuable developer is not in their specific technical talent, but in areas like expounding a vision, documenting, running a team, navigating politics and fund raising. (Bit vague here I admit, personal experience of success is problem for me)</p><p>Patio11 made a name for himself saying &quot;tech is a necessary but not sufficient condition for business success - now learn about basic marketing&quot;</p><p>Something similar seems to be applied here - how can a CTF program ever handle politics or investor problems or documentation issues.</p><p>Getting good technical capable people is important - but not sufficient.</p><p>Will be interested in seeing the CTF program however ... Good luck.</p>","children":[]},{"id":9174034,"text":"<p>What skillset do participants have to have to play this game?</p><p>Is it purely security stuff?</p>","children":[{"id":9174049,"text":"<p>Enjoy programming in any language.</p><p>Be fearlessly willing to pick up programming in new languages.</p><p>No security knowledge is required.</p><p>Security is a backdrop for what we&#x27;re doing, but not the only backdrop; it is one of two problem domains we&#x27;re starting out with.</p><p>We use security mostly as a venue for systems programming.</p>","children":[{"id":9174099,"text":"<p>This has piqued my interest more than any other similar challenge&#x2F;game I&#x27;ve seen in the past.</p><p>What&#x27;s the second problem domain you&#x27;re starting out with?</p><p>I hope it&#x27;s to do with graphics&#x2F;parallelized matrix math sort of stuff.</p>","children":[{"id":9174110,"text":"<p>We&#x27;ll send a reading list out to the subscriber list, sometime soon. It&#x27;ll be pretty obvious from that.</p>","children":[]}]}]}]},{"id":9174293,"text":"<p>I actually began working on the exact same thing within the last month or so in my spare time.</p><p>Having competed in the CCDC for 6 years in college, I found it pretty insane when I saw that employers don&#x27;t use real hardware during interviews.</p><p>Looks like I picked the wrong side project now this team is working on it. However, interviews are broken enough that there is plenty of room in the space =]. Can&#x27;t wait to see what you launch.</p>","children":[{"id":9175553,"text":"<p><i>Looks like I picked the wrong side project now this team is working on it.</i></p><p>Competition is a signal that you picked the <i>right</i> field.  Just about everybody gets this backward.</p>","children":[]},{"id":9175584,"text":"<p><i>interviews are broken enough that there is plenty of room in the space </i></p><p>Amen.</p>","children":[]}]},{"id":9174294,"text":"<p>Congratulations patio11, you sound excited.</p><p>I am curious to see how this will work for those like yourself that make CRUD apps. I didn&#x27;t go to school for programming, but self-taught. I&#x27;m afraid it&#x27;d be over my head?</p><p>The best line: We haven’t done any consulting in a while. We will continue doing no consulting, to the best of our inability.</p>","children":[{"id":9174360,"text":"<p>I think that anyone motivated to research and work on these problems, will likely be a decent hire in most organisations.</p><p>Having done other CTFs and puzzles like Matsano &#x2F; Stripe&#x27;s, I have found the research part is quite enjoyable. I have little to no knowledge of crypto but researching and solving some of the Matsano challenges was extremely rewarding.</p><p>With that said I found the information is pretty thinly spread and it is often hard to find relevant information to the problem domain, particularly with regards to crypto, so I hope they include good starting points for problem research.</p>","children":[]}]},{"id":9174806,"text":"<p>Is there any protection planned against people who would be paid to solve the puzzles on someone else&#x27;s behalf, i.e. against cheating by hiring someone to &quot;train&quot; your account?</p>","children":[]},{"id":9174039,"text":"<p>&gt; We’re not here to fix the technical interview: we’re here to destroy it, and create something new and better in its place.</p><p>That sounds pretty bold - some of us are kind of happy to go in and do an interview and talk about our experience and not spend a lot of time playing a game.  I could see the game as more likely to work for people with lots of time and not as much experience or proficiency with the typical process.  I could see it working very well indeed to find people who might otherwise have been ignored.</p><p>In any event, it sounds cool, and I wish you guys the best of luck with it!</p>","children":[{"id":9174064,"text":"<p>If the only reason you&#x27;d mess around with Starfighter is to get a job, we&#x27;ve done something wrong. This isn&#x27;t one of those sites where you solve discrete programming puzzles for badges, or in lieu of a whiteboard interview.</p>","children":[{"id":9174101,"text":"<p>I&#x27;m super excited about it even though I&#x27;m happy where I am. I&#x27;ve been doing devops for a while now and I can feel my other dev skills slowly atrophying. This will be (hopefully) a great way to help keep those skills as current as possible.</p>","children":[]},{"id":9174154,"text":"<p>If it&#x27;s not going to help me get a job (and increase my exposure to companies that might look at my stats), then why, as a developer, would I play it?</p><p>I know you mean well, but I improve my development skills by developing applications.</p>","children":[{"id":9174178,"text":"<p>(a) For the same reasons you&#x27;d noodle with any other game</p><p>(b) For similar reasons to the ones that make you noodle with a programming language you doubt you&#x27;ll ever use in production</p><p>(c) For the same reason anyone ever did anything with a BeBox</p><p>(d) Because for some of the technologies&#x2F;concepts we work with, our dumb game will be the easiest way to get your hands dirty with them.</p>","children":[{"id":9174408,"text":"<p>&quot;(a) For the same reasons you&#x27;d noodle with any other game&quot;</p><p>I play games for fun and to relax.</p><p>&quot;(b) For similar reasons to the ones that make you noodle with a programming language you doubt you&#x27;ll ever use in production&quot;</p><p>On your website, it says that these will actually be real problems for real companies.  I would think it&#x27;s something I would see in production?</p><p>&quot;(d) Because for some of the technologies&#x2F;concepts we work with, our dumb game will be the easiest way to get your hands dirty with them.&quot;</p><p>Isn&#x27;t this what open source is all about?  Pretty much every job I&#x27;ve ever had involved technologies I could just download or install myself and throw on a Linux box&#x2F;VM.</p><p>I suppose it could involve proprietary technology that I would never see in the wild, but if this is the case, I don&#x27;t think I could get enough experience with it on your game to prove to a company that I know enough to get a job.</p>","children":[{"id":9174815,"text":"<p>&gt; <i>I play games for fun and to relax.</i></p><p>Different people have different definition of fun. Some play Minecraft just to build CPUs out of redstone.</p><p>&gt; <i>On your website, it says that these will actually be real problems for real companies. I would think it&#x27;s something I would see in production?</i></p><p>The key word isn&#x27;t &quot;production&quot;, it&#x27;s &quot;you&quot;. I, for example, don&#x27;t really expect to <i>ever</i> use Go or Rust in professional setting. Nor do I expect to use Prolog. Then there are real production systems today that use PDP machines (nuclear reactors) or COBOL (banks). I don&#x27;t expect to work on them either, but sure as hell would like to play with them at some point.</p><p>I get the feeling that Starfighter is about giving geeks some hard-core tech game with a side effect of helping them find a job that is not boring.</p>","children":[]},{"id":9175081,"text":"<p>Usually CTFs &#x2F; wargames &#x2F; whatever are the only way you ever get to work with stuff like radio or telephony protocols, credit cards, homegrown crypto...</p><p>Also you can probably expect things dealing with custom VMs, file formats or networking. Say for instance one of the challenges involves a machine with a broken TCP&#x2F;IP stack, so you have to write your custom client that can talk to it, how often do you do that in real life? Yet it can translate into useful skills.</p>","children":[{"id":9175107,"text":"<p>Thank you. Exactly this. Try to make a list of interesting stuff you&#x27;d like a chance to play around with, in a highly structured environment that handholds you just long enough, and that eliminates all the nonsense required to get dev environments working, or expensive subscription fees, or bankrolls, or laboratories... those are all places we want to be.</p><p>Part of the problem I had earlier today was with the words &quot;fun&quot; and &quot;player&quot;. I think the words I was looking for were &quot;participant&quot; and &quot;rewarding&quot;.</p>","children":[{"id":9175221,"text":"<p>I think the gaming analogies make sense. If you invest time and effort in it, it sure will be more useful in your CV than &quot;Level 80 Paladin&quot; under &quot;Other Achievements&quot;; if not, no hiring manager will ever pass on an otherwise great candidate for not being a part of it.</p><p>And it allows outliers to get potentially amazing job offers from your partners.</p><p>It&#x27;s exciting to think that with today&#x27;s easy access to cheap cloud computing and good process isolation you can have instanced &quot;raids&quot; in the same way as an MMO so I can get my very own version of a challenge that can be as realistic as possible.</p>","children":[]}]}]},{"id":9174930,"text":"<p>Whoah. You misread and we miswrote. We are not taking our clients problems and reframing them as games. How boring would that be?</p><p>Read &quot;real&quot; here in the sense of &quot;plausible&quot;.</p><p>Sorry about that.</p>","children":[{"id":9175013,"text":"<p>&gt; We are not taking our clients problems and reframing them as games. How boring would that be?</p><p>Not <i>that</i> boring, if your clients have interesting problems.</p>","children":[{"id":9175036,"text":"<p>I&#x27;d rather have total complete free rein to pick the most interesting problems I can find. :)</p>","children":[]}]}]}]}]}]},{"id":9174170,"text":"<p>&gt; If the only reason you&#x27;d mess around with Starfighter is to get a job, we&#x27;ve done something wrong</p><p>That was just my first impression.</p><p>At my age, I kind of know how I stack up: I&#x27;ve met really awesome people like Andrew Tridgell and... I&#x27;m not one of them.  So I don&#x27;t feel like I have anything to prove, and I much prefer to hack on open source ( <a href=\"http://journal.dedasys.com/2014/04/27/an-erlang-postgres-driver-refurbishing-open-source/\" rel=\"nofollow\">http:&#x2F;&#x2F;journal.dedasys.com&#x2F;2014&#x2F;04&#x2F;27&#x2F;an-erlang-postgres-dri...</a> ) or side projects where I make and create something rather than playing a game.  So I really don&#x27;t think I&#x27;d use it unless I had to as part of a job process.  I don&#x27;t think that&#x27;s where you&#x27;re going with it though; it&#x27;s more of a way to attract interesting people who might otherwise not get noticed, right?</p><p>So I&#x27;m &quot;not your target market&quot;, which is of course natural and to be expected.  I think it&#x27;s a great way to find people who might otherwise slip through the cracks, and have the time and inclination for puzzles.</p>","children":[{"id":9174201,"text":"<p>We&#x27;ve been talking to people for a few months now about this and have heard that concern repeatedly. We&#x27;re working on designing and releasing something that rewards competition for the kinds of people for whom that&#x27;s a motivator, and rewards tinkering for the kinds of people who enjoy tinkering.</p><p>I&#x27;m the Dwarf Fortress kind of game player, when I ever play games, if that gives you a sense of the direction I&#x27;m pulling us.</p><p>If Starfighter is only rewarding to people like Andrew Tridgell, we&#x27;ve done something very wrong; count on us to adjust course quickly if that happens.</p>","children":[]}]}]}]},{"id":9174040,"text":"<p>Will the CTFs be security focused or more non-traditional, like Stripe&#x27;s distributed systems CTF?</p>","children":[{"id":9174382,"text":"<p>Starfighter is not a security company.  We&#x27;re going to test for a <i>wide range</i> of skill sets.  These may include web app security but will not be limited to that.</p><p>You can reasonably assume &quot;What skills does the market want to hire for?&quot; is a good proxy for what we&#x27;ll be assessing for.  I love security, but that&#x27;s 0.01% of the software market.  We have... grander ambitions.</p>","children":[]}]},{"id":9174812,"text":"<p>Wow, what an idea. And I couldn&#x27;t have more respect for the people who started it. Nice!</p>","children":[]},{"id":9174302,"text":"<p>&quot;You will use real technology. You will build real systems. You will face the real problems faced by the world’s best programmers building the world’s most important pieces of software.&quot;</p><p>I&#x27;m wondering, what is your business model?  Are the users doing free bug fixes and work for the employers while they are proving their skills?</p>","children":[{"id":9174337,"text":"<p>No sane employer would want free bug fixes.  Think of what that would do to their IP assignment issues alone.</p><p>Our business model is explained in the post, under the heading How Will Starfighter Make Money.  Briefly: we&#x27;ll find the best engineers in the world, then broker their introduction to companies who want to hire them.  Companies will pay us a substantial amount of money for this service.</p>","children":[]}]},{"id":9175072,"text":"<p>tptacek: ever heard of Cicada 3301? It&#x27;s this mysterious group that has anonymously posted very involved cryptopuzzles. Not clear why, but one theory has been for recruiting people into intelligence agencies.</p><p><a href=\"http://en.wikipedia.org/wiki/Cicada_3301\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Cicada_3301</a></p><p>I love what you&#x27;re doing but I agree with other commenters that presenting it as a game to programmers but a recruiting channel to companies might not align well. What do you do if a lot of your top players aren&#x27;t interested in getting a job? There are probably exceptions, but do you think people who are good enough to beat your CTF have that much trouble getting a job?</p>","children":[{"id":9175601,"text":"<p>---&gt; VERY YES. &lt;---</p>","children":[]}]},{"id":9175328,"text":"<p>Hey job seekers. I&#x27;m level 45 in starfighter with a power VI blaster in C++ and IX in Python. $100 to get you to level 30, x1.5 per level above that (though obviously I can&#x27;t get you above 45, but I know a guy so I can subcontract up to 52.) You just have to set up a port forward from your machine and I&#x27;ll take care of the rest. Contact info is in my profile.</p><p>Don&#x27;t get suckered into using a bot. They may be cheaper in the short run but you know you&#x27;re going to get lifebanned. My prices are nothing compared to your future earnings.</p>","children":[]},{"id":9174563,"text":"<p>This whole interview process is broken. Even with this mind of ctf game, one should not be expected to race through peers with different kinds of tools.</p><p>Developers are expected to build resumes at work via daily routines, then at home via github, hackerrank, side projects. System administrators are expected to do daily system administration routine, know OSes, tools, cloud&#x2F;iaas&#x2F;paas providers inside out and code side projects and build a coding portfolio.</p><p>With years of experience, one expects to be respected and not lose time on games, tests, unwanted side projects. Interview process is built towards young gals&#x2F;guys.</p>","children":[]},{"id":9174052,"text":"<p>I wonder if the authors are fans of Stargate Universe. The show&#x27;s premise involves a key character being identified by success on a puzzle embedded in a video game.</p>","children":[{"id":9174089,"text":null,"children":[]},{"id":9174091,"text":null,"children":[]},{"id":9174093,"text":null,"children":[]},{"id":9174094,"text":"<p>I presume it is based on the film &quot;The Last Starfighter&quot; <a href=\"http://www.imdb.com/title/tt0087597/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.imdb.com&#x2F;title&#x2F;tt0087597&#x2F;</a> - in which a teen perfects an arcade game, and is then selected as a pilot for the actual spacecraft.</p>","children":[]},{"id":9174127,"text":"<p>I&#x27;m sure the name is from a much earlier movie (mid-80s), The Last Starfighter.</p><p><a href=\"http://en.wikipedia.org/wiki/The_Last_Starfighter\" rel=\"nofollow\">http:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;The_Last_Starfighter</a></p>","children":[]}]},{"id":9175336,"text":"<p>Another attempt to apply data analysis to produce a concrete number that represents the merits and talents of a fellow human being.</p><p>How utterly irrational.</p><p>It&#x27;s ideas like this that make me question why I bother being a programmer for anything more than leisure these days... except that I have no idea what else I could do to keep a roof over my family&#x27;s head this late in my life.</p><p>You call yourselves, &quot;engineers,&quot; but I&#x27;ve yet to work for any company that treated you like one or even invested in your future. You&#x27;re offered a salary well above average for most working adults. They lure you with frivolous perks and stock options. They never send you to school for training, offer you a pension to keep you secure in your golden years, and I&#x27;ve never seen any unions you could join to demand these things from your employers. Your career is probably not going to be on the line if you merge a patch that degrades performance or introduces a timing error. But don&#x27;t think they&#x27;ll care about you when it comes to the bottom line. Someone else seeks to profit off of your talents and abilities and nothing else. If they can hire someone to automate you away, they will.</p><p>And we&#x27;re all the poorer for it I think.</p>","children":[{"id":9175564,"text":"<p>If you could tell us how to apply data analysis to produce a concrete number that represents the merits and talents of a fellow human being, I would love to hear it; it would make my job a lot easier. I didn&#x27;t know that was possible. Is this some kind of linear algebra-y machine learning sort of thing?</p>","children":[]},{"id":9175380,"text":"<p>Well that&#x27;s certainly one point of view.</p><p>So how you are working to make us all the richer? How can I join in?</p>","children":[]},{"id":9175422,"text":"<p>You may love your job, but your job never loves you back. Don&#x27;t remember where I heard this, but it&#x27;s always good to remember. It applies (in varying measures) to anyone from the founders and CEO to the lowliest employee.</p>","children":[]}]},{"id":9174056,"text":"<p>Awesome, I&#x27;ve been waiting for something like this</p><p>That being said, I&#x27;ve got a couple questions</p><p>Will all the CTFs be security focused?</p><p>One of the most common problems coursera ran into was people copying the assignments of other people. How do you intend to prevent copying for the CTFs? I see that you mentioned you&#x27;re not going to DMCA tutorials or Let&#x27;s Plays and instead track their every iteration on the code. I guess you can get rid of outright copying that way but I&#x27;d love to hear your other strategies.</p><p>Other than that this seems like a really interesting way to do recruiting. I can&#x27;t wait to see the actual CTFs.</p><p>Also you&#x27;ve got a tiny typo in the WHY IS STARFIGHTER THE RIGHT TEAM FOR THIS? section:\n&quot;I have a folder in Gmail saving messages from geeks who used by career advice or salary negotiation tips to their advantage.&quot; \nI think the by should be my</p>","children":[]},{"id":9174317,"text":"<p>Part of the current interviewing process is Github and side-projects. I truly understand the reasons for Starfighter, but are you putting any real value behind it? I like CTF, but it&#x27;s not quite the same as contributing to open source projects.</p>","children":[{"id":9174388,"text":"<p>You&#x27;re quite right that a CTF is not the same as open source projects... and I thought the point of this was exactly that.  People who contribute to open source projects prove they have a certain set of skills.  What if you need people with a different set?  What if instead of being able to learn a large codebase, it is more important that they are able to look at a problem and design an algorithm to solve it in the first place?  Rarely in an open source project will you be going in and radically changing the fundamentals.</p>","children":[{"id":9174428,"text":"<p>Makes sense. From that angle, we&#x27;d even see better contributions.</p>","children":[]}]}]},{"id":9174574,"text":"<p>patio11: Why name the company Starfighter, while the domain is startfighterS(.io)? Why not name the business Startfighters? (I understand the other domain was taken).</p>","children":[]},{"id":9175088,"text":"<p>This sounds insanely fun &amp; reading this got me really excited, just subscribed a moment ago!</p>","children":[]},{"id":9174079,"text":"<p>I’m curious as to how much this will select for people with free time. Many of the CTFs I’ve played in required a quite non-trivial amount of investment of time (which I didn’t mind, as they’ve been quite enjoyable), but there are certainly people who can’t afford n dozen hours to solve problems due to family&#x2F;work&#x2F;other obligations.</p><p>I do think this is significantly better than the alternative, but I’m also concerned that it will just create a new class of people who do unfairly poorly in the hiring process.</p>","children":[{"id":9174284,"text":"<p>If this works the way they&#x27;re hoping it will, I have to think it will be a huge time saver over:</p><p>-Updating a resume</p><p>-Contacting a recruiter</p><p>-Replying to recruiters</p><p>-Searching job descriptions</p><p>-Writing cover letters</p><p>-Tweaking previously updated resume</p><p>-Sending applications</p><p>-Maintaining a GitHub profile</p><p>-Working on open source projects that may or may not fit a future job description</p><p>-Spending 1-5 days interviewing</p><p>And that&#x27;s just off the top of my head. I&#x27;m sure we could come up with a few dozen more.</p>","children":[{"id":9174404,"text":"<p>There are other companies that have tried to be the one-stop-shop for job hunting.  It would suck if I worked on my Starfighter rep[1] and then I see a job I want but they want to use my HackerRank rep or StackOverflow rep or whatever elese instead.</p><p>[1] a term I just made up, and may not correspond to something in reality</p>","children":[{"id":9174479,"text":"<p>I don&#x27;t know what it means to be a one-stop-shop for job hunting. I&#x27;m flattered by the concern on this thread that we&#x27;re somehow going to monopolize dev hiring so completely that every working developer will need an account with us in good standing, but (a) that&#x27;s not going to happen and (b) we wouldn&#x27;t let it happen in the alternative universe where it might.</p>","children":[{"id":9175387,"text":"<p>The fear is not that Starfighter dominates; that would be a good case.</p><p>The fear is that there are a bunch of hiring fiefdoms, all waxing and waning, so that I have to spend a bunch of time on a bunch of them to stay relevant.  I don&#x27;t want to be laid off one day and then find out that these days employers are using StackOverflow scores or wherever and that I should have spent the past year working on that.</p><p>OTOH, if 1) I can easily find out that SoftwareCo is hiring through Foo-CTF without having built a Foo-CTF profile, and 2) I can spend, say, 5 hours building a profile at Foo-CTF and get a serious response at the end of that, that&#x27;s good.  It means instead of spending 5 hours doing the silly technical interview dance with SoftwareCo, I&#x27;m spending 5 hours doing the serious work-sample test with Foo-CTF.  Foo-CTF&#x27;s value-add is that they&#x27;re experts at doing the work-sample test.</p>","children":[{"id":9175538,"text":"<p>Ok. I see the disconnect.</p><p>This fear is unplugged from the reality of recruiting incentives.</p><p>It is in the direct financial interests of companies to recruit you directly, not through us. To recruit through us, they have to pay for the privilege.</p>","children":[]}]}]}]}]},{"id":9174103,"text":"<p>Good point. Something I&#x27;ll keep in mind as we go forward. I got so far through microcorruption and ran out of time. Thanks.</p>","children":[]},{"id":9174104,"text":"<p>Why is it unfair to hire people who spend large fractions of their free time honing their skill over those who don&#x27;t? I mean, if it shows in the quality of their work...</p><p>Edit: I know this comment is unpopular, but every craft industry does work like this to some extent. As a programmer you have a portfolio, and all else being equal those who spend their free time coding have larger and more impressive portfolios. That&#x27;s the career advice you always give someone on getting their feet into the industry: code more on your own.</p>","children":[{"id":9174120,"text":"<p>Because free time is something disproportionately available to the privileged. I grew up in a household where money, even if it wasn&#x27;t abundant, wasn&#x27;t a huge concern, so I could spend my time outside of school learning math&#x2F;computers. I&#x27;ve never had to keep a part-time job to put food on the table, spend anhours walking because I couldn&#x27;t afford gas, or generally be forced to trade my time for money at a terrible ratio. There are people who have, many of whom are likely a better candidate than me, who might just not have the time or mental energy to get home and spend 6 hours hacking on microcontrollers.</p>","children":[{"id":9174300,"text":"<p>&gt;I grew up in a household where money, even if it wasn&#x27;t abundant, wasn&#x27;t a huge concern, so I could spend my time outside of school learning math&#x2F;computers.</p><p>This accumulated advantage you describe is present either way. The length of the interview or CTF process is not going to change this.</p>","children":[]},{"id":9174132,"text":"<p>I think I see what you mean: if this replaces interviews entirely then some people just won&#x27;t be considered for the job because they have children. To me that sounds like a policy issue (it&#x27;s illegal to discriminate based on irrelevant features to the job). I.e., not something that the designer of the CTF should be responsible for, but something a company could be very liable for if they aren&#x27;t careful in how the apply the CTF.</p>","children":[{"id":9174286,"text":"<p>Parent&#x27;s point is that companies implicitly filter for this by asking candidates to participate in time-consuming multi-phase interview processes. It&#x27;s already difficult to work contract-for-hire or take time off for several days of on-site interviews, and it gets much more complicated when you&#x27;re not well-off or you also have to take care of your kids.</p>","children":[{"id":9174359,"text":"<p>Of course. But you still hire more skilled people over less skilled people, and if free time contributes to skill it&#x27;s not necessarily unfair.</p><p>In fact, I think a quality CTF could level the playing field, since each candidate could be judged on their relative abilities (how far they can progress through a game that adapts to their prior knowledge). Moreover, one could offset the time commitment by paying candidates to do the CTF. Certainly paying people a decent wage for 6 hours is worth the benefit of hiring a better long-term candidate. There are all kinds of ways to fix the problem.</p>","children":[{"id":9174378,"text":"<p>That&#x27;s definitely the ambition here, and it squares with our experience with the Crypto Challenges and Microcorruption: the &quot;top tier&quot; of people in both those events were, as a general rule, <i>not</i> very experienced in either of those problem domains.</p>","children":[]}]}]}]}]}]},{"id":9174140,"text":"<p>If people have neither the skills you need nor the free time to learn and demonstrate new skills, then there&#x27;s few good ways to identify them.</p>","children":[]},{"id":9174174,"text":"<p>We&#x27;ll try to make Starfighter maximally useful for casting as wide a net as possible in the candidate pool, including folks who have demanding career&#x2F;family&#x2F;etc situations.  I&#x27;m an ex-salaryman, believe me, I know the frustration.</p><p>That said, the perfect shouldn&#x27;t be the enemy of the good here.  The hiring process as it exists on March 9th 2015 is <i>already insanely hostile</i> to people who don&#x27;t have scheduling flexibility to invest <i>hundreds of hours</i> to doing speculative work.  &quot;Hey, could you fly to a different continent for 3 days to do six rounds of in-person interviews?&quot; is considered an attractive, reasonable proposition.</p><p>We can extract more signal than that gauntlet gives, in substantially less time, delivered in the candidate&#x27;s own space and at their own pace.  This is an unambiguous win for candidates with commitments.</p>","children":[{"id":9174346,"text":"<p>How do you ensure people won&#x27;t be required to still fly out for 3 days of interviews?  How do you prevent this from being just another filter before the &quot;real&quot; interview begins?</p>","children":[{"id":9174534,"text":"<p>This was my immediate concern as well, though (to pre-answer the question Thomas already asked you) I don&#x27;t have any good off-the-top-of-my-head suggestions as to how to stop it.</p><p>I think this sort of kick in the pants is exactly the sort of thing that has to at least be tried to sane-ify hiring in tech, but I&#x27;m oddly fascinated to watch the ways in which little bits of status-quo inertia and company politics may act to sabotage it.</p><p>It is very easy to imagine companies not really &quot;getting it&quot; and seeing it the way they see github contribs or stackoverflow scores or whatever other metric that some do use as a signal, but which very rarely actually gets someone in the door or even on a particularly fast track.</p><p>In an ideal world, any sort of testing like this plus a screen to make sure you&#x27;re not a psycho, a narcissist or just a general pain in the ass on a personal level should be sufficient for virtually any programming job, but there are lots of obstacles without obvious technical fixes: HR dept politics, the hazing culture (&quot;We all did this stupid interview thing, so should the new guy&#x2F;girl!&quot;), general distrust (&quot;nobody ever got fired for hiring someone using the old method&quot;), etc.</p><p>I will be watching this experiment with great interest (and hoping it succeeds).</p>","children":[]},{"id":9174879,"text":"<p>I wouldn&#x27;t worry too much. The incentives align.</p><p>Starfighter doesn&#x27;t make any money unless they actually place someone. Their pitch selects for people that aren&#x27;t doing well in the traditional hiring process. So if a company tries to use its ordinary process, just putting the candidates in at the front, we can expect they won&#x27;t do especially well. If a few candidates get sent out to an interview, have a miserable time, and don&#x27;t get the job, I&#x27;d bet Starfighter will fire the client. Even when you are just selling to clients, you need to occasionally fire a toxic one. In a two sided marketplace it is absolutely crucial. The screened, high quality, applicants looking for a new job (or at least willing to consider one) are too valuable a resource to waste on companies that aren&#x27;t serious.</p>","children":[{"id":9174903,"text":"<p>I think I deleted the line from the draft that actually got published, but an earlier draft said:</p><p>Companies will process Starfighter candidates expeditiously and with dignity.  Why?  Because we&#x27;re the work-sample company, and each candidate&#x27;s experience is a work-sample of your hiring process.  I see no need to introduce the best engineers in the world to anyone but the companies that most have their act together.</p><p>(Plus, yeah, obvious confluence of interests there regarding incentive compatibility.)</p>","children":[]}]},{"id":9174368,"text":"<p>Give us some suggestions. We&#x27;re all ears.</p>","children":[{"id":9174772,"text":"<p>My worry is that this service could be seen as yet another certification, and just adds to the list of things you &quot;have to do.&quot;</p><p>I guess I can ask you directly: how much time do you spend interviewing people, not counting the work-samples you already require?</p><p>As for suggestions, it&#x27;s really about the next year.  Unless you&#x27;ve already been doing this, you have to find people, and place them.  And that means working not only with the programmers, but also the companies involved.  Part of that would mean coaching them on how to use your system.  You want to destroy the current tech interview process?  You have to replace it.  You want to remove the tech portion?  Then I think the best way right now is working directly with the companies you are placing people with.  They need to play by your rules, and a year from now is when you&#x27;ll have a better understanding of where you stand, as the person you&#x27;ve placed is hired, and still employed.</p><p>Obviously there is more than just one candidate and company, but unless that happens, I don&#x27;t see a company just buying into your system without keeping it&#x27;s own.  So you need to teach them what it is you are providing, and what they should do to maximize interaction with the candidate.  The interviews will still exist: I want to meet the person I&#x27;m working for before I show up.  But instead of dealing with white boards and ping pong balls, we are having a conversation about my potential future with the company, and what I can bring to the table.</p><p>patio11 said it: &quot;we’re here to destroy it, and create something new and better in its place.&quot;</p><p>A job interview has two sides, the applicant, and the company, and if you want to destroy the interview and rebuild it, you have to do it with both sides at the same table.  Otherwise, you aren&#x27;t destroying anything, just adding more red tape before anyone gets to the table.</p>","children":[{"id":9174870,"text":"<p>Literally the first objective I had when I took over recruiting was to reduce the time demands on Matasano&#x27;s hiring process, and the work-sample process we came up with slashed time demands by more than half. Candidates we <i>passed</i> on wrote us to say how much more they liked how we hired than other companies. That&#x27;s because:</p><p>* We demanded the same or slightly less time in total than other conventional-interviewing companies did.</p><p>* The scheduling of our demands was totally flexible, unlike interviews, which are rigidly scheduled. If you&#x27;re a morning person, and you have next Tuesday free, that&#x27;s when you threw the 2-odd hours you needed at the challenge.</p><p>* Obviously, it&#x27;s easier and less stressful to put effort in from your couch than in an alien office environment with people staring at you waiting for you to answer properly.</p><p>* The challenges themselves were <i>fun</i>. They were real work: we didn&#x27;t have people literally slaying dragons (they were breaking a web app and a client&#x2F;server app), but they were the distilled enjoyable essence of that work with most of the BS removed. In fact, if you didn&#x27;t find the challenges fun, that was a huge signal that we were the wrong job for you.</p><p>* If you did decide we were wrong for you, you could stop at any time --- randomly, on a Tuesday night, with a slice of pizza in your mouth --- and have none of the weird social pressures that would make you sit through a string of pointless interviews. Which is an experience I have had, more than once.</p><p>Regarding certification: pure, chill-filtered hatred of certifications is what got me into the part of software security I wound up in. There is zero chance that we are going to build something with the market dynamics of a certification.</p>","children":[]},{"id":9174890,"text":"<p>I think you have an interesting concern.  I don&#x27;t worry that this will become an &quot;extra certification&quot;, though.</p><p>I imagine that one might still get called for a 3 day interview, but I suspect that people using a work-test like Starfighter before asking for that will already have a MUCH better idea about your capabilities than they would have without it.  Interviews then seem like they become more about assessing your fit with the company, and less about trying to weed out incompetence -- because they wouldn&#x27;t invite you for an interview unless you&#x27;d already demonstrated your competence in this way.</p><p>That sounds a bit bad, if it were for only one company, but what excites me about Starfighter is that it sounds like something I&#x27;d want to do for fun __anyway__, and its signals about my competence (I hope! ;)) could then be given to multiple companies -- including ones I might never have thought to apply to.</p><p>I&#x27;d much rather hear, &quot;Greetings Starfighter, .... we want to hire you to do more like that&quot; than get spammed by random recruiters because my LinkedIn profile happens to have Python or Java on it.</p><p>At this point, my biggest fear is that I might not have the technical chops to complete the challenges.</p>","children":[]},{"id":9175519,"text":"<p>Great point. It&#x27;s happened before. For example, at many companies, HackerRank-esque code tests were meant to replace the technical screen, but just ended up being an additional step you have to do.</p><p>More red tape happens because companies feel like they have the power to ask people to jump through whatever hoops they want. But you can reverse this. If you have the people companies want desperately, you can dictate what the companies can and cannot do (no 3-day interviews, for example). I think that&#x27;s what Starfighter is trying to do.</p>","children":[]}]}]},{"id":9174447,"text":"<p>Where is this hyperbole of 3 days of interviews coming from? Sure, someone had that experience. 99% of people don&#x27;t.</p><p>Anyway, I&#x27;m happy to spend lots of time meeting and mingling with my future team and employer. Most people good enough to surpass these CTF&#x27;s are going to be using the in-house interview time to be in the driver&#x27;s seat of reverse-assessing their potential employer, realistically.</p><p>The interview for my newest job was spread out over two half-days (my choice versus one full-time day). I came back to visit and talk with people <i>three</i> times after I finished my interview and had an offer extended. My choice. I needed to really feel the culture. And ultimately that&#x27;s what caused me to join the company.</p>","children":[{"id":9174653,"text":"<p>&gt; Where is this hyperbole of 3 days of interviews coming from?</p><p>Directly from the comment I&#x27;m replying to.</p>","children":[]},{"id":9175246,"text":"<p>I had 24 hours of interviews at a company in Massachusetts, and then they decided to start negotiating salary. I told them what my last job had paid, and then they stopped talking to me.</p><p>I&#x27;m glad it didn&#x27;t go further.</p>","children":[]}]}]}]},{"id":9174979,"text":"<p>&gt; I’m curious as to how much this will select for people with free time.</p><p>There are very few hiring mechanisms (including, you know, the whole application and interview process) that don&#x27;t select for people with free time.</p>","children":[]},{"id":9174229,"text":"<p>I was thinking this too. I did the cryptopals while in grad school and was able to complete it. I got 15 minutes in microcorruption before I got sucked into a wormhole of meetings.</p>","children":[]}]},{"id":9174080,"text":null,"children":[]},{"id":9175620,"text":"<p>I am curious about a biz dev kind of thing, and it may be entirely too early to answer, but here goes:</p><p>&quot;Contingent recruiting&quot; has an extremely negative connotation to me.  Quite literally, I have to constrain my bias when designing hiring pipelines to not throw recruiter backed resumes away.  I understand that you are only taking the payment model, and are trying to undermine the business model, but have you run into any problems associating with the industry?</p><p>Or, more interestingly, have you encountered anyone on the consumer side (HR, C-Suite management, etc) that has pointed out a non-obvious advantage to typical contingent recruiting.  I for one would love to hear why companies keep going back to that obviously terrible well.</p><p>I&#x27;m excited to see what comes of this.</p>","children":[]},{"id":9174087,"text":"<p>Is it targeted to devs looking for full-time work only or will it make sense for freelancers as well?</p>","children":[{"id":9174838,"text":"<p>If the scores&#x2F;achievements can be public accessed then you can use it as part of your portfolio when bidding on contracts.</p>","children":[]}]},{"id":9174861,"text":"<p>I feel like this is an implementation of my idea here:  <a href=\"https://medium.com/@sargun/interviews-as-a-service-dfa6d4a03401\" rel=\"nofollow\">https:&#x2F;&#x2F;medium.com&#x2F;@sargun&#x2F;interviews-as-a-service-dfa6d4a03...</a> -- Or at least a competing alternative to traditional interviews.</p>","children":[]},{"id":9174867,"text":"<p>- Do you think there will be some threshold where people get past a certain stage and then start getting offers, with nothing being offered below that? (my only experience is basic OverTheWire challenges, so not sure if this will have similar progression of &#x27;levels&#x27;)</p><p>- Is it going to hurt?</p>","children":[{"id":9174881,"text":"<p>Based on my experience with the crypto challenges and Microcorruption: there will be a <i>lot</i> of players, and <i>most</i> of them will just be there to twiddle the knobs and see how things work.</p><p>There will be a subset of participants for whom it&#x27;s worth their time and ours to have a conversation. Our job will be to identify that subset and start that conversation.</p>","children":[]}]},{"id":9174883,"text":"<p>How about a game to discover and formally describe new problems? The ability to find new problems is just as important if not more important than the ability to solve already known problems (especially those that have been solved by others) Obviously, the ability to do both (find new problems and solve them) is the most important of all. Focusing on solving known problems is NOT that interesting... Can you imagine building an environment that allows programmers to discover and formally describe absolutely novel problems in computer science? Just curious.</p>","children":[]},{"id":9174117,"text":"<p>From the blog post it sounds like you primarily plan to be used as a &quot;funnel&quot; for employers that engage you, where you are like a super-recruiter bringing candidates that you have qualified yourself.</p><p>Do you plan for there to be an option for employers that aren&#x27;t asking you to refer candidates to still see some view of the performance of a player? Either by paying some smaller fee or by allowing players to have public profiles with some sort of scores?</p>","children":[{"id":9174151,"text":"<p>There is a long-term PVP element to what we&#x27;re doing, so we want as many players as we can get. We&#x27;ll play with a number of different ways of matching talent to very smart employers, but our #1 overriding dominating design goal has to be to make players comfortable, so the game works.</p>","children":[]}]},{"id":9174142,"text":"<p>One of the conventional complaints against CS-algorithm-heavy interviewing is that companies ask all these tough questions about distributed cache latency in red-black tree optimizations, then once they hire people, they&#x27;re just bashing out PHP and MySQL. How do you make sure that the companies hiring your services have challenges that live up to the skills you&#x27;re selecting for?</p>","children":[{"id":9174177,"text":"<p>Honestly, they probably don&#x27;t care. If the company is willing to pay, they&#x27;ll be willing to send them candidates.</p><p>On the other hand, they may want to be a bit more selective to keep great programmers coming to the site.</p>","children":[]},{"id":9174198,"text":"<p>Actually, I guess there&#x27;s the fact that you&#x27;re hiring someone who you know is kind of addicted to an online game... and if you don&#x27;t find anything more interesting for them to do, they&#x27;ll probably go right back into it.</p>","children":[]},{"id":9174202,"text":"<p>I&#x27;ve got nothing against CRUD apps, because they make the world go round, but it is unlikely that Starfighter will choose to send our candidates to firms making CRUD apps.  The difference will be fairly obvious when you see our client roster.  We&#x27;re geeks with good taste for the kind of jobs a geek would actually want to have.</p><p>(Sorry for being coy here.  Don&#x27;t want to jinx contract signing.)</p>","children":[{"id":9174237,"text":"<p>The problem is that the great hackers are already inundated with unattractive job offers. Offers that seem very attractive to people who are not them.</p><p>If you had a deal with Google&#x2F;Apple&#x2F;Dropbox&#x2F;NSA that said &quot;If we find someone who can complete this challenge, you agree you hire them at $500k&#x2F;year + $100k signing bonus doing work on Skunkworks Project X&quot; you would have an incredible flow of hackers.</p><p>No one has created a marketplace for world class experts and yet these positions and people exist.</p><p>Congratulations on launching and good luck!</p>","children":[{"id":9174452,"text":null,"children":[]},{"id":9174471,"text":"<p><i>The problem is that the great hackers are already inundated with unattractive job offers.</i></p><p>This is true for a subset of great hackers who are conveniently visible to the tech industry&#x27;s antiquated, inefficient, insane, and exclusionary hiring practices.  It is very much not true for many very talented engineers in the world.</p><p>We&#x27;re going to arbitrage that inefficiency to zero.</p>","children":[]}]},{"id":9174495,"text":"<p><i>&gt;We&#x27;re geeks with good taste for the kind of jobs a geek would actually want to have.</i></p><p>You&#x27;re geeks who&#x27;ve assumed that the only job a geek wants to have involves finding system-level exploits.</p><p>It&#x27;s all very clever to write a program that reads use it&#x27;s own bytecode as the secret, but does that feed people? Get them to Mars? Heal people? Does it make application programming easier, less error prone, more accessible? Perhaps there exists some insights at the lowest level of program execution that are only revealed in a career like this (a la _A New Kind of Science_), but somehow I doubt it.</p><p>But hey, everyone is welcome to their opinion.</p>","children":[{"id":9174955,"text":"<p>&gt; Does it make application programming easier, less error prone, more accessible?</p><p>If you want to write systems that improve the safety of application programming, it helps to have a lower-level understanding of what is happening.</p><p>As for Mars, if articles like this (<a href=\"http://spinroot.com/dcas/\" rel=\"nofollow\">http:&#x2F;&#x2F;spinroot.com&#x2F;dcas&#x2F;</a>) are any indication, there will need to be a lot of systems programming and especially tool building that requires deep systems understanding.</p>","children":[{"id":9175581,"text":"<p>It&#x27;s so weird to me, because for me, it is absolutely the other way around. It&#x27;s easy to break into computer systems. Put a single quote in the wrong place on enough web apps in a &#x2F;19&#x27;s worth of IP addresses and you will get in. What&#x27;s interesting about security is the tour of functionality it takes you on. Security is an opportunity to crawl into the ventilation ducts, open the hatches, and directly tinker with the inner workings of hugely complex systems. It&#x27;s a goal system that gives you a reason to do that, that points you in a coherent direction, that forces you to learn and retain otherwise random-seeming details, and rewards you with huge endorphin rushes to keep you going.</p><p>It doesn&#x27;t even have to be competitive. It&#x27;s just... fun.</p><p>Virtually everything I know about computer science I learned because of software security.</p><p>I don&#x27;t think you need to care that much about security to benefit from a syllabus of exercises framed by security.</p>","children":[]}]},{"id":9175262,"text":"<p>Typically the people who find these sorts of bugs have jobs penetration testing and auditing applications. Some of those applications are important to people&#x27;s lives and wellbeing. And if you don&#x27;t work for the NSA or similar, you&#x27;re actively helping the application owners to find and remediate those bugs, which improves security for the creators and the users.</p><p>For example, if you&#x27;re an application security analyst at Google and you find a security flaw that could result in users&#x27; personal information being leaked, aren&#x27;t you making the world a better place by finding and repairing that bug?</p>","children":[]}]}]}]},{"id":9174401,"text":"<p>You might want to talk about the diversity benefits of this approach. In particular, it would be attractive to lots of companies if you can make a credible case for this attracting traditionally hard-to-reach demographics, and then of course assessing them more fairly.</p>","children":[]},{"id":9174146,"text":"<p>Hidden in the article is a real gem:</p><p><i>The science of hiring practices is settled: work-sample tests are the most effective way to assess skill in potential hires.</i></p><p>This is one of the most obvious, yet under-applied truisms in hiring.</p><p>If they can apply Starfighter beyond Games, or enable non-Game skills to shine while working on Games, it will be industry changing.</p>","children":[{"id":9174247,"text":"<p>Makes me miss prop trading, where a tax return basically settled it. Now, job hunting ruins a weekend.</p>","children":[]}]},{"id":9174147,"text":"<p>Sounds very competitive, achiever-focused. Do all organizations want programmers who are viciously determined to win? Does that lead to society-efficient solutions?</p><p>(To elaborate a little, Richard Bartle noticed four types of players of MUD. Achievers are just one.)</p>","children":[{"id":9174257,"text":"<p>IIRC, The three other types are \nExplorers,\nSocialites, and\nGriefers</p>","children":[{"id":9174371,"text":"<p>The 4th is killers, not griefers.  Killers prefer playing specifically against other players.  Killers are generallyl looking for the challenge&#x2F;reward of fighting and winning against other players, rather than necessarily trying to grief someone.  Though obviously getting killed in PVP can sometimes feel like griefing.</p>","children":[]}]},{"id":9174265,"text":"<p>We want the Explorers more than the Achievers, but we want to exploit Achiever impulses where they exist to keep the game interesting.</p>","children":[]}]},{"id":9174160,"text":"<p>Is it significantly different from topcoder?</p>","children":[{"id":9174299,"text":"<p>Yes.  I don&#x27;t know how to describe how until you&#x27;ve actually played it.  You know how World of Warcraft and Tetris are both games?  Starfighter is a game, too.  We&#x27;re very much not Tetris.  Or Topcoder.</p>","children":[]}]},{"id":9174417,"text":"<p>Reminds me of a local company who recruits employees exclusively by organizing coding contests: <a href=\"http://contest.catalysts.cc/en/\" rel=\"nofollow\">http:&#x2F;&#x2F;contest.catalysts.cc&#x2F;en&#x2F;</a></p><p>It works great for them, but I believe you attract a certain kind of developers with these contests; you attract people who enjoy puzzles, and people who enjoy measuring their abilities against others. It could be that those are the traits that make good employees; but I myself would never take part in such a competition.</p><p>Then again, I don&#x27;t actually want to work for anyone else at all.</p>","children":[]},{"id":9174164,"text":"<p>I am a beginner programmer, but I am curious what this is all about so I have signed up.  Hopefully I can learn something from this even if I am just am just a fighter but no star.</p>","children":[]},{"id":9174165,"text":"<p>I get what they&#x27;re trying to do, but did this read like a rant from a crazy person to anyone else?</p><p>Just the first header block read like they were creating some kind of videogame company... and then finally at the bottom of that text block, &quot;Oh, it has something to do with interviews...&quot; and then halfway down the next section, &quot;oh, it&#x27;s that kind of CTF&quot;.</p><p>Anyway, seems cool if they can make applying for jobs more interesting.</p>","children":[{"id":9175151,"text":"<p>It reminded of how pickup artists market their books&#x2F;seminars[0], which gave me a little chuckle.  Nevertheless, I&#x27;m excited about this, and signed up immediately.</p><p>[0]: www.blueprintdecoded.com&#x2F;</p>","children":[]},{"id":9174895,"text":"<p>I actually liked the style. For me it read as amazing, totally cool and definitely-want-to-participate-in thing - but that might be mostly because I know who patio11 and tptacek are and don&#x27;t apply the typical --bullshit-filter=strong flag I do when reading other announcements.</p>","children":[]},{"id":9174199,"text":"<p>Entirely insane, yes! After reading this article, I have no real idea what they are doing, but it appears that they are related to an entire genre of games I didn&#x27;t know about.</p>","children":[{"id":9174381,"text":"<p>I think it&#x27;s primarily written to a different audience than yourself, then. I mean that in the best of ways. As an infosec sort, it came across pretty clearly what they intended. I think it&#x27;s just a culture difference between information security, and the rest of IT.</p>","children":[{"id":9174539,"text":"<p>Ah, infosec. Yes, it was clear that it came from some other part of the computer universe, but I had no idea which one.</p>","children":[{"id":9175325,"text":"<p>Yeah, for us (infosec) hackers it can be easy to forget there are people in IT who don&#x27;t understand our culture&#x2F;terminology sometimes.</p>","children":[]}]}]}]},{"id":9174203,"text":"<p>It read like an infomercial to me...I closed the page after the first two sections.</p>","children":[{"id":9175170,"text":"<p>patio11&#x27;s writing style seems to run that way. I find it difficult to read, but he&#x27;s presumably tested it. Maybe he got stuck at a local maxima.</p>","children":[]}]}]},{"id":9174166,"text":"<p>Wonderful, let me add this to the list of things I need to do in my spare time to remain a hire-able resource .... GitHub, Meetups, reading hacker news, preparing for puzzle interviews,  , HackerRank, conquering a CTF.  Jeez, can we say dance monkey dance.</p>","children":[{"id":9174305,"text":"<p>I think patio11 and tptacek hope this can <i>replace</i> those things, so that you can work towards a new gig on your own terms (instead of going through the usual song-and-dance).</p>","children":[{"id":9174559,"text":"<p>There are lots of ways to acquire and prove skill and knowledge; ultimately, they are all monkey dances to at least some degree. Until we develop a way to read minds (and it&#x27;d be great to also do the reverse: give everyone the ability to insta-learn, Matrix-style), we will continue to have to use <i>some</i> kind of signaling mechanism. Right now, there are many of them, all with various levels of difficulty, entrance requirements, and resource requirements. Many are only available to those with various types of scarce resources: free time, supportive parents and family members, and money. Let&#x27;s list some examples:</p><p>- get a degree in any subject (money, family support)</p><p>- get a degree in a more pertinent subject (money, family support)</p><p>- continually learn new theory&#x2F;techniques&#x2F;technologies on your own (time)</p><p>- write FLOSS code (time)</p><p>- get industry certifications (money)</p><p>- get achievements with HackerRank and other &#x27;challenge&#x27; services (time)</p><p>- go to interviews, answer questions (time, possibly others)</p><p>Not to mention all of the &#x27;administrative&#x27; things people do to communicate their capabilities (as another comment noted. Those take time, too.)</p><p>Something like this seems like it is taking a stab at replacing at least a few of these, but of course it still requires at least some extra resources (in this case, time.) The go-at-your-own-pace nature of it definitely works in its favor. Things like this evolve similar to technology, and its cycles of consolidation and deconsolidation; where once we may have used separate devices (for music, video, reading, etc.), we now use just a couple, or increasingly, one. Perhaps we could think of things like this as the next steps in &#x27;skill and knowledge acquisition consolidation.&#x27; Hopefully, things like this will reduce the need to spread efforts so thinly, and save us more of those scarce resources. So while it may be another monkey dance, perhaps it will allow us to dance less, but in a more focused way. Or at least stay on a smaller number of simian dance floors.</p><p>If nothing else, it&#x27;ll be another fun way to learn new things and experiment with theory&#x2F;techniques&#x2F;technology you ordinarily wouldn&#x27;t.</p>","children":[{"id":9174648,"text":"<p>Whatever happened to companies spending the resources to train and mentor green recruits?</p>","children":[{"id":9174749,"text":"<p>The same things that happened to a whole lot of other things, I suppose:</p><p><a href=\"http://www.nytimes.com/2012/09/22/business/to-stay-relevant-in-a-career-workers-train-nonstop.html?_r=0\" rel=\"nofollow\">http:&#x2F;&#x2F;www.nytimes.com&#x2F;2012&#x2F;09&#x2F;22&#x2F;business&#x2F;to-stay-relevant-...</a></p><p><a href=\"http://privatizationofrisk.ssrc.org/Hacker/printable.html\" rel=\"nofollow\">http:&#x2F;&#x2F;privatizationofrisk.ssrc.org&#x2F;Hacker&#x2F;printable.html</a></p>","children":[]}]}]},{"id":9174321,"text":"<p>I admit it&#x27;s a different song-and-dance but it&#x27;s still a song-and-dance.</p>","children":[]},{"id":9174376,"text":"<p><a href=\"http://xkcd.com/927/\" rel=\"nofollow\">http:&#x2F;&#x2F;xkcd.com&#x2F;927&#x2F;</a></p>","children":[]}]},{"id":9174316,"text":"<p>What are some things you&#x27;d worry about a company like this doing that would increase dance-monkey-dance factor?</p><p>What are some things a company like this could do to decrease dance-monkey-dance factor?</p><p>We&#x27;re not interested in making monkeys dance, unless they want to, and enjoy it.</p>","children":[{"id":9175563,"text":"<p>&gt; What are some things a company like this could do to decrease dance-monkey-dance factor?</p><p>- Let players be paid by your clients to play for ~1 day.</p><p>- Introduce a non-game version that&#x27;s a straight forward coding assessment.</p><p>- Make the game un-cheatable.</p><p>- Write into your contracts that you won&#x27;t be the exclusive hiring funnel.</p><p>- Keep your clients confidential and don&#x27;t let them mention your game in job ads (i.e., target people who just want to play a game).</p><p>Edit: I have to add, this does seem like a dance-monkey exercise and not something that an actual profession would have people do. My preferred hiring approach would just be contractor-for-a-day arrangements.</p>","children":[]},{"id":9174366,"text":"<p>Sorry, I think I&#x27;m a bit of a cynic and a bit burned out.  There seems to be at least an expectation in the tech industry of having to maintain certain after hours activities to make one self marketable.  Personally having a 50+ hour a week day job + side projects + studying + leveling up in order to find new employment is exhausting .... I&#x27;m just concerned adding another implied responsibility to a candidates plate seems overwhelming.</p><p>But, if someone loves to play CTFs and is seeking employment than its a great match.  Me personally I&#x27;m a build things I want to see in the world and the job will come ... kind of person.</p>","children":[{"id":9175057,"text":"<p>I think you should be talking to you current employer about setting aside some of your current work time to training. One or two days a month for you study &#x2F; explore technologies that will grow your skills and therefore the skills the company can draw on.</p>","children":[]},{"id":9174455,"text":"<p>&quot;expectation in the tech industry of having to maintain certain after hours activities to make one self marketable&quot;</p><p>On hacker news you are getting a very small slice of the tech industry. And by reading HN you are subjected to repeated attempts to make you think there is a clear way to be marketable and to earn a living. Rest assured that there are people in tech that the HN crowd makes fun of that are earning fine livings and enjoying their jobs.</p>","children":[{"id":9174557,"text":"<p>I work in a beautiful non-SV city, earn six figures, and enjoy my job.  I am a Classic ASP developer.</p>","children":[]},{"id":9175371,"text":"<p>Also, rest assured that for the overwhelming majority of competent, smart tech workers, only a tiny percentage have heard of HN, and a tiny percentage of that slice view it as something to be taken seriously. For most, there is no difference between Hacker News and <a href=\"https://twitter.com/ViceHN\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;ViceHN</a>.</p>","children":[]}]}]},{"id":9174424,"text":"<p>He raises a good point. I stopped reading NYT online regularly when I started spending more time reading HN. The fact is you have to pick your battles. And what you spend your time on.</p><p>Your question is good though. If I understand you to be saying &quot;what can we do to get you to drop one of those other things or you nightly watching of reality tv?&quot;</p>","children":[]},{"id":9174443,"text":"<p>Director: Our operating expenses are through the roof. We&#x27;ve got a dozen developers and we&#x27;re still behind schedule...</p><p>Manager: That&#x27;s because we don&#x27;t have any &quot;good&quot; developers. We need to find some of those 10x productive developers and get rid of some of the guys we have.</p><p>Director: So you&#x27;re telling me we can replace 10 developers for the price of one good one?</p><p>Manager: That should be true, but the 10x guy is going to want a bit more money.</p><p>Directory: Let&#x27;s do this!</p><p>(some time later at the interview)</p><p>Manager: Were looking for highly productive programmers and we&#x27;re willing to pay top dollar. We see you&#x27;ve accomplished X, Y, Z so we want you to come and join our team.</p><p>Developer: Sorry, I can&#x27;t...</p><p>Manager: How about $50k more salary...</p><p>Developer: Wow, ok, I can&#x27;t really say no to that.</p><p>(some time later the first day)</p><p>Manager: Welcome to your first day, here is your team. Get as much information from them as possible because we&#x27;ll be laying off 10 of them in 30 days. Good luck!</p>","children":[]},{"id":9174448,"text":"<p>&gt; What are some things you&#x27;d worry about a company like this doing that would increase dance-monkey-dance factor?</p><p>Not the OP, but anything where a recruiter can go look my rating up, they will. And then that becomes a positive signal, increasing the speed of the rat race, because to be &quot;hip&quot;, you have to do the N+1 things. Blech.</p><p>If you want to reduce the &quot;dance&quot; factor, have a sheltered tunnel from Starfighter to the first day on the job. Don&#x27;t have it be a pipe to the tech interview, don&#x27;t let it be a pipe to a recruiter&#x27;s desk, don&#x27;t let HR do anything but verify employment eligibility. Seriously.</p>","children":[{"id":9174531,"text":"<p>Microcorruption player identities were totally private. There&#x27;s no way for a recruiter to look someone up, unless they used a very-identifiable username. Privacy is important to us.</p><p>How would you imagine the bizarro-world third party recruiter that would emerge from something like Starfighter could interoperate with employers to shield you from the kind of BS you&#x27;re concerned about? We&#x27;re interested in ideas!</p>","children":[{"id":9174624,"text":"<p>I would suggest Starfighter Recruiter, LLC have a contract with a VP, CTO. Something to the effect of...</p><p>&quot;We provide you the names of people interested in your fine company, along with our certificate of credibility. You in turn agree that the interview process will be entirely on the intangibles[1] of interpersonal relationships, career goals, etc&quot;.</p><p>Along with that would be a rider that would involve Starfighter Recruiter LLC taking liability for providing a measurably crappy candidate, as well as disclaimers all around relating to intangibles.</p><p>Personally, I don&#x27;t really want to futz around with long-winded negotiations and alpha male chest thumping. I want to demonstrate my capability, discuss my career goals and interests, and verify that fine hiring company is actually a reasonable place to work that meshes with me and my career aspirations.</p><p>[1] I.e., candidate is a loud-mouthed jackass that can&#x27;t work with anyone, but can pass any technical challenge with flying colors.</p>","children":[{"id":9174844,"text":"<p>I think if it leads to higher quality job leads than that would be great for many people.  I find personally with response rates to cold drops of a resume being around 75%.  The amount of time shifting through positions I don&#x27;t want &gt;&gt; than pursuing those that I do.</p><p>The great employers don&#x27;t require to much chest thumping and I&#x27;ve had some down right fun interviews.  I question the culture of a company that uses a CTF game as a metric to hire people.  People who play and succeed at CTFs tend to be hyper-competitive and thats not always a wonderful characteristic in a team member or company.</p><p>Thats fair, after reading some of your comments above.  I believe you don&#x27;t intend this to be more work for people.  And, I believe hiring on both sides of the equation is a non trivial problem.</p>","children":[{"id":9174898,"text":"<p>We used it at Matasano and had a diverse culture of people --- many with families --- with a variety of different personalities and personal styles. Beware of attribution error.</p><p>The underlying idea here isn&#x27;t speculative. We used it at Matasano, and it was extraordinarily effective.</p>","children":[]}]}]}]}]}]},{"id":9174367,"text":"<p>While I&#x27;m very happy to see attempts to get rid of the interview and move towards a work-sample test, this comment represents the whole sense of unease I have at this.</p><p>There is, of course, releveant XKCD: <a href=\"http://xkcd.com/927/\" rel=\"nofollow\">http:&#x2F;&#x2F;xkcd.com&#x2F;927&#x2F;</a></p><p>I can say that I have hopes that if anyone can stop what you fear from happening it&#x27;s these people.</p>","children":[]}]},{"id":9174169,"text":"<p>There&#x27;s a small typo that caught my eye. In the &#x27;Why is the Starfighter the Right Team&#x27; section, 4th paragraph, 2nd sentence &quot;I have a folder in Gmail saving messages from geeks who used by career advice or salary negotiation ...&quot; It should be my instead of by.</p>","children":[]},{"id":9174171,"text":null,"children":[]},{"id":9174427,"text":null,"children":[]},{"id":9175206,"text":"<p>&gt;Unfortunately, the technology industry is fundamentally unserious as to how it presently identifies and employs engineers.</p><p>Ok, so lets replace whiteboarding ancient algorithms and useless trick questions with a capture the flag game!! That&#x27;ll make the industry seem less &quot;unserious.&quot;</p><p>This is so unfathomably ridiculous. I can&#x27;t believe you&#x27;re marketing this as an interview replacement. If I get asked what my &quot;Starfighter score&quot; is before a job interview, I will be running as fast as I can in the other direction before they finish their sentence.</p><p>There will be people who become great at this game, and if (god help us) this gains momentum, they will get jobs.</p><p>I can only hope the rest who are developing applications and actually writing programs will come out on top, and employers will recognize that some people want to build things and not just improve their ranking in a game.</p>","children":[{"id":9175241,"text":"<p>Nobody is going to ask you what your &quot;Starfighter score&quot; is.</p><p>Without opening up a pointless vein of second-guessing about Patrick&#x27;s writing: I think the timing of this post has led people to believe that <i>this right here</i> is my answer to The Hiring Post.</p><p>No. The Hiring Post itself contains what I believe the answers to The Hiring Post are.</p><p>There are two halves of the recruiting problem: OUTREACH and QUALIFICATION.</p><p>Companies need to be smarter about qualification. We have a lot of thoughts on how they can be smarter and I am in full-on insane street preacher mode about those thoughts, which are not directly remunerative to our business.</p><p>Starfighter is about the OUTREACH side of the recruiting problem. Our goal is to be a credible pipeline of candidates who are not effectively identified by the resume&#x2F;interview&#x2F;github process. We are looking for buried talent, and to have fun doing it along the way.</p><p>I know HN all too well, and I think the instinct people will have reading this comment is to try to reconcile it with exactly the words Patrick chose to use in his blog post and then object to the perceived discrepancies. Please, no: that&#x27;s a waste of all our time. Patrick speaks for Erin &amp; I. I speak for Erin &amp; Patrick.</p>","children":[{"id":9175728,"text":"<p>Thanks for your well thought reply to my regrettably snarky comment. I agree with you on many points, particularly how companies need to be smarter about qualification.</p><p>But yes, this post does seem to directly correlate, in timing and in content, to Patrick&#x27;s Hiring Post. I&#x27;m surprised to see you say this is not your response to that, especially considering that it addresses many of the questions we should ask ourselves as outlined in The Hiring Post (namely consistency, data, and the idea of one being a “natural”).</p><p>Also the post itself is linked in the statement:</p><p>&gt;We’re not here to fix the technical interview: we’re here to destroy it, and create something new and better in its place.</p><p>I disagree with the fact that outreach is a problem in recruiting. There is an entire industry of companies and teams created for the very purpose of reaching out to software developers for their skills. How many of us reading this thread get multiple recruiter emails a week?</p><p>Are the recruiters effective? Maybe or maybe not, but I (who am apparently one of seemingly only few) just don&#x27;t feel that a competitive game needs to add itself as another middleman in the realm of software recruiting with the intent of &quot;destroying the technical interview.&quot;</p>","children":[]}]}]},{"id":9174182,"text":"<p>I find this announcement fascinatingly incomprehensible; it clearly emerges from a slice of the software universe quite distant from mine. The use of the acronym &quot;CTF&quot; suggests that the authors are very familiar with this genre of game; but how exactly does it work? What does it have to do with programming? I guess they are making programming into a game (?) and this somehow has something to do with hiring?</p>","children":[{"id":9174603,"text":"<p>I guess you might be confusing the very unfortunate use of the acronym CTF for security-related programming games with the usual meaning of Capture The Flag, as in a game mode in First-Person Shooters where people work as a team to capture enemy&#x27;s flag and bring it back to their base.</p>","children":[{"id":9174684,"text":"<p>I was previously unaware that security-related programming games existed!</p>","children":[{"id":9174878,"text":"<p>I recognized your confusion because not so long ago, I also had it. I started hearing about reputable security conferences having &quot;CTF tournaments&quot; and was all like &quot;oh cool, they&#x27;re playing shooters for prizes, go geeks!&quot; and then was disappointed when I discovered that someone just stole the term CTF to call pentesting contest with it (it takes a <i>lot</i> of imagination to say that a file is &quot;a flag&quot;...). Not to say those games aren&#x27;t fun - and I <i>am</i> very excited about Starfighter - it&#x27;s just I don&#x27;t like stealing names with well-established meanings and using them to something completely unrelated and not really fitting.</p>","children":[{"id":9174891,"text":"<p>I only know the term as applied in the Defcon sense (which goes back to the late 1990s).</p>","children":[{"id":9175661,"text":"<p>I&#x27;ve always been certain that the name comes from the common children&#x27;s game: <a href=\"https://en.wikipedia.org/wiki/Capture_the_flag\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;Capture_the_flag</a></p><p>right?</p><p>The wiki article has a short discussion of how that morphed into video game terminology, which is the etymology that I&#x27;d expect without having researched it.</p>","children":[]},{"id":9174925,"text":"<p><a href=\"https://www.defcon.org/html/links/dc-ctf-history.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.defcon.org&#x2F;html&#x2F;links&#x2F;dc-ctf-history.html</a></p><p>Wow, I didn&#x27;t realize that, thanks!</p><p>I retract my point about &quot;stealing names&quot;. I guess that this application of term CTF just wasn&#x27;t known widely outside INFOSEC field and that&#x27;s why a lot of programmers (like me) get confused, as security conferences become more recognizable in the mainstream.</p>","children":[]}]}]},{"id":9174967,"text":"<p>you are missing out! check out these unrelated CTF type ventures:\n - <a href=\"http://smashthestack.org/\" rel=\"nofollow\">http:&#x2F;&#x2F;smashthestack.org&#x2F;</a> \n - <a href=\"http://overthewire.org/wargames/\" rel=\"nofollow\">http:&#x2F;&#x2F;overthewire.org&#x2F;wargames&#x2F;</a>\n - NetWars @ SANS</p><p>Actually on further research, here&#x27;s a nice reference:  <a href=\"http://security.stackexchange.com/questions/3592/what-hacking-competitions-challenges-exist\" rel=\"nofollow\">http:&#x2F;&#x2F;security.stackexchange.com&#x2F;questions&#x2F;3592&#x2F;what-hackin...</a></p>","children":[]}]}]},{"id":9174249,"text":"<p>A CTF is a game that one plays by programming.  I wish I could point you to competing CTFs that you can sign up and play right now, but most disappear from the Internet because they are fiendishly difficult to keep running.  Ask me (or any team that has shipped one) why if you&#x27;re curious.</p><p>One example would be MicroCorruption.  <a href=\"https://microcorruption.com\" rel=\"nofollow\">https:&#x2F;&#x2F;microcorruption.com</a>  Thomas and Erin helped build it back when they were still at Matasano.  It&#x27;s a hybrid of a game -- there&#x27;s a narrative, flavor text, a progression of difficulty, levels, a leaderboard, etc -- and a programming assignment.  The programming assignment happens to be some variant of &quot;Here&#x27;s assembly code; find an input which exploits the vulnerability we planted in it.&quot;</p><p>Starfighter CTFs will similarly be a game that one plays by programming.  Similarities end there.  We can do <i>very</i> interesting things with this.</p>","children":[{"id":9174297,"text":"<p>So, for those of us who fit your archetype, that mostly build web apps in high-level languages like Python, haven&#x27;t touched Assembly in a decade, but <i>do not</i> have a team of seasoned hackers hanging out with us in our living rooms, what are the odds that we&#x27;re going to be able to use it to refine our skills in isolation?</p><p>I fully understand that if your company is looking for pen testers, I&#x27;m not the guy you&#x27;d hire.  That&#x27;s cool, but since one of the aims is developing and refining skill, how approachable is it intended to be?</p>","children":[{"id":9174349,"text":"<p>We&#x27;re not looking for pentesters.</p>","children":[]},{"id":9174407,"text":"<p>This game is not for people who like you (or me) don&#x27;t have much interest in assembly, systems programming or pen testing. (This group includes, by the way, a large group of very talented programmers who&#x27;ve shipped most of the software the world uses).</p><p>It is troubling that the language they use on the site implies that systems and security programming is what <i>all programmers aspire to do</i>, but that&#x27;s just an unfortunate bias on the part of the authors. Personally, I think they&#x27;d do well to change it, but perhaps that&#x27;s exactly how they feel and exactly the kind of messaging they need to attract the right people.</p>","children":[{"id":9174528,"text":"<p>I find this to be an issue with many of the articles linked on this site. They refer to &#x27;hackers&#x27; or &#x27;programmers&#x27; .It usually means people doing some sort of web app, or related thing, and it usually doesnt apply to me at all though I know I&#x27;m a very good programmer. I make games.</p><p>I have a background in architecture, its a mature industry and there are architects, structural engineers, mechanical and electrical engineers, architectural technologists, quantity surveyors, project managers etc.</p><p>Perhaps as coding as a job matures over the decades this process will also take place.</p>","children":[]}]}]},{"id":9174567,"text":"<p>I&#x27;m curious – why are they hard to keep running?</p>","children":[{"id":9174586,"text":"<p>They&#x27;re operational nightmares.  Among other reasons, their designed intent is to allow untrusted users to execute arbitrary computer code on your infrastructure.  The abuse problems are mammoth, the not-malicious-but-still-bugged submissions from users even worse.  They have lots of moving parts, most of which are more complicated than standard CRUD app components.</p><p>Also, fundamentally, a CTF is a distraction from the core business everywhere it runs.</p><p>Except Starfighter.</p>","children":[]}]},{"id":9174739,"text":"<p>&gt; A CTF is a game that one plays by programming.</p><p>Or, much more commonly, it&#x27;s a popular game mode in any number of multiplayer games. You&#x27;re using some really niche jargon without properly qualifying it.</p>","children":[{"id":9175184,"text":"<p>When somebody asks for a definition of a word, it&#x27;s not generally considered necessary to explain the term and then also go into detail regarding <i>other</i>, unrelated definitions of the term.</p>","children":[]}]}]}]},{"id":9174440,"text":"<p>Love the concept, can&#x27;t wait to see it. I don&#x27;t normally play computer games, but this sounds intriguing. One minor point: &quot;Alt-tab over to your email and click the confirm link in the email we just sent you.&quot; If you use web-based email, that&#x27;s probably Ctrl-tab :)</p>","children":[]},{"id":9174703,"text":"<p>This sounds like the sort of thing that teenagers would come up with to &quot;solve&quot; recruiting.</p>","children":[{"id":9175046,"text":"<p>I&#x27;m going to go ahead and take that as a compliment.</p>","children":[{"id":9175405,"text":"<p>Yes, that makes sense.</p>","children":[]}]}]},{"id":9174206,"text":"<p>Very cool! Signed up for an invite.</p><p>Couple questions:</p><p>1) Is this a Stripe-like CTF that happens over some caffeine-fueled weekend? Or is it more of an ongoing Project Euler-style drop-in-and-solve type process? I don&#x27;t think I could handle the former, but the latter sounds quite enjoyable and something I might do in my free time just to learn. I did that with PE for a while since it was fun to earn completion points.</p><p>2) You mention &quot;Let&#x27;s Play&quot; style videos. How do you make it so that the solutions aren&#x27;t given away? Does each player have a customized CTF somehow?</p>","children":[{"id":9174275,"text":"<p>I loved the Stripe CTF.  We&#x27;re not going to adopt the time-boxed model from them.  Starfighter : our CTFs :: Blizzard :: Blizzard games.  There&#x27;s no reason for us to ever turn them off.  We&#x27;ll likely have a particular flagship property but we have the option of dropping a new game on the market any time we want.</p><p>You don&#x27;t have to rush through Starfighter games.  Some people will, of course, just like there is a metagame to be the first guild on the server to complete a new raid.  Players are gonna play.  But if you want to pick up our CTF a year after release and just casually spend a few hours learning a new skill, you&#x27;ll be able to do that, and we&#x27;ll fully support you in it.</p><p><i>How do you make it so that the solutions aren&#x27;t given away?</i></p><p>The same way you do it with math problems.  Mastery of the subject material is the easiest cheat code.</p>","children":[{"id":9174918,"text":"<p>&gt; The same way you do it with math problems. Mastery of the subject material is the easiest cheat code.</p><p>This, at best, sidesteps the question. If a solution is a string of characters, that string of characters will end up on the Internet.</p><p>If a solution is a series of tasks---try this string of characters, observe what happens, then try this other string of characters---people will still share the strings and instructions on the Internet. All this still holds if the strings are personalized in some way; then the general patterns will be shared.</p><p>I spent a few years at university as a teaching assistant for a programming course using an interactive IDE where this kind of thing was required: Run the provided unit tests, ONLY THEN write some code, ONLY THEN run these other tests, ONLY THEN make the appropriate modifications etc. The idea was to make cheating more expensive than actually thinking about the issues, and to some extent this succeeded in the narrow sense that cheating WAS more expensive, but it did not succeed in the more general sense: people STILL cheated because they really didn&#x27;t want to think things through.</p><p>The higher the stakes are, the more not-so-great people will be attracted to the system and will chug through based on someone else&#x27;s solutions. This will be a fun game for those who see it as a game, but I don&#x27;t see how the using-this-for-recruiting part will not implode almost instantly.</p><p>Finally, the whole thing about keeping even the general subject areas a secret is a bit silly. The work the best tech companies in the world need ranges from medical visualization to databases to systems programming to pentesting (one of you wrote this will not be a pentest game!) to static analysis and verification to distributed systems to scientific computing to drawing pretty pictures in web browsers to... You will only cover small sliver of this. Everybody knows this, why be an ass about it?</p>","children":[]},{"id":9174708,"text":"<p>&gt;The same way you do it with math problems. Mastery of the subject material is the easiest cheat code.</p><p>Elaborate? Math questions are the opposite of a good example, aren&#x27;t they? Even with randomized values it&#x27;s fairly easy to write generic solutions. People do this even for Project Euler. How much more so for something even cooler sounding?</p><p>(I&#x27;m very excited to see this project and it sounds like a lot of fun. I&#x27;d just be worried that it would end up being gamed, since the drive for cheating is so strong everywhere.)</p>","children":[{"id":9174908,"text":"<p>I actually hope this happens, and that there&#x27;s a community of code sharing that forms around it.</p>","children":[]}]}]},{"id":9174268,"text":"<p>It is long-running and not timeboxed.</p>","children":[]}]},{"id":9175488,"text":null,"children":[]},{"id":9174465,"text":"<p>I&#x27;m not looking for a job and am unlikely to be, hopefully ever again.</p><p>Will this be structured so I can use it as a proxy for a programming mentor?  I think it would be awesome as a replacement for MOOCs, which I enjoy but find inefficient for the time invested. Books are efficient but not as much fun.</p>","children":[{"id":9174487,"text":"<p>You might want to check out <a href=\"http://www.freecodecamp.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.freecodecamp.com&#x2F;</a> .  I think they do pair programming</p>","children":[]}]},{"id":9174982,"text":"<p>This is neat, but is it really that hard for people to tell who has the skills they&#x27;re looking for and who doesn&#x27;t? Every developer I&#x27;ve interviewed it&#x27;s been really obvious to me what they know and what they&#x27;re bullshitting about.</p><p>I guess there&#x27;s value is all in assembling a pre-qualified pool for employers to recruit from, though.</p><p>But in that way this is kind of like the 2015 version of CNE. Except it&#x27;s free, which is good. And hopefully less miserable.</p>","children":[{"id":9175537,"text":"<p>If you read <a href=\"http://sockpuppet.org/blog/2015/03/06/the-hiring-post/\" rel=\"nofollow\">http:&#x2F;&#x2F;sockpuppet.org&#x2F;blog&#x2F;2015&#x2F;03&#x2F;06&#x2F;the-hiring-post&#x2F;</a>, you will see that this approach is looking to find folks that were not obviously good, as you say, but they found someone that is a stellar crypto breaker.</p>","children":[]}]},{"id":9173961,"text":"<p>I&#x27;m all, involved? and stuff? You can, like, ask us stuff, I guess.</p><p>Let me answer the most frequent questions we&#x27;re getting right here:</p><p>&quot;CTF&quot; stands for &quot;Capture The Flag&quot;. Conventionally, it&#x27;s a contest with a collection of &quot;flags&quot; each of which is guarded by a programming puzzle; teams of people compete to collect flags. What we&#x27;re doing is not a conventional CTF, but if you want to get the flavor of what we&#x27;re doing (without the whole game dynamic), check out MICROCORRUPTION.COM, which is a more conventional CTF we ran last year.</p><p>Security is one of two problem domains we&#x27;re starting with. But this isn&#x27;t a &quot;security recruiting&quot; service, and our take on security uses it as a venue for systems and network programming, not for the minutia of SQL query quoting rules.</p>","children":[{"id":9174277,"text":"<p>Congrats on this new venture, looks fun.</p><p>What do you expect will be the effect of this on hiring women? Do you have any relevant data from microcorruption (what % players were women)? It&#x27;d be great if Erin could also chime in.</p>","children":[{"id":9174426,"text":"<p>We do not have access to the µc data, any longer. That belongs to Matasano. I am now sad that I did not ask myself the same question and pay closer attention while I did.</p><p>However, this is what I am hoping and dreaming for: that work-sample testing will completely level the playing field. Regardless of gender, age, or origin, if you can do the work, you should get the job. I believe in this so strongly that I am dedicating the rest of my career to work sample testing and, eventually, training.</p><p>Getting women to play, though? I&#x27;m not so great at marketing, so still working on that. I am writing a blog post to go up later in the week that addresses some of the issues in hiring women, based on my personal experiences and those of my female peers.   The tone of the post is as politically neutral as it can be. My hope is to draw out some productive dialog rather than piling on stink for flies. Specifically, vast majority of the people in my professional network, male, female or in between, are genuinely interested in addressing the &quot;women-hiring problem,&quot; but they avoid any discussion of it because ... well, it&#x27;s always covered in flies.</p><p>The challenge will be to make just enough of a stink that it draws attention and not flies.</p>","children":[{"id":9174901,"text":"<p>&gt; However, this is what I am hoping and dreaming for: that work-sample testing will completely level the playing field. Regardless of gender, age, or origin, if you can do the work, you should get the job.</p><p>That&#x27;s a nice thought, though it rather presumes that the playing field is level <i>outside</i> of the immediate neighborhood surrounding the hiring process.</p><p>I think that neighborhood, though, is probably, while not <i>without</i> gender&#x2F;race&#x2F;etc. bias, overrated in terms of the proportion of that bias on the course between birth and getting a software job that it is perceived to contribute.</p>","children":[{"id":9175603,"text":"<p>I think the desire to to figure out where a level playing field can be built within a neighborhood of aptitudes. And to be fair to a process of refinement for that goal, some problems can&#x27;t be solved before you have them. Like a business plan, the initial draft is just a guess, and I think we can all agree that it&#x27;s a heretofore unsolved problem, the gender thing.</p>","children":[]},{"id":9175615,"text":null,"children":[]}]},{"id":9174666,"text":"<p>&gt;The tone of the post is as politically neutral as it can be. My hope is to draw out some productive dialog rather than piling on stink for flies.</p><p>I am sorry, but that is a line with a negative width: if you so much as hint that this may in part be the fault of males (as a whole or, even worse, individuals) pitchforks will be out. If you do not hint strongly enough that this is the fault of males (as individuals and as a group) pitchforks will be out on the other side. As a more personal point the sheer toxicity of those debates continues to shock me, even after spending more than a decade on the internet. Vi vs Emacs debates don&#x27;t tend to end in treats of rape and&#x2F;or genocide but &quot;why aren&#x27;t there more women in computing&quot; almost always do.</p><p>This isn&#x27;t to say that we can&#x27;t draw any benefit from your writing, just be aware that of the things you can&#x27;t say (<a href=\"http://www.paulgraham.com/say.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.paulgraham.com&#x2F;say.html</a>) this is the thing you can&#x27;t say most.</p>","children":[]}]}]},{"id":9174025,"text":"<p>No questions, just a hearty &quot;Congratulations!&quot; and &quot;Good luck!&quot;</p><p>I&#x27;m excited to see this develop.</p>","children":[]},{"id":9174537,"text":"<p>Thank you for running a long-term CTF ! I&#x27;ve always been interested in those &quot;improve your coding skills by playing&quot; challenges but from my inexistent experience most of them fall in a combination of:</p><p>- They are timeboxed</p><p>- They are mostly (if not only) about cracking security</p><p>- They are targeted towards low-level languages</p><p>You&#x27;ve already stated that it won&#x27;t be timeboxed (which totally makes sense as a hiring &quot;middleman&quot;: you&#x27;re interested in applicants at all times). You already said that security will not be the single domain. Now, will I be able to use Starfighter as an excuse to finally stop procrastinating and learn that shiny new language I&#x27;ve had on my to-learn list for far too long ? (Patrick more or less hinted it shouldn&#x27;t be the case, but I&#x27;d like to know)</p><p>I&#x27;m really looking forward to this. On the overall point of breaking the interview standard we have, I&#x27;d like to say a huge &quot;Thank you&quot;. The points you&#x27;ve made in your blog post really resonate with what I can see (the interview process is a joke if you want to hire actual programming engineers). I really hope we can move towards a model where applicants can show skills through a portfolio, of which Starfighter should be a part if I understand things correctly.</p>","children":[{"id":9175726,"text":"<p>If you haven&#x27;t seen it before, check out <a href=\"https://projecteuler.net/\" rel=\"nofollow\">https:&#x2F;&#x2F;projecteuler.net&#x2F;</a> which is a series of (very) loosely connected programming challenges.</p><p>The challenges start mostly bite-sized and typical programming problems (think fizzbuzz or &quot;what is the 100th prime&quot;) and grow into some really interesting areas. You use whatever language(s) you wish, with no time limit, and are free to skip around to whichever questions interest you (or just do them in order... whatever you like)</p><p>I find it fun. You might too.</p>","children":[]}]},{"id":9175059,"text":"<p>I got completely stuck on the first level of Microcorruption. Should I even attempt this new stuff?</p>","children":[{"id":9175100,"text":"<p>Yes. And as someone who also was stuck for many moons on later levels of that challenge: keep going. Research. Ask questions -- people will help. Honestly, I had no expectation of getting past the first microcorruption level but goddamn if it doesn&#x27;t feel good when (not if) it happens.</p>","children":[{"id":9175215,"text":"<p>\\o&#x2F;</p>","children":[]}]}]},{"id":9174825,"text":"<p>Is it ok for a group of us who to complete the challenge as a team for fun?  Or must we agree to only work individually?</p>","children":[{"id":9174832,"text":"<p>Fun is the point.</p><p>I don&#x27;t know exactly what the &quot;rules&quot; are going to be, but what rules we have will have one purpose: not to screw the game up for anyone else.</p>","children":[]}]},{"id":9174320,"text":"<p>My first thought when reading the blurb on your site was &#x27;oh great... they&#x27;re going to make a CTF where you have to participate in a team, and all other members of your &#x27;team&#x27; are actually AI programmed to be as distracting and abrasive as possible and you will have to work on a 25 year old PL&#x2F;SQL system designed by a prima donna so you can show your ability to work in hostile environments.&#x27;   I am sure that&#x27;s not what you&#x27;re doing, but that&#x27;s what comes to mind when I hear &#x27;real systems&#x27; and &#x27;real challenges&#x27;...</p>","children":[{"id":9174328,"text":"<p>You will not have to participate in a team or work on my 25 year old PL&#x2F;SQL system; I made the PL&#x2F;SQL optional.</p>","children":[]}]},{"id":9174588,"text":"<p>Will you be allowing anonymous participation?</p><p>By this I mean, the article uses some creepy language as only a company enthusiastic about its power to broker reputation can.</p><p>&gt;&gt;We can tell you exactly what happened when your candidates tried to implement a REST API.</p><p>What, are you going to keep a record of the time I fiddled with it for an afternoon and then use that to disqualify me from a job?</p><p>You say elsewhere about MicroCorruption:</p><p>&gt;Microcorruption player identities were totally private.  There&#x27;s no way for a recruiter to look someone up, unless they used a very-identifiable username.</p><p>Sounds like a good starting point, but what if I don&#x27;t want my report card stored and used to compare with other people?  What if I don&#x27;t want to feel like my performance is owned by you?</p><p>&gt;&gt;We assess for skill first, passively as players play our games and then actively. Our founders — talented technologists — personally reconstruct candidates’ solutions and evaluate them.</p><p>If I don&#x27;t have any control over how and when my information is going to be monitored, I&#x27;m forced into an ugly position where I have to treat the whole thing as part of my career and perform competitively.  The sense of relaxed exploration is killed, the idea of treating it like a college course or project isn&#x27;t viable, and honestly I begin to resent the project.</p><p>Alternatively, I play on an anonymous account, and then if I decide to use <i>my</i> information <i>about me</i> in a professional setting, I&#x27;m best served by creating a <i>new</i> account and just redoing everything.</p><p>Edit:  I should say that the idea really excites me and I&#x27;d love to learn in this format.</p>","children":[{"id":9174657,"text":"<p><i>Will you be allowing anonymous participation?</i></p><p>Yes.  You can participate anonymously or pseudonymously.  I think we say in three places that we only give out contact details if candidates ask us to.</p><p><i>What, are you going to keep a record of the time I fiddled with it for an afternoon and then use that to disqualify me from a job?</i></p><p>Our incentive is to find reasons why you&#x27;re hireable, not reasons why you&#x27;re not.</p><p><i>What if I don&#x27;t want to feel like my performance is owned by you?</i></p><p>Your performance is owned by you -- we won&#x27;t have copyright to your code or anything.  Signal we gather, though?  Owned by us.  That&#x27;s the trade: we give you a really fun game to enjoy, but we control the universe you play in and, inside that universe, we control everything and see everything.  If you do not like this trade, that&#x27;s your prerogative and I respect your opinion.  Nobody will force you to play Starfighter.</p>","children":[{"id":9174764,"text":"<p>Edit: The following is a neutral appraisal, not a criticism of either the implicit or explicit variety.</p><p>If you feel that it is an accusation or a criticism, I would suggest that indicates something unrealistic in how <i>you</i> view business negotiations.</p><p>As patio said, this <i>is</i> a trade between interested parties.  Generosity is therefore <i>expected</i> to be limited.</p><p>---</p><p>Fair enough.  I just wanted it on record that this is a business transaction for you, not a generous educational endeavor.</p><p>Some people want to pretend that they&#x27;re in it to make the world a better place when that&#x27;s not truly their absolute top priority.  They&#x27;re probably asking &quot;Why can&#x27;t it be both?&quot; when I say that this is business, not generosity.</p><p>One simply can&#x27;t have multiple top priorities, particularly with profit and generosity; generosity is practically defined as something that doesn&#x27;t profit.  Something like one of your (patio&#x27;s) blog posts are given generously in that there is no formal expectation&#x2F;obligation on a reader to &#x27;give back&#x27; some asset, for instance.</p><p>Thank you for your clarification.</p>","children":[{"id":9174791,"text":"<p>If your top priority is providing a service to the community (e.g., education), you need a sustainable support model, whether its as a business or through someone else&#x27;s charitable donations.</p><p>If your top priority is a profit-making business, you need to provide a product that is (or, at a minimum, people perceive as) valuable.</p><p>Perhaps you can&#x27;t have two top priorities (I actually am not sure I agree that this is the case, I don&#x27;t see that it is actually impossible for two priorities to be equal in priority and above all others), but even if you can&#x27;t, its quite possible for &quot;business&quot; to be a means and &quot;education&quot; to be the goal, and vice versa. They aren&#x27;t incompatible.</p>","children":[{"id":9174822,"text":"<p>Which is why I was careful to prepend &quot;generous&quot; to every instance of &quot;education&quot; in my response.  Starfighter isn&#x27;t generosity of knowledge, it&#x27;s barter of it.</p><p>Perhaps what you&#x27;re saying is true in that universities have a financing division, but my point is that this isn&#x27;t a case of university.  The focus is on how they&#x27;re going to make money as middlemen (and dwarves will sing about their riches), not how their business is subservient to their idealistic educational aims.</p>","children":[{"id":9174850,"text":"<p>Even if you are being generous with your time and effort, you can&#x27;t carry out an effort with any kind of reach without some support model. Financing it through its own operations may not be the only choice, but its not a choice incompatible with generous motivation.</p>","children":[{"id":9174933,"text":"<p>The thing is, making money off providing a useful service that benefits society as a whole isn&#x27;t immoral, so I don&#x27;t see why it&#x27;s that big of a deal. Nobody is forcing anyone to participate.</p><p>EDIT: In fact, socially rewarding companies that do good things incentivizes others to adopt ethical strategies and might do more good than a vow-of-poverty educational service provider.</p>","children":[]}]}]},{"id":9174837,"text":"<p>Exactly. Tesla Motors comes to mind as a company for which &quot;electrification of the world transportation&quot; is the goal, and &quot;profitable business&quot; is only means to an end.</p><p>I understand the fear though; most of the companies we interact with (and I&#x27;d wager, 90% of startups we see here) are what I call toilet-paper companies - they&#x27;d gladly switch from whatever it is they&#x27;re doing to manufacturing toilet paper if that would render more profit or increase chances of getting acquihired; their top priority is business, not the goal. I hope that Starfighter isn&#x27;t such toilet-paper endeavour.</p>","children":[]}]}]}]}]},{"id":9174078,"text":"<p><i>Disclaimer: I have only skim read the article, so this is for my laziness and the benefit of all</i></p><p>Apart from the gameplay mechanism with code challenges, how is this better &#x2F; different to HackerRank for a) &quot;programmers&quot; b) companies?</p>","children":[{"id":9174109,"text":"<p>See <a href=\"http://www.microcorruption.com\" rel=\"nofollow\">http:&#x2F;&#x2F;www.microcorruption.com</a>.</p>","children":[]}]},{"id":9174628,"text":"<p>How are you planning on combating cheating? For sure people will post solutions online to your CTFs.</p>","children":[{"id":9174841,"text":"<p>I bet that Thomas and Patrick could do something like have dynamically created tests, where there are multiple versions of an exploit, so that they test the same skill but in different ways.  You might have a challenge that tests whether you can do SQL injection, but the tables may differ. Overrunning a buffer (as Patrick mentioned in his post about Microcorruption) could depend on different payloads.</p><p>I naiively believe that things could be varied enough that you would need to understand the concepts rather than paste answers, in which case &quot;cheating&quot; would mean &quot;learning&quot;, and is basically something they say they want you to do.  I&#x27;m not sure how hard it would be to get to that point rather than being vulnerable to Bob the Super Coder posting walkthrough screencasts, but I trust that the founders are already savvy enough to have been thinking about that.</p>","children":[{"id":9175652,"text":"<p>Unfortunately, I suspect you overestimate the obfuscating power of dynamic content when the number of users is sufficiently large.</p><p>A certain MMO I play recently had a limited-time event built around figuring out the meaning of different clues (locations to go to for the actual meat of the event), and despite a fairly large number of variations, people had collectively figured out just about every possible clue-&gt;location mapping within a matter of hours.</p><p>That&#x27;s not to say you can&#x27;t prevent cheating, but that even with relatively little incentive (that whole clues thing gave only a single cosmetic item, and anecdotally I&#x27;ve seen very few people actually use theirs) users can and most likely <i>will</i> outpace any attempt to prevent it by means of varying the problem.</p>","children":[]}]},{"id":9175713,"text":"<p>This is an important problem. As part of interviewing processes, I have several times tried offering &quot;take home work challenges&quot;. I had to stop after, having run the experiment several times, I detected plagiarism in about 30-40% of the cases. The risk is of plagiarism is real for any problem that&#x27;s well known enough that the problem and solution can appear online, and detecting plagiarism is not always easy.</p>","children":[]}]},{"id":9175398,"text":"<p>On your &quot;About Us&quot; page, you say &quot;We&#x27;re especially interested in talking to you if you will be hiring 10+ engineers in the next year, as we may be able to help you out with that. Get in touch with any of us.&quot;</p><p>Does a company need to be hiring 10 or more engineers to make it worth it to talk to you?</p><p>I&#x27;m at a small company, that has been trying to hire engineers for the last couple of years, and not having much success; we&#x27;ve hired a couple, had a couple take other offers, lost a few to attrition.</p><p>We would love to be able to get some candidates who have already passed a technical screen; less time for us, scheduling an hour with a bunch of candidates who don&#x27;t pan out, less time for them, only focusing on one more in-depth set of problems rather than a whole bunch of different phone screens.</p><p>But we&#x27;re not hiring 10+ developers any time soon; that would double the worldwide size of our dev team. We&#x27;re looking for maybe 3 or so at this point.</p><p>Would you consider working with smaller companies as well?</p>","children":[{"id":9175618,"text":"<p>I obviously can&#x27;t speak for the founders, but I suspect that if you&#x27;re viewing this as a replacement for a technical phone screen, you might not be viewing it as intended.</p><p>Did you read Thomas&#x27; &quot;The Hiring Post&quot; which was at the top of HN a couple days ago?</p>","children":[]},{"id":9175469,"text":"<p>They just say, &quot;especially,&quot; and I think a charitable reading would tell us that it&#x27;s a call to get a good base of early adopters from which more-easily generalizable results can be gleaned.</p>","children":[]}]},{"id":9174374,"text":"<p>Can you talk at all about the pricing structure for companies that will use your app for recruiting?</p>","children":[{"id":9174504,"text":"<p>Patrick can, at patrick-at-starfighters.io.</p>","children":[]}]},{"id":9174631,"text":"<p>As someone who plays in a lot of &quot;conventional&quot; CTFs (e.g. DEFCON, Codegate, GitS, etc.), this sounds very cool, even if my participation in those already gets me some job offers :)</p><p>One question: for a less &quot;just for fun&quot; site like this, with no time barriers, how do you plan on dealing with people just following write-ups? You can randomly generate the flags, but people could still follow the steps. You can say &quot;don&#x27;t write write-ups,&quot; but write-ups will still be written ;)</p>","children":[{"id":9174808,"text":"<p>This is (a) a real challenge, (b) something we&#x27;re addressing in part by not letting the content get stale, (c) something we were surprised by with the crypto challenges --- if you ask people to follow the honor system, they tend to do it! --- and (d) something that the game model will also somewhat address.</p><p>It&#x27;s hard for me to go into more detail on (d) without revealing a whole bunch of stuff about the game I don&#x27;t want to talk about yet; I should be more comfortable talking about it, but until we announce it officially I have a lot more leeway to slip rev1 features. :)</p><p>The shortest simplest answer though is: we&#x27;re a firm whose whole purpose is to make fun, interesting CTF-style games (well, one game; we&#x27;re the Blizzard of CTFs, and we&#x27;re building our WoW), so we can address a lot of these kinds of problems with brute force, because this isn&#x27;t a spare-time thing.</p><p>If it helps to understand where we&#x27;re coming from:</p><p>Chris Eagle, the author of The IDA Pro book, published an IDA Pro plugin for the bizarro-MSP430 that Microcorruption (our last CTF) emulates. There are tools with &quot;microcorruption mode&quot; in them because of all the little ways we broke MSP430. Someone wrote a symbolic execution engine to solve the Hollywood level on Microcorruption and posted it to Github. There is <i>still</i> a #uctf channel on Freenode for Microcorruption.</p><p>This. Is. Awesome. It is my favorite thing about Microcorruption.</p><p>We did practically nothing at all to foster a community for Microcorruption, apart from Erin starting the IRC channel. That&#x27;s not an opportunity we are going to miss this time; in fact, doing better on the community and sharing side is part of the thesis of the company.</p><p>I reallllllllllllly hope people share code and tools and stuff to make progress in the game. How cool will that be?</p>","children":[{"id":9174948,"text":"<p>&gt; <i>&quot;... if you ask people to follow the honor system, they tend to do it!&quot;</i></p><p>This is great but I think the stakes are somewhat different if it&#x27;s ostensibly about jobs&#x2F;hiring.  I don&#x27;t recall the crypto challenges being promoted as a hiring mechanism (though they may have been useful for that).</p>","children":[{"id":9174969,"text":"<p>The crypto challenges were how we (for instance) hired Alex:</p><p><a href=\"http://sockpuppet.org/blog/2015/03/06/the-hiring-post/\" rel=\"nofollow\">http:&#x2F;&#x2F;sockpuppet.org&#x2F;blog&#x2F;2015&#x2F;03&#x2F;06&#x2F;the-hiring-post&#x2F;</a></p><p>I think we plan on making minimal demands of our users, and none of them involve grooming them for prospective employers.</p><p>Look, the reality is, most of the people who participate aren&#x27;t going to be looking for a job when they do. So all our incentives are to make the experience itself rewarding to participants.</p><p>I&#x27;m weird about typing those words because very very soon we&#x27;re going to actually ship the first rev and levels of this thing, and as anyone who ships software knows: right now, at this point in the release calendar, my instincts are to be LOWERING the bar, not raising it. :)</p>","children":[{"id":9175048,"text":"<p>&gt;I think we plan on making minimal demands of our users, and none of them involve grooming them for prospective employers.</p><p>&gt;most of the people who participate aren&#x27;t going to be looking for a job when they do.</p><p>This is weird, and I&#x27;m sensing some miscommunication between you and patio.</p><p>I&#x27;m only hearing about this as a tool for proving my worth.  Your major marketing (as far as I&#x27;ll likely ever be aware) has CAREER CAREER CAREER stamped all over it.</p><p>People won&#x27;t follow the honor system if the stakes are at the &#x27;career&#x27; level.  You&#x27;re losing the &#x27;fun and free&#x27; culture of Microcorruption that makes people spend their free time building fun tools.</p><p>Your understanding of the incentives differ from the incentives that <i>have</i> been communicated to me about Starfighter.</p>","children":[{"id":9175187,"text":"<p>Patrick.</p><p>You&#x27;re fired.</p><p>Anonymous Throwaway Account? Yes, you over there. I&#x27;m looking RIGHT AT YOU. Yes you.</p><p>You&#x27;re the new CEO.</p><p>Get to work. Explain this to everyone else on HN. The clock&#x27;s ticking!</p>","children":[{"id":9175425,"text":"<p>Just giving feedback as someone that&#x27;s theoretically right square in the middle of your target audience.  I <i>really</i> want to take this &#x27;college course&#x27; and take advantage of what I see as your opportunity as a security expert to make your knowledge replicable.</p><p>But I&#x27;ll play along.  I&#x27;ll be taking Starfighter in a new direction.  Most notably, we&#x27;ll be reorganizing how we react to online discussion.  Anonymous critics will be summarily executed unless we cannot identify them, in which case they shall merely be barred from Starfighter for life, which, if you believe our marketing department (AND AS CEO I DO IN FACT I&#x27;M SORRY I IMPLIED IT WAS POSSIBLE TO DOUBT THEIR CLAIMS), will make it very difficult for them to find work in the hiring utopia that is the post-Starfighter process.</p>","children":[]}]}]}]}]}]}]},{"id":9175146,"text":"<p>A Frickin&#x27; awesome idea.</p><p>My best wishes in your success!!!</p><p>I look forward to the results.</p>","children":[]},{"id":9174896,"text":"<p>Do you have a wishlist of all the problem domains you&#x27;d like to tackle? (I&#x27;m thinking web, mobile, and desktop applications above the system level when I ask this, but any other areas are wonderful. Databases. etc.)</p>","children":[{"id":9174929,"text":"<p>We prefer to keep things a pleasant surprise, but we&#x27;ll be emailing anyone who signs up with a suggested reading list if they want to start brushing up on old skills or acquiring new ones to get ready for launch day.  The reading list will give a good deal of direction.</p>","children":[{"id":9174943,"text":"<p>Right now I&#x27;m wondering, &quot;Does this have any overlap with tptacek&#x27;s Amazon reading list?&quot; but I suppose I&#x27;ll find out with the email arrives.</p><p>Thanks :)</p>","children":[]}]}]},{"id":9174394,"text":"<p>Is this a reference to &quot;The Last Starfighter&quot;?</p>","children":[{"id":9174640,"text":"<p><i>&quot;Greetings, Starfighter! You have been recruited by the Star League to defend the Frontier against Xur and the Ko-Dan Armada.&quot;</i></p>","children":[{"id":9175073,"text":"<p>This was how Thomas announced to me that Starfighter would exist and I would be CEO of it.  I was confused as heck until I actually saw the movie.</p>","children":[{"id":9175154,"text":"<p>lol!</p>","children":[]}]}]},{"id":9174520,"text":"<p>Back to sleep, Louis, or I&#x27;m telling Mom about your Playboys!</p>","children":[]}]},{"id":9174936,"text":"<p>EDIT: Ill need to lookup other CTFs like this... as clearly I am not familiar with how they work.</p>","children":[]},{"id":9174429,"text":"<p>Hey, tptacek.</p><p>Your last post on hiring definitely found its legs and I am sure will cited for some time to come. You mentioned that you used to send a sampling of key text books to potential Matasano candidates and was wondering if you could share some references. I imagine Applied Crypto might be on there. Any any other important resources for mastering CTFs you might pass along would be obliged ;)</p>","children":[{"id":9174484,"text":"<p>Definitely don&#x27;t read Applied Cryptography!</p><p><a href=\"http://sockpuppet.org/blog/2013/07/22/applied-practical-cryptography/\" rel=\"nofollow\">http:&#x2F;&#x2F;sockpuppet.org&#x2F;blog&#x2F;2013&#x2F;07&#x2F;22&#x2F;applied-practical-cryp...</a></p>","children":[]}]},{"id":9174462,"text":"<p>Sounds interesting. What&#x27;s the ETA?</p>","children":[{"id":9174493,"text":"<p>Optimistically, weeks-not-months.</p>","children":[]}]},{"id":9174732,"text":"<p>This looks great. Looking forward to trying it. Good on all of you for trying to change the tech hiring status quo.</p><p>I know this whole thing is still in flux, but does it look like there are going to be any remote work opportunities in the early days? I&#x27;m probably in the minority but given my personal circumstances (living in a non-tech-rated US city and not considering moving) I&#x27;m really only available for remote.</p>","children":[]},{"id":9175527,"text":"<p>While this might indeed help employers find better employees, I am concerned about hidden (or not so hidden) bias. Games like this (and the way this one is described confirms it) select for competitive people. Other talented programmers might prefer expressing their creativity and talent in less competitive ways. While competitiveness might be a desirable quality, sometimes it is not. It might also appeal to men more than women, and so might be inadvertently sexist. I think you should very carefully analyze player demographics to make sure you&#x27;re not making matters worse in terms of diversity.</p><p>When you design a test -- any test -- you should make sure that 1&#x2F; score correlates with success (i.e. <i>full bivariate correlation</i>), <i>and</i> 2&#x2F; if the test is voluntary, that there are no prior biases which would select candidates prior to taking the test.</p>","children":[{"id":9175550,"text":"<p>Best answer I can give was that we&#x27;ve heard that concern from a bunch of different sources, we share it, and we&#x27;re designing against it to some extent.</p><p>As a reminder: this is an outreach strategy we deployed at Matasano to enormous success. We had an English professor finish the crypto challenges. We didn&#x27;t solve all our diversity problems, but we made a palpable dent in them, and we did that by coming up with something that surfaced aptitude that wasn&#x27;t held hostage to the biases of random human interviewers.</p><p>There is, to my mind, no hope for the &quot;random human interviewer&quot; hiring strategy. It&#x27;s hard to make the problem we have now worse. But we&#x27;re watching out for it.</p><p>I would love to hear more thoughts on how we can address this at the level of game design! We&#x27;re at a &quot;finishing touches on infrastructure, just starting with level design&quot; place in our design right now.</p>","children":[{"id":9175602,"text":"<p>The thing is that the effect of such biases is hard to measure directly. Employers will get better employees than before, but may also miss more good employees than before, yet notice the former much sooner than the latter (which will have a delayed effect).</p><p>The best way to address it is to first measure for biases (run a demographic analysis on players), and second actively design for unselected populations with focus groups. I am sure some of this information has already been collected by game studios.</p>","children":[]}]}]},{"id":9175017,"text":"<p>Will you get me above £100k in London?</p>","children":[]}]},{"id":9174988,"text":"<p>And then there were four.</p><p>This theme (test your coders, don&#x27;t interview them) is spreading about, I keep getting spammed by them as a way to &quot;only hire top talent!&quot; its an interesting proposition and I can&#x27;t wait to see a bit of history behind it. At the very least it will weed out people who think they are programmers when they are not.</p>","children":[]},{"id":9174222,"text":"<p>Will you (patio11, tptacek, elptacek) apply to YC someday?</p><p>That would be uhm... i don&#x27;t even know the right adjective.</p>","children":[{"id":9174658,"text":"<p>Honestly they don&#x27;t seem to be a good fit. I mean they are going to get in, no issue, but they already know how to run a business (charge more) and they can pretty easily get access to investors.</p><p>The more interesting question is if they will ever end up teaching at YC.</p>","children":[]}]},{"id":9174481,"text":"<p>Patrick,</p><p>What is going to happen with Appointment Reminder now?</p>","children":[{"id":9174654,"text":"<p>The answer is at the bottom of the announcement: &quot;I have no announcement to make about my involvement with Appointment Reminder at this time. We will, naturally, continue keeping all commitments to our customers.&quot;</p>","children":[{"id":9174763,"text":"<p>Thanks - I just found it myself and came back to edit my question.</p><p>That&#x27;s a non-answer though. Let&#x27;s see how the answer about the fate of Appointment Reminder would evolve over time.</p><p>In any case, that&#x27;s an extra proof that being solo-founder while possible - is a disadvantage.</p>","children":[]}]}]},{"id":9174482,"text":"<p>Hum, Thomas and Patrick working together... That by itself is worth keeping an eye on.</p><p>I didn&#x27;t do so well on the microcorruption game. I&#x27;m curious to see what else they can come up with, hopefully both less specialized, more generic, but also more advanced...</p>","children":[]},{"id":9174227,"text":"<p>Maybe it&#x27;s a British thing, but the breathless enthusiasm starts to seem a little weird by about halfway down the page.</p>","children":[{"id":9174845,"text":null,"children":[]}]},{"id":9173979,"text":"<p>I&#x27;m excited; tptacek seems to have put a lot of thought into the hiring process and approaches to improve it. I&#x27;m in.</p>","children":[]},{"id":9174496,"text":"<p>This looks very innovative; I hope it&#x27;s a great success.</p>","children":[]},{"id":9174248,"text":"<p>I&#x27;m sure you&#x27;ve got your own ideas for your CTFs, but if you haven&#x27;t heard of them before I would recommend you check out the Matasano Crypto Challenges (cryptopals.com).  They ran them privately for awhile, you just emailed them and said you wanted in and they sent you the challenges, once you emailed the answers for one batch they gave you another, etc.  I&#x27;ve tried various &#x27;code gaming&#x27; things before, and the Matasano challenges were, in my opinion, the best ones I&#x27;ve come across.  (I am exempting things like Stepic&#x27;s bioinformatics challenges since their main goal is to expand your knowledge of bioinformatics rather than of programming, though they do get into some advanced data structures later on)</p>","children":[{"id":9174335,"text":null,"children":[]},{"id":9174392,"text":"<p>The founders of Starfighter were the founders of Matasano.</p>","children":[]},{"id":9174414,"text":null,"children":[]},{"id":9174415,"text":"<p>We wrote the Matasano Crypto Challenges.</p><p>Besides cryptography, what are some other programming problem domains you&#x27;d enjoy playing with? We&#x27;re particularly interested in problem domains that are hard for ordinary programmers to pick up on a whim. We want to make it possible to seriously engage with interesting problems while in your couch with the Daily Show running in the background.</p>","children":[{"id":9175604,"text":"<p>I guess what sort of domains do people like to play around with in their own time?  For games there&#x27;s 3d rendering, physics and AI which seem fun (at least to me) but I&#x27;m not sure how to necessarily make fun challenges out of them.</p><p>For non-direct-games things fancier AI like deep learning, audio synthesis, making compilers&#x2F;parsers&#x2F;transpilers, math stuff like project euler, puzzle&#x2F;board game solvers&#x2F;bots (<a href=\"https://gist.github.com/christopherhesse/51e9baf0e3d440d8afff\" rel=\"nofollow\">https:&#x2F;&#x2F;gist.github.com&#x2F;christopherhesse&#x2F;51e9baf0e3d440d8aff...</a>) come to mind.</p><p>Some of the stuff in the 3rd stripe CTF was pretty interesting like making a search engine or dealing with distributed system consensus problems (raft).</p><p>Maybe using the coolest new framework is fun for some people, like a challenge could involve angular.js so you could get some experience using it without having to go full-on side project or put it in at work without having any real idea if you should.</p><p>Implementing things that you are familiar with but that you don&#x27;t understand the internals of has been fun for me in the past (for instance like <a href=\"https://www.mikeash.com/pyblog/friday-qa-2015-02-20-lets-build-synchronized.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mikeash.com&#x2F;pyblog&#x2F;friday-qa-2015-02-20-lets-bui...</a>).  Maybe you always wondered how this thing works, and now you can figure it out and solve this challenge at the same time.</p>","children":[]}]},{"id":9174737,"text":"<p>That looks like fun.  Thanks for pointing it out -- and thanks, tpacek et al for producing it.</p>","children":[]}]},{"id":9174256,"text":null,"children":[]}],"WordIDMapping":{"wond":[9174272,9174052,9174166,9174844,9174896],"inspired":[9174272],"part":[9174272,9174360,9175107,9175221,9174170,9174317,9174120,9174772,9174870,9174838,9174417,9174539,9174407,9174586,9174918,9174666,9174537,9174588,9174764,9175713,9174808],"rec":[9174272],"alan":[9174272],"turing":[9174272],"movi":[9174272,9174127,9175073],"try":[9174274,9175107,9174174,9175241,9174918],"employ":[9174274,9174293,9174302,9174337,9175336,9175387,9174447,9174117,9174151,9174366,9175057,9174448,9174531,9174844,9175206,9174982,9174969,9175048,9175527,9175602],"particularly":[9174274,9174360,9174534,9175728,9174764,9174415],"targeted":[9174274,9174087,9174537],"toward":[9174274,9174563,9174305,9174367,9174537],"develop":[9174274,9175712,9175058,9174154,9174563,9174479,9174417,9174559,9174557,9174443,9175728,9174982,9174025,9175398],"her":[9174274,9175058,9174039,9174930,9174378,9174174,9174772,9175620,9174861,9174202,9174443,9174898,9175241,9175728,9173961,9174837],"south":[9174274],"africa":[9174274],"look":[9174276,9174293,9175553,9174154,9174388,9174448,9174531,9174277,9174588,9174969,9175146,9174732,9174496,9174737],"fantast":[9174276],"one":[9174276,9174049,9174064,9174178,9174408,9175081,9174170,9175072,9174563,9175336,9175380,9174056,9174404,9174479,9175387,9174359,9174879,9174772,9174890,9174447,9175620,9174142,9174237,9174146,9174147,9174539,9174559,9174366,9175057,9174455,9174424,9174443,9175728,9174249,9174297,9174739,9174440,9174918,9173961,9174832,9174764,9175398,9174631,9174808,9174929,9175527,9174248],"poss":[9174276,9174101,9175221,9175564,9174174,9174443,9174320,9174791,9175652,9175425,9174763,9174415],"wrinkl":[9174276],"predict":[9174276],"although":[9174276],"top":[9174276,9175072,9174284,9174378,9174534,9174443,9175206,9174764,9174791,9174837,9175618,9174988],"performing":[9174276],"starfight":[9174276,9174064,9174815,9174170,9174201,9174382,9174337,9175328,9174094,9174127,9174056,9174317,9174574,9174404,9175387,9174174,9174879,9174903,9174890,9175519,9174202,9174146,9174299,9174448,9174531,9174624,9174169,9175206,9175241,9174878,9174249,9174586,9174275,9174537,9174657,9174822,9174837,9174504,9175048,9175425,9174394,9174640,9175073,9174392],"divers":[9174276,9174898],"lot":[9174276,9174039,9175072,9175564,9174534,9174447,9174881,9174955,9174401,9174559,9174749,9175241,9174878,9174925,9174586,9174708,9174631,9174808,9173979],"lack":[9174276],"diversity":[9174276,9174401,9175527,9175550],"hop":[9174276,9174099,9174360,9174890,9174305,9174367,9175206,9174908,9174426,9174666,9174537,9174837,9174808,9175550,9174496],"found":[9174276,9174293,9174360,9175422,9175537,9174588,9174841,9175618,9174429,9174763,9174392],"plan":[9174276,9175691,9174117,9175603,9174631,9174969,9175048],"push":[9174276],"back":[9174276,9175422,9174447,9175620,9174198,9174603,9174891,9174249,9174520,9174763],"against":[9174276,9174806,9174142,9174202,9174371,9174417,9174640,9175550],"carping":[9174276],"complain":[9174276],"ventur":[9174276,9174967,9174277],"likely":[9174276,9174360,9174039,9174120,9174275,9175652,9175048],"attract":[9174276,9174170,9174174,9174237,9174401,9174417,9174407],"suggestion":[9174276,9174534,9174368,9174772],"point":[9174276,9175624,9174360,9174815,9175380,9174388,9174103,9174286,9174890,9175519,9175581,9174424,9175728,9174925,9174249,9174440,9174206,9174666,9174537,9174832,9174588,9174822,9174841,9175398,9174969],"out":[9174276,9175624,9175712,9174049,9174099,9174110,9174815,9174563,9175387,9174103,9174346,9174879,9174890,9174447,9175620,9174142,9174366,9175206,9175728,9174967,9174297,9174487,9173961,9174426,9175603,9174666,9175726,9174657,9174850,9175652,9175398,9174943,9175550,9174988,9174248,9175604,9174737],"ctf":[9174276,9175691,9175058,9174360,9175081,9174040,9175072,9174563,9174056,9174317,9174388,9174079,9175387,9174300,9174132,9174359,9174165,9174166,9174366,9174844,9174182,9174603,9174878,9174925,9174967,9174249,9174586,9174739,9174206,9174275,9173961,9174537,9174320,9174628,9174631,9174808,9174936,9174429,9174248,9175604],"ultim":[9174276],"expression":[9174276],"shut":[9174276],"show":[9174276,9175049,9174104,9174772,9174537,9174320,9174415],"cod":[9174276,9175049,9174563,9174056,9174104,9175519,9174559,9174249,9174586,9174275,9174918,9174708,9174908,9174657,9174078,9174841,9174808,9174988],"don't":[9175624,9175712,9174293,9174408,9174815,9174170,9175328,9175336,9175422,9174479,9175387,9174104,9174174,9174534,9174879,9174772,9174890,9174447,9174979,9174177,9174198,9174202,9175581,9175262,9174299,9174417,9174895,9175325,9175563,9174443,9174448,9174624,9174844,9175728,9174878,9174407,9174440,9174206,9174275,9174918,9174666,9174832,9174588,9174657,9174791,9174933,9175398,9174631,9174808,9174948,9174484,9174988,9174222,9174658,9175604],"understand":[9175624,9174317,9174574,9175620,9175325,9174424,9174297,9174537,9174837,9174841,9174808,9175604],"i've":[9175624,9174099,9174101,9174408,9174170,9175336,9174056,9174120,9174202,9174844,9175661,9174982,9174537,9175652,9174248],"worked":[9175624,9175691,9174404],"mediocrity":[9175624],"far":[9175624,9174103,9174359,9174537,9175048],"too":[9175624,9174879,9174229,9175620,9174299,9174559,9175241,9174537,9175726],"often":[9175624,9174360,9175081],"programming":[9175624,9174049,9174294,9174064,9174178,9174408,9174534,9174495,9174955,9174182,9174603,9174684,9174249,9174407,9174739,9174918,9174465,9174487,9173961,9174537,9175726,9174248,9174415],"world":[9175624,9174337,9174534,9174903,9174202,9174237,9174471,9175262,9174299,9174366,9174531,9174407,9174918,9174764,9174837],"outright":[9175624,9174056],"incompet":[9175624,9174890],"wel":[9175624,9175712,9174039,9174154,9175072,9175336,9175380,9174286,9174534,9174879,9175620,9174087,9174624,9175241,9175728,9174878,9174407,9174426,9175713,9175398,9174808,9174482],"kind":[9175624,9174039,9174170,9174201,9174563,9175564,9174359,9175620,9174198,9174202,9174495,9174417,9174165,9174559,9174366,9174531,9174407,9174918,9174982,9174850,9174808],"contests/gam":[9175624],"designed":[9175624,9174586,9174320],"wee":[9175624,9174890,9174988],"you're":[9175624,9174099,9174170,9175072,9175328,9175336,9174056,9174388,9174286,9174534,9174870,9174142,9174198,9174495,9175262,9174443,9174531,9175206,9174249,9174739,9174537,9174320,9174657,9174822,9175618,9175048,9175187,9175527],"talking":[9175624,9174201,9175246,9175057,9175398,9174808],"about":[9175624,9175058,9175553,9174039,9174101,9174408,9174815,9174930,9174201,9175336,9174772,9174890,9175620,9174883,9174142,9175581,9174401,9174164,9175151,9174199,9174316,9175057,9174443,9174448,9174531,9175241,9175728,9174878,9174925,9174918,9174982,9174537,9174588,9174822,9174841,9175652,9175713,9175398,9174374,9174808,9174948,9174969,9175048,9174520,9175527,9174988,9174654,9174763,9174227],"winn":[9175624],"having":[9175624,9174293,9174360,9175387,9174772,9174366,9174455,9174878,9175661,9175713,9175398,9175604],"personality":[9175624],"issue":[9175624,9175058,9174337,9174132,9174528,9174918,9174426,9174658],"hopefully":[9175624,9174101,9174164,9174559,9174465,9174982,9174482],"caught":[9175624,9174169],"interview":[9175624,9174293,9175584,9174039,9174064,9174563,9175387,9174300,9174132,9174286,9174174,9174346,9174534,9174879,9174772,9174870,9174890,9175519,9174447,9174653,9175246,9174979,9174861,9174165,9174166,9174559,9174443,9174448,9174624,9174844,9174367,9175206,9175728,9174537,9175550,9174988],"process":[9175624,9175598,9175691,9174039,9175221,9174170,9174563,9174317,9174079,9174300,9174286,9174174,9174879,9174903,9174772,9174870,9174979,9174624,9175241,9174528,9174206,9174901,9175603,9174537,9175713,9175425,9173979],"perhap":[9175624,9174495,9174559,9174407,9174528,9174791,9174822],"i'm":[9175624,9174294,9174101,9174170,9174201,9174302,9175328,9174127,9174284,9174479,9175387,9174174,9174534,9174772,9174447,9174653,9175246,9175620,9175151,9174366,9174367,9175728,9174297,9174528,9174567,9175046,9174708,9174465,9173961,9174426,9174025,9174537,9174588,9174841,9175398,9174969,9175048,9175187,9175425,9174896,9174943,9174520,9174732,9174482,9173979,9174248,9175604],"completely":[9175624,9174479,9174878,9174426,9174901,9175059],"missing":[9175624,9174967],"though":[9175624,9174101,9174170,9175328,9174534,9174890,9174371,9174424,9174528,9174982,9174426,9174901,9174657,9174837,9174808,9174948,9174763,9174248],"may":[9175049,9174382,9175328,9175422,9174284,9174404,9174534,9175620,9174177,9174559,9174666,9174850,9174841,9175398,9174948,9175602],"interesting":[9175049,9175107,9175013,9175036,9174170,9174056,9174890,9174883,9174198,9175581,9174265,9174165,9174249,9175726,9174808,9174462,9174988,9174658,9174415,9175604],"claim":[9175049,9175425],"mad":[9175049,9175058,9174404,9174537,9174328,9175550],"announc":[9175049,9174895,9174182,9174808,9174654],"hard":[9175049,9174360,9174815,9174401,9174567,9174982,9174841,9174808,9175550,9175602,9174415],"believ":[9175049,9174174,9174417,9174844,9175206,9175241,9174426,9174841,9175425],"admission":[9175049],"being":[9175049,9175221,9174052,9175336,9175564,9174056,9174388,9174104,9174346,9175519,9174867,9174202,9175262,9174844,9175728,9174708,9174850,9174841,9174948,9174763],"ready":[9175049,9174929],"been":[9175049,9174039,9174101,9174201,9175072,9174056,9174079,9174772,9174883,9175661,9174982,9174537,9174841,9175398,9174948,9175048,9174640,9175602,9175604],"achieved":[9175049],"aren't":[9175049,9175712,9175072,9174132,9174879,9174772,9174117,9175262,9174878,9174206,9174275,9174708,9174666,9174791,9174969,9175048],"helping":[9175049,9174815,9175262],"sceptic":[9175049],"eith":[9175049,9174815,9174300,9174378,9174117,9174764],"stil":[9175049,9174359,9174346,9174772,9174890,9174117,9174559,9174321,9174443,9174249,9174586,9174918,9174426,9174631,9174808,9174732],"work":[9175049,9175058,9174294,9174360,9174039,9174178,9174408,9174815,9175081,9174302,9174563,9175336,9174284,9175387,9174104,9174286,9174174,9174903,9174772,9174870,9174890,9174087,9174881,9174151,9174237,9175262,9174146,9174417,9174305,9174559,9175057,9174557,9175371,9174624,9174844,9174367,9174182,9174603,9174918,9174426,9174901,9174825,9174320,9174328,9175713,9175187,9175425,9174936,9174732,9175604],"actually":[9175049,9174293,9174408,9174815,9174534,9174879,9174903,9174198,9174202,9174495,9174299,9174417,9174895,9174624,9175206,9174918,9174908,9174320,9174791,9175652,9174969,9175073],"bett":[9175049,9174039,9174428,9174079,9174120,9174359,9174772,9174890,9175262,9175728,9174764,9174078,9174808,9175527,9175602],"than":[9175049,9174099,9175221,9174170,9175336,9174056,9174079,9174120,9174174,9174772,9174870,9174890,9174883,9174371,9174265,9174381,9174366,9174844,9174586,9174918,9174426,9174666,9174933,9174841,9175398,9175527,9175602,9174248],"most":[9175049,9175058,9174360,9175036,9174302,9175336,9174056,9174903,9174870,9174447,9174881,9174883,9174146,9175371,9174249,9174407,9174586,9173961,9174666,9174537,9174837,9175652,9174969,9175048,9175425],"oth":[9175049,9174099,9174360,9174101,9174178,9174408,9175221,9175072,9174056,9174574,9174404,9174534,9174870,9174883,9174177,9175581,9174257,9174371,9174417,9174895,9174539,9174559,9174749,9174424,9175206,9174586,9175184,9174918,9174666,9174320,9174588,9174791,9174933,9175398,9174896,9174936,9174429,9175527,9174415],"attempt":[9175049,9175336,9174455,9174367,9175059,9175652],"gaming":[9175049,9175221],"fun":[9175049,9174408,9174815,9175107,9175088,9174870,9174890,9175581,9174559,9174455,9174844,9175241,9174878,9174206,9174918,9174708,9174465,9174277,9175726,9174825,9174832,9174657,9174631,9174808,9175048,9175604,9174737],"profit":[9175049,9175336,9174764,9174791,9174837],"see":[9175049,9174293,9174294,9174039,9174408,9174815,9174056,9174428,9174404,9175538,9174132,9174534,9174903,9174772,9175620,9174881,9174117,9174202,9174366,9174443,9174367,9175728,9174440,9174918,9174708,9175537,9174025,9174537,9174657,9174791,9174933,9174837,9174109,9175425,9174988,9174763,9174482],"origin":[9175598,9174426,9174901],"story":[9175598],"company":[9175598,9175691,9174408,9174382,9175336,9174574,9174132,9174534,9174879,9174903,9174772,9174890,9174447,9175246,9174177,9174417,9174165,9174316,9175563,9175057,9174448,9174624,9174844,9174297,9174588,9174837,9175398,9174808],"appl":[9175598,9174154,9175422,9174284,9174979,9174495,9174955,9175262,9175206,9174925,9174896],"exactly":[9175598,9175107,9174388,9174534,9175241,9174182,9174407,9174832,9174588,9174837],"re":[9175598,9174293,9174408,9174815,9175081,9174930,9174302,9174317,9174346,9174870,9174146,9174199,9174925,9175713,9174808,9175604],"busi":[9175598,9175712,9175058,9174302,9174337,9174574,9175620,9175241,9174586,9175603,9174764,9174791,9174822,9174837,9174658],"great":[9175598,9174101,9175221,9174170,9174534,9175519,9174177,9174237,9174471,9174417,9174559,9174366,9174844,9175206,9174918,9174277,9174426,9174320,9174948,9174732,9174496],"effect":[9175598,9175691,9174815,9174146,9174624,9174898,9175728,9174277,9175602],"specif":[9175691,9175058],"context":[9175691],"security":[9175691,9174034,9174049,9174040,9174382,9174056,9174870,9175581,9175262,9174381,9174603,9174684,9174878,9174925,9174407,9173961,9174537,9175425],"matasano":[9175691,9174898,9174249,9174426,9174429,9175550,9174248,9174392,9174415],"know":[9175691,9174154,9174408,9174170,9175328,9174563,9175564,9174479,9174104,9174174,9174979,9174198,9175581,9174299,9174895,9174199,9175241,9174891,9174528,9174918,9174982,9174537,9174832,9174969,9174732,9174222,9174658],"strip":[9175691,9175712,9174206,9174275,9175604],"don":[9175691,9175712,9174294,9174360,9174064,9174170,9174201,9174791],"past":[9175691,9174099,9175387,9174867,9175100,9174841,9175604],"mostly":[9175691,9174049,9174895,9174297,9174537,9175726],"related":[9175691,9174199,9174603,9174684,9174528],"only":[9175691,9174049,9174064,9175081,9174170,9174201,9174772,9174890,9175620,9174087,9174867,9174495,9174559,9175371,9175206,9175728,9174891,9174918,9174537,9174825,9174588,9174657,9174850,9174837,9174078,9175652,9175398,9175048,9174732,9174988],"spin":[9175691],"them":[9175691,9174178,9174408,9174815,9174930,9175013,9174170,9174337,9175387,9174140,9174772,9175246,9174881,9174883,9174177,9174198,9174237,9174495,9174401,9174417,9174559,9175563,9174443,9174878,9174275,9175603,9174537,9175726,9174588,9175398,9174808,9174969,9175048,9175425,9175550,9174988,9174248,9175604],"occasion":[9175691],"promis":[9175691],"techniqu":[9175691],"why":[9175691,9175712,9174154,9175072,9175336,9174056,9174574,9174104,9174903,9175620,9174925,9174249,9174918,9174666,9174657,9174764,9174822,9174933],"wouldn't":[9175691,9174479,9174879,9174890,9174559],"invest":[9175691,9175221,9174079,9174174],"money":[9175691,9174337,9174120,9174300,9174879,9174559,9174443,9174822,9174933],"they'v":[9175691],"got":[9175691,9174056,9175088,9174103,9174534,9174903,9174870,9174229,9174202,9175170,9174443,9175059,9174248],"plenty":[9175691,9174293,9175584],"let'":[9175691,9174056,9174559,9174443,9174206,9174763],"honest":[9175691],"doing":[9175691,9175712,9174049,9174294,9174101,9174302,9175072,9175387,9174174,9174879,9174772,9174151,9174237,9174199,9174316,9174448,9175241,9174528,9173961,9174320,9174837,9174808],"all":[9175691,9174408,9175107,9175336,9175380,9174056,9175387,9174104,9174359,9174534,9174368,9174883,9174142,9174495,9174147,9174417,9174164,9174559,9174624,9175241,9174878,9174407,9174528,9174918,9174982,9173961,9175603,9174537,9174320,9174791,9174374,9174808,9174969,9175048,9174896,9174732,9175550,9174654],"tim":[9175691,9174293,9174039,9175221,9174170,9174563,9174079,9174284,9175387,9174103,9174104,9174120,9174300,9174286,9174359,9174140,9174174,9174879,9174772,9174870,9174447,9174979,9174087,9174881,9174166,9174559,9175057,9174424,9174443,9174844,9175241,9174206,9174275,9174465,9174537,9175726,9174588,9174657,9174850,9175652,9175713,9175398,9174631,9174808,9175048,9174429,9174654,9174763,9175604],"especially":[9175691,9174879,9174883,9174955,9175728,9175398,9175469],"given":[9175691,9174890,9174206,9174275,9174764,9174732],"recruit":[9175691,9174284,9175538,9174890,9175620,9174117,9174417,9174648,9174448,9174531,9174624,9175728,9174982,9174588],"who":[9175691,9174806,9174039,9174170,9174201,9174812,9174337,9175072,9174056,9174388,9174079,9174104,9174120,9174174,9174198,9174237,9174471,9175262,9174147,9174417,9174895,9175325,9175563,9174844,9174169,9175206,9175241,9175728,9174297,9174407,9174918,9174982,9175100,9174825,9175398,9174631,9174969,9175048,9174929,9174988],"plac":[9175691,9174039,9175107,9174388,9174879,9174772,9175581,9175262,9174624,9175728,9174528,9174657,9174764,9175550],"someon":[9175691,9174806,9175336,9174104,9174534,9174879,9174447,9174198,9174237,9174371,9174366,9174531,9174878,9174918,9175537,9175100,9174588,9174791,9174631,9174808,9175425],"probably":[9175691,9175712,9175081,9175072,9175336,9174177,9174198,9174440,9174901,9174764,9174732],"taking":[9175691,9174930,9175013,9175620,9174559,9174624,9175425,9175527],"hom":[9175691,9174563,9174120,9175713],"40k":[9175691,9175712],"also":[9175691,9175081,9174056,9174079,9174286,9174772,9174559,9175371,9175728,9174878,9174528,9174586,9175184,9174277,9175100,9174808,9175527,9175602,9174482],"outsid":[9175691,9174120,9174300,9174925,9174901],"any":[9175691,9174049,9174099,9174294,9174806,9174039,9174178,9174408,9175336,9174317,9174534,9174879,9174870,9175620,9174955,9174559,9174443,9174624,9174249,9174739,9174275,9174277,9174426,9174666,9174588,9174850,9175652,9175713,9175398,9174896,9174943,9174429,9174732,9175527,9174763,9175604],"can":[9175691,9175058,9174101,9175081,9175221,9175036,9174382,9175328,9175336,9175380,9174056,9175387,9174359,9174174,9174879,9174772,9175519,9174838,9174883,9174151,9174237,9174401,9174146,9174371,9174164,9174165,9175325,9174166,9174305,9175057,9174424,9174443,9174448,9174624,9174367,9175206,9175241,9174249,9174465,9173961,9174426,9174901,9175603,9174666,9174537,9174320,9174588,9174657,9174841,9175652,9175713,9175469,9174374,9174504,9174631,9174808,9175550,9174658,9174482,9175604],"styl":[9175691,9174895,9175170,9174559,9174898,9174206,9174808],"non":[9175691,9174040,9174079,9174870,9175620,9174146,9175563,9174557,9174844,9174969,9175048,9174732,9174763,9175604],"answ":[9175712,9174534,9174870,9175620,9174559,9175241,9173961,9174841,9174808,9175550,9174654,9174763,9174248],"hasn't":[9175712],"question":[9175712,9175336,9174534,9174142,9174559,9174424,9174844,9175206,9175728,9174206,9174918,9174708,9173961,9174426,9174025,9175726,9175100,9174631,9174658,9174763],"simpl":[9175712],"might":[9175712,9174039,9174154,9174170,9175072,9174479,9174120,9174890,9174401,9174895,9174603,9174206,9174487,9175726,9174933,9174841,9175618,9174429,9175527],"ask":[9175712,9174772,9175519,9174142,9175241,9175728,9174249,9175184,9173961,9174426,9175100,9174657,9174808,9174948,9174896],"doesn't":[9175712,9174879,9175581,9174982,9175100,9174764],"sel":[9175712],"databas":[9175712,9174918,9174896],"system":[9175712,9174049,9174815,9174040,9174302,9174563,9174772,9174495,9174955,9175581,9174407,9174918,9173961,9174320,9174328,9174808,9174948,9175048,9174896,9175604],"mean":[9175712,9174154,9174479,9175387,9174104,9174132,9174772,9174381,9174528,9174588,9174791,9174837,9174841,9175652,9174658],"som":[9175712,9174360,9174039,9174178,9174408,9174815,9175564,9174104,9174132,9174534,9174368,9174867,9174117,9174495,9175262,9174165,9174539,9174559,9174316,9175563,9175057,9174443,9174448,9174844,9175206,9174249,9174528,9174739,9174206,9174275,9174918,9174426,9175603,9174666,9175726,9174588,9174764,9174850,9175398,9174631,9175048,9174429,9175550,9175602,9174248,9174415,9175604],"expertis":[9175712],"building":[9175712,9174302,9175387,9174883,9174955,9174808,9175048],"thos":[9175712,9174294,9174064,9174101,9175107,9174104,9174378,9174883,9175262,9174417,9174305,9174559,9174424,9174443,9174844,9175241,9174878,9174297,9174918,9174426,9174666,9174537,9174631,9174969],"going":[9175712,9174154,9174170,9174382,9175328,9175336,9174056,9174388,9174479,9174300,9174870,9174447,9175620,9174867,9174471,9175581,9174305,9174443,9175241,9174297,9175046,9174275,9175100,9174832,9174320,9174588,9174657,9174822,9174808,9174969,9175048,9174732,9174658,9174481],"hir":[9175712,9174360,9174382,9174337,9175336,9174104,9174286,9174359,9174890,9174142,9174237,9174146,9174166,9174844,9174297,9174537,9174657,9175398,9174988],"coupl":[9175712,9174056,9174559,9174206,9175398,9175618],"hundred":[9175712,9174174],"next":[9175712,9174772,9174870,9174165,9174559,9175398],"decad":[9175712,9174297,9174528,9174666],"assuming":[9175712],"thing":[9175712,9174293,9175081,9175336,9175564,9174534,9174772,9175620,9174881,9174895,9174166,9174305,9174559,9174749,9174316,9175563,9174366,9174424,9174448,9175206,9174249,9174528,9174703,9174918,9175603,9174666,9174537,9174588,9174933,9174841,9175652,9174808,9174969,9174929,9174732,9175602,9174227,9174248,9175604],"sound":[9175712,9174294,9174039,9175088,9174132,9174890,9174117,9174147,9174440,9174703,9174206,9174708,9174588,9174631,9174462],"starfighter'":[9175712],"go":[9175712,9174151,9175581,9174624,9175241,9175603,9174791,9174837,9174248],"transl":[9175712,9175081],"seem":[9175712,9175058,9174056,9174890,9174237,9174165,9175170,9174559,9175563,9174366,9175206,9175728,9174658,9174227,9173979,9175604],"touch":[9175712,9175398,9175550],"amb":[9175712],"sampl":[9175058,9175387,9174903,9174772,9174870,9174146,9174367,9174426,9174901],"testing":[9175058,9174534,9175262,9174407,9174426,9174901],"extremely":[9175058,9174360,9175620],"limited":[9175058,9174382,9174764,9175652],"much":[9175058,9174039,9174408,9174170,9175072,9174127,9174079,9174286,9174879,9174772,9174870,9174890,9174979,9174471,9175581,9174299,9174443,9174844,9174407,9174739,9174708,9174465,9174666,9175398,9175602],"success":[9175058,9174052,9175398,9175146,9175527,9175550,9174496],"valu":[9175058,9174317,9175387,9174879,9174708,9174982,9174791],"techn":[9175058,9174039,9175387,9174534,9174890,9175519,9174624,9175728,9175398,9175618],"tal":[9175058,9175336,9175564,9174151,9175241,9175527,9174988],"area":[9175058,9174918,9175726,9174896],"expounding":[9175058],"vision":[9175058],"documenting":[9175058],"running":[9175058,9175206,9174249,9174567,9174268,9174537,9174415],"team":[9175058,9174293,9175553,9174056,9174447,9174443,9174844,9175728,9174603,9174249,9174297,9173961,9174825,9174320,9174328,9175398],"navigating":[9175058],"polit":[9175058,9174534],"fund":[9175058],"raising":[9175058,9174969],"bit":[9175058,9174534,9174890,9174177,9174366,9174443,9174918,9175726,9174988],"vagu":[9175058],"admit":[9175058,9174321],"person":[9175058,9174174,9174534,9174772,9174870,9175262,9174165,9174366,9174898,9174603,9174426,9174666,9174732],"experi":[9175058,9174039,9174408,9174563,9174378,9174534,9174903,9174870,9174447,9174867,9174881,9174559,9174426,9174537,9175713,9174969,9175604],"problem":[9175058,9174049,9174099,9174360,9174408,9174815,9175107,9174930,9175013,9175036,9174302,9174056,9174388,9174079,9174359,9174378,9175620,9174883,9174237,9174471,9174844,9175241,9175728,9174586,9174275,9174918,9174708,9173961,9174426,9175603,9175726,9175652,9175713,9175398,9174808,9174896,9175550,9174415,9175604],"patio11":[9175058,9174294,9174574,9174772,9174895,9174305,9174222],"nam":[9175058,9174127,9174574,9174624,9174878,9175661,9174925],"himself":[9175058],"saying":[9175058,9174424,9174822],"tech":[9175058,9174815,9174534,9174772,9174471,9174366,9174455,9175371,9174448,9174918,9174732],"necessary":[9175058,9175184],"suffici":[9175058,9174534],"condition":[9175058],"now":[9175058,9174293,9175553,9174101,9174201,9174772,9174247,9174559,9174249,9174426,9174537,9174969,9174943,9175550,9174481,9175604],"learn":[9175058,9174388,9174140,9175581,9174164,9174559,9174206,9174537,9174588],"bas":[9175058,9174867,9174603,9175469],"marketing":[9175058,9175206,9174426,9175048,9175425],"something":[9175058,9174039,9174064,9174408,9174815,9174170,9174201,9174056,9174404,9174103,9174120,9174132,9174772,9174870,9174890,9174164,9174165,9174559,9175563,9175371,9174531,9174624,9175728,9174182,9174878,9174206,9174708,9174764,9174841,9174808,9175550],"similar":[9175058,9174099,9174178,9174408,9174867,9175262,9174559],"applied":[9175058,9174146,9174891,9174429,9174484],"how":[9175058,9174294,9175081,9174930,9175013,9174170,9174337,9175336,9175564,9175380,9174056,9174079,9174132,9174359,9174346,9174534,9174772,9174870,9174979,9174881,9174883,9174142,9174299,9175151,9174443,9174531,9175206,9175241,9175728,9174182,9175661,9174297,9174407,9174206,9174275,9174918,9174708,9174588,9174764,9174822,9174078,9174628,9174841,9174631,9174808,9174969,9175425,9175073,9174936,9175550,9174658,9174763,9175604],"program":[9175058,9174495,9175206],"ev":[9175058,9174039,9174178,9174408,9174815,9175081,9175221,9174201,9175072,9174378,9174534,9174275,9174465,9175652,9175048,9174658],"handl":[9175058,9174206],"investor":[9175058,9174658],"document":[9175058],"getting":[9175058,9175072,9174104,9174534,9174867,9174371,9174455,9173961,9174426,9174901,9175100,9174837,9174988],"good":[9175058,9174360,9175221,9174382,9175072,9175422,9174479,9175387,9174103,9174140,9174174,9174534,9174447,9174202,9174237,9174495,9174417,9174424,9174443,9174528,9174708,9174982,9175537,9174025,9175100,9174588,9174933,9175469,9174929,9174732,9175602,9174658],"cap":[9175058],"peopl":[9175058,9174806,9174039,9174815,9174170,9174201,9174812,9175072,9174056,9174388,9174079,9174104,9174120,9174132,9174359,9174378,9174140,9174174,9174346,9174879,9174772,9174870,9174890,9175519,9174447,9174979,9174867,9174142,9174237,9174495,9175262,9174417,9175325,9174559,9175563,9174455,9174624,9174844,9174898,9174367,9175206,9175241,9174603,9174407,9174528,9174275,9174918,9174708,9174982,9173961,9174426,9175100,9174588,9174764,9174791,9174628,9175652,9174631,9174808,9174948,9174969,9175048,9175527,9174988,9175604],"import":[9175058,9174302,9174388,9174883,9175262,9174531,9175713,9174429],"interested":[9175058,9175072,9174316,9174531,9174624,9174426,9174537,9174764,9175398,9174415],"seeing":[9175058,9174534],"howev":[9175058,9174293,9174426,9174901],"luck":[9175058,9174039,9174237,9174443,9174025],"skillset":[9174034],"particip":[9174034,9175107,9174286,9174881,9174895,9174320,9174328,9174588,9174657,9174933,9174631,9174969,9175048],"play":[9174034,9174154,9174408,9174815,9175107,9174201,9175072,9174056,9174772,9174881,9174117,9174151,9174147,9174371,9175563,9174366,9174531,9174844,9174249,9174739,9174440,9174206,9174275,9174277,9174426,9174588,9174657,9175652,9174631,9175425,9175527,9175602,9175604],"gam":[9174034,9174039,9174178,9174408,9174815,9174930,9175013,9174170,9174201,9175072,9174563,9174052,9174094,9174359,9174883,9174151,9174198,9174146,9174265,9174299,9174199,9175563,9174844,9175206,9175728,9174182,9174603,9174684,9174878,9175661,9174249,9174407,9174528,9174739,9174440,9174275,9174918,9173961,9174832,9174588,9174657,9174808,9175527,9175550,9175602,9174482,9175604],"purely":[9174034],"stuff":[9174034,9174099,9175081,9175107,9173961,9175059,9174808,9175604],"enjoy":[9174049,9174360,9174201,9174079,9174870,9174417,9174316,9174557,9174206,9174465,9174657,9174415],"languag":[9174049,9174178,9174408,9174297,9174407,9174537,9175726,9174588],"fearlessly":[9174049],"willing":[9174049,9174879,9174177,9174443],"pick":[9174049,9175036,9174424,9174275,9174415],"new":[9174049,9174039,9174079,9174140,9174534,9174879,9174772,9174883,9174495,9174166,9174305,9174559,9174366,9174455,9175371,9175728,9174275,9174277,9174537,9175059,9174588,9175187,9175425,9174929,9175604],"knowledg":[9174049,9174360,9174359,9174559,9174822,9175425,9174248],"required":[9174049,9175107,9174079,9174346,9174918],"backdrop":[9174049],"we'r":[9174049,9174201,9174382,9175336,9174479,9174903,9174368,9174151,9174202,9174471,9174495,9174299,9174316,9174443,9174531,9174297,9174349,9174275,9173961,9175398,9174808,9174969,9175550,9174415],"two":[9174049,9174879,9174772,9174447,9174203,9175057,9175241,9173961,9174791],"domain":[9174049,9174099,9174360,9174574,9174378,9173961,9174537,9174896,9174415,9175604],"starting":[9174049,9174099,9174360,9173961,9174588,9174808,9175550],"use":[9174049,9174293,9174178,9174408,9174815,9175081,9175221,9174170,9174302,9174404,9174174,9174534,9174879,9174772,9174838,9174495,9174559,9174844,9175241,9174182,9174603,9174297,9174407,9174440,9174465,9173961,9174537,9175726,9174588,9174657,9174933,9175652,9174374,9174948],"venu":[9174049,9173961],"piqued":[9174099],"interest":[9174099,9175538,9174534,9174903,9174624,9174407,9175726],"challenge/gam":[9174099],"seen":[9174099,9175336,9174772,9175726,9175652],"what'":[9174099,9175581,9174462],"second":[9174099,9175241,9175602],"it'":[9174099,9174154,9174408,9174815,9175221,9174170,9175072,9175336,9175422,9174317,9174132,9174286,9174359,9174772,9174870,9175519,9174881,9174495,9175581,9174165,9174381,9174321,9174367,9174878,9174249,9174739,9175184,9174708,9174982,9173961,9174426,9175603,9174822,9174933,9175469,9174808,9174948,9175550,9174227,9174496],"graphics/parallelized":[9174099],"matrix":[9174099,9174559],"math":[9174099,9174275,9174918,9174708,9175604],"sort":[9174099,9175564,9174534,9174117,9175262,9174381,9174528,9174703,9175604],"we'l":[9174110,9174382,9174337,9174174,9174151,9174443,9174275,9175425,9174929],"send":[9174110,9175336,9174177,9174202,9174429],"reading":[9174110,9175088,9174895,9174199,9174166,9174559,9174455,9174424,9174844,9175241,9175728,9174320,9175469,9174929,9174943],"list":[9174110,9175107,9174772,9174166,9174559,9174537,9174929,9174943],"subscrib":[9174110],"sometim":[9174110,9174371,9175325,9175527],"soon":[9174110,9175398,9174969,9175602],"it'll":[9174110,9174559],"pretty":[9174110,9174293,9174360,9174039,9174408,9174381,9174918,9174658,9175604],"obviou":[9174110,9174534,9174903,9175620,9174202,9174146,9174982],"from":[9174110,9175221,9175328,9174127,9175336,9175422,9174056,9174428,9175538,9174346,9174903,9174772,9174870,9174447,9174653,9174117,9175581,9174160,9174164,9174165,9174539,9174443,9174448,9174531,9174367,9174169,9174182,9175661,9174249,9174586,9174275,9174918,9174982,9174277,9174666,9174537,9174588,9174657,9174837,9174078,9175469,9174808,9175048,9175425,9175550],"began":[9174293],"working":[9174293,9175553,9174039,9175107,9174201,9175336,9175380,9174284,9174479,9175387,9174772,9175581,9174146,9174426,9175398,9174482],"exact":[9174293],"sam":[9174293,9174178,9174408,9175221,9174317,9174388,9174772,9174870,9174749,9174275,9174918,9174708,9174426,9174841,9175604],"within":[9174293,9175603,9175652],"last":[9174293,9174094,9174127,9175246,9173961,9175398,9174808,9174394,9174429],"month":[9174293,9174201,9175057,9174493],"spar":[9174293,9174166,9174808],"competed":[9174293],"ccdc":[9174293],"year":[9174293,9174563,9175336,9175387,9174772,9174275,9174918,9173961,9174320,9174328,9175398],"colleg":[9174293,9174588],"insan":[9174293,9174471,9174199,9175241],"when":[9174293,9174201,9175336,9174286,9174879,9174772,9174870,9175620,9174838,9174202,9174895,9174424,9174878,9174249,9175184,9175100,9174320,9174588,9174764,9175652,9174969,9175048,9174896,9175527,9174988],"saw":[9174293,9175073],"hardwar":[9174293],"during":[9174293],"picked":[9174293,9175553],"wrong":[9174293,9175553,9174064,9174201,9174870,9175581],"sid":[9174293,9175553,9174815,9174170,9174563,9174317,9174772,9175620,9174366,9174844,9175241,9174666,9174808,9175604],"project":[9174293,9175553,9174170,9174563,9174317,9174388,9174284,9174237,9174366,9174528,9174206,9174708,9174588,9175604],"broken":[9174293,9175584,9175081,9174563],"enough":[9174293,9175584,9174408,9175107,9175072,9174447,9175581,9174426,9174666,9174764,9174841,9175713],"room":[9174293,9175584,9174297],"spac":[9174293,9175584,9174174],"can't":[9174293,9175328,9174056,9174443,9174624,9175206,9174440,9175603,9174666,9174764,9174791,9174850,9175652,9175618,9174988],"wait":[9174293,9174056,9174440,9174988],"launch":[9174293,9174929],"competition":[9175553,9174201,9174417],"sign":[9175553,9174174,9174534,9174870,9174890,9174448,9174249,9174657,9174929],"right":[9175553,9174170,9174056,9174388,9174772,9174198,9174559,9174844,9174169,9175241,9174249,9174407,9173961,9174969,9175187,9175425,9174943,9175550,9174222],"field":[9175553,9174359,9174925,9174426,9174901,9175603],"just":[9175553,9174408,9174815,9175107,9174170,9175328,9175088,9174079,9174284,9174404,9174120,9174132,9174346,9174534,9174879,9174772,9175519,9174881,9174883,9174142,9175581,9174147,9174164,9174165,9174381,9174559,9175563,9174366,9175206,9175728,9174878,9174925,9174407,9174440,9174206,9174275,9174708,9174426,9175603,9174666,9174025,9175726,9174588,9174764,9175652,9175469,9174631,9175425,9175550,9174763,9174248],"everybody":[9175553,9174918],"get":[9175553,9174286,9174534,9174772,9174631],"backward":[9175553],"amen":[9175584],"congratul":[9174294,9174237,9174025],"excited":[9174294,9174101,9175088,9175620,9175151,9174878,9174708,9174025,9173979],"curi":[9174294,9174079,9174979,9175620,9174883,9174164,9174249,9174567,9174482],"yourself":[9174294,9174117,9174381],"mak":[9174294,9174178,9174408,9175107,9175221,9174170,9174337,9175336,9175564,9175380,9174428,9174174,9174534,9174879,9174870,9174087,9174151,9174142,9174202,9174495,9174955,9174401,9174247,9174417,9174165,9175563,9174366,9174455,9175206,9174528,9175405,9174206,9174275,9174918,9174426,9174537,9174320,9174764,9174822,9175398,9174808,9174969,9175048,9175425,9175527,9175550,9174654,9174415,9175604],"crud":[9174294,9174202,9174586],"app":[9174294,9174382,9174870,9174202,9175581,9174297,9174528,9174586,9174374],"didn't":[9174294,9175564,9174870,9175246,9174199,9174925,9174918,9175550,9174482],"school":[9174294,9175336,9174120,9174300,9174229],"self":[9174294,9174366,9174455],"taught":[9174294],"afraid":[9174294],"it'd":[9174294,9174559,9174277],"head":[9174294,9175336,9174284,9174534,9174165],"best":[9174294,9174039,9174302,9174337,9174903,9174772,9174381,9174918,9174588,9175146,9175550,9175602,9174248],"lin":[9174294,9175336,9174903,9174666],"haven’t":[9174294],"consulting":[9174294],"whil":[9174294,9174101,9174302,9174574,9174229,9174146,9174559,9174367,9174206,9174426,9174901,9175527,9174763,9174415],"continu":[9174294,9174559,9174666,9174654],"our":[9174294,9174039,9174178,9174408,9174930,9175013,9174337,9174378,9174870,9174881,9174151,9174202,9175325,9174443,9174624,9175241,9174297,9174275,9173961,9174588,9174657,9175398,9174808,9174969,9175048,9175425,9175550,9174654],"inability":[9174294],"think":[9174360,9174408,9174815,9175107,9175221,9174170,9174337,9175072,9175336,9174056,9174079,9174284,9174132,9174359,9174534,9174903,9174772,9174890,9175519,9174867,9175581,9174381,9174305,9174559,9174366,9175057,9174455,9174844,9175241,9174407,9174206,9174918,9174465,9174487,9174901,9175603,9175726,9174657,9175469,9174948,9174969,9175048,9175527,9174988],"anyon":[9174360,9174178,9175422,9174903,9174772,9175620,9174417,9174165,9174624,9174367,9174832,9174933,9174969,9174929],"motivated":[9174360],"research":[9174360,9174967,9175100],"dec":[9174360,9174359],"organis":[9174360],"puzzl":[9174360,9174806,9174064,9174170,9174052,9174417,9174166,9173961],"matsano":[9174360],"stripe'":[9174360,9174040],"quit":[9174360,9174317,9174388,9174079,9175620,9174182,9174206,9174791],"littl":[9174360,9174534,9174147,9175151,9175652,9174808,9174227],"crypto":[9174360,9175081,9174378,9174881,9175537,9174808,9174948,9174969,9174429,9175550,9174248,9174415],"researching":[9174360],"solving":[9174360,9174883],"challeng":[9174360,9175081,9175221,9174378,9174870,9174890,9174867,9174881,9174142,9174237,9174624,9174426,9174537,9175726,9175100,9174825,9174078,9174841,9175713,9174808,9174948,9174969,9175550,9174248,9174415,9175604],"rewarding":[9174360,9175107,9174201,9174933,9174969],"said":[9174360,9174056,9174174,9174903,9174772,9174237,9174537,9174764,9174248],"inform":[9174360,9175262,9174381,9174443,9174588,9175602],"thinly":[9174360,9174559],"spread":[9174360,9174447,9174559],"find":[9174360,9174039,9174815,9175036,9174170,9174337,9175387,9174772,9174870,9174883,9174198,9174237,9175262,9175170,9174366,9174443,9174844,9174182,9174249,9174528,9174465,9175537,9175726,9174657,9175425,9174943,9175527],"relev":[9174360,9175387,9174367,9174277],"regard":[9174360],"includ":[9174360,9174382,9174407],"protection":[9174806],"planned":[9174806],"paid":[9174806,9175246,9175563],"solv":[9174806,9174064,9174388,9174079,9174883,9174703,9174206,9174808,9175550,9175604],"else'":[9174806,9174918,9174791],"behalf":[9174806],"cheating":[9174806,9174918,9174708,9174628,9174841,9175652],"hiring":[9174806,9175221,9174079,9174479,9175387,9174359,9174174,9174534,9174879,9174903,9174870,9174979,9175620,9174142,9174198,9174471,9174146,9175563,9174624,9174844,9175241,9175728,9174182,9174277,9174426,9174901,9174537,9175398,9175618,9174948,9175425,9174429,9174732,9175550,9173979],"train":[9174806,9174648],"account":[9174806,9174479,9174588,9175187],"we’r":[9174039,9174772,9175728],"fix":[9174039,9174302,9174337,9174359,9174534,9175728],"destroy":[9174039,9174772,9175728],"cre":[9174039,9174170,9174079,9174772,9175262,9175728],"it":[9174039,9174879,9174772,9174890,9174559,9174366,9175728,9174528,9174588,9174791,9174850,9174429,9174988],"bold":[9174039],"happy":[9174039,9174101,9174447,9174367],"talk":[9174039,9175081,9174447,9174401,9175398,9174374,9174808],"spend":[9174039,9175387,9174104,9174120,9174300,9174772,9174447,9174424,9174275,9175048],"playing":[9174039,9174170,9174359,9174371,9174878,9174426,9174901,9175603,9174537,9174415],"proficiency":[9174039],"typ":[9174039,9175620,9174147,9174257,9174895,9174559,9174967,9174206,9175726],"indee":[9174039,9175527],"otherwis":[9174039,9175221,9174170,9174772,9175581],"ignored":[9174039],"cool":[9174039,9174165,9174895,9174878,9174297,9174206,9174708,9174631,9174808],"wish":[9174039,9174249,9175726,9175146],"guy":[9174039,9175328,9174443,9174297],"reason":[9174064,9174178,9174408,9174170,9174317,9174174,9175581,9174624,9174586,9174275,9174657],"you'd":[9174064,9174178,9174408,9175107,9174170,9174890,9174316,9174448,9174297,9174896,9174415],"mess":[9174064,9174170],"around":[9174064,9175107,9174170,9175581,9174624,9174844,9174908,9175726,9175652,9175604],"job":[9174064,9174154,9174408,9174815,9175221,9174170,9175072,9175328,9175564,9175422,9174284,9174404,9174479,9174120,9174132,9174534,9174879,9174772,9174870,9174447,9175246,9174881,9174202,9174237,9174471,9174495,9175262,9174247,9174165,9175563,9174366,9174455,9174557,9174448,9174844,9175206,9174528,9174465,9174426,9174901,9174588,9174657,9174631,9174969,9175048],"we'v":[9174064,9174170,9174201,9174443,9175398,9175550],"isn't":[9174064,9174408,9174815,9174898,9173961,9174666,9174588,9174822,9174933,9174837,9174808],"sit":[9174064,9174286,9174870,9174177,9174407,9174528,9174320,9174631],"wher":[9174064,9174101,9174170,9175422,9174479,9174120,9174300,9174772,9174447,9174653,9174867,9174117,9174247,9174265,9174559,9174448,9174603,9174918,9175603,9174537,9174320,9174588,9174841,9174808],"discret":[9174064],"badg":[9174064],"lieu":[9174064],"whiteboard":[9174064],"sup":[9174101,9174117,9174841],"even":[9174101,9174563,9175336,9174428,9174120,9174300,9174534,9174879,9175581,9174164,9174586,9174918,9174708,9174666,9175059,9174791,9174850,9175652,9174631,9174222],"devop":[9174101],"feel":[9174101,9174170,9175519,9174447,9174861,9174371,9175728,9174407,9175100,9174588,9174657,9174764],"dev":[9174101,9175107,9174479,9175620,9174087,9175398],"skil":[9174101,9174154,9175081,9174382,9174302,9174388,9174104,9174359,9174140,9174142,9174146,9174559,9175057,9175728,9174297,9174275,9174982,9174537,9174588,9174841,9174929],"slowly":[9174101],"atrophying":[9174101],"way":[9174101,9174178,9174408,9175081,9175221,9174170,9174056,9174284,9174300,9174359,9174140,9174534,9174772,9174890,9174151,9175581,9174146,9174381,9175170,9174559,9174455,9174531,9175241,9174407,9174275,9174918,9174708,9174982,9174588,9174841,9174808,9175527,9175602,9174988],"help":[9174101,9174154,9174955,9175206,9175100,9175398,9174808,9175527],"keep":[9174101,9175336,9174103,9174120,9175620,9174177,9175581,9174265,9175563,9174249,9174567,9175100,9174588,9174657,9174929,9174988],"curr":[9174101,9174317,9174772,9175057],"increas":[9174154,9174316,9174448,9174837],"exposur":[9174154],"compan":[9174154,9174408,9174815,9174337,9175072,9174404,9175538,9174286,9174534,9174879,9174903,9174772,9174870,9174890,9175519,9175620,9174142,9174401,9174648,9175241,9175728,9174918,9174933,9174837,9174078,9175398,9174374],"stat":[9174154,9175728,9174918],"improv":[9174154,9174955,9175262,9175206,9174537,9173979],"developing":[9174154,9175206,9174297],"noodl":[9174178,9174408],"doubt":[9174178,9174408,9174495,9175425],"you'll":[9174178,9174408,9174772,9174275],"production":[9174178,9174408,9174815],"did":[9174178,9174534,9174870,9174229,9174165,9174206,9174918,9174426,9175618,9174808,9175550],"anything":[9174178,9174170,9175336,9174772,9174198,9174448,9174657],"bebox":[9174178],"becaus":[9174178,9174408,9174120,9174132,9174903,9174870,9174890,9175519,9174202,9175581,9174895,9174443,9174448,9174878,9174249,9174918,9174426,9174808,9174969],"technologies/concept":[9174178,9174408],"dumb":[9174178,9174408],"easiest":[9174178,9174408,9174275,9174918,9174708],"hand":[9174178,9174408,9174177],"dirty":[9174178,9174408],"relax":[9174408,9174815],"websit":[9174408,9174815],"say":[9174408,9174815,9175081,9175387,9174870,9174166,9174443,9174367,9175728,9174878,9175537,9174666,9174537,9174588,9174657,9174764,9174841,9175652,9175398,9175469,9174631],"open":[9174408,9174170,9174317,9174388,9174284,9175581],"sourc":[9174408,9174170,9174317,9174388,9174284,9175550],"every":[9174408,9174056,9174479,9174104,9174982,9174822,9175652],"had":[9174408,9175107,9174170,9174120,9174870,9174447,9175246,9174237,9174539,9174844,9174898,9174878,9174537,9175100,9175652,9175713,9175398,9175550],"involved":[9174408,9175072,9174772,9173961],"technolog":[9174408,9175057],"download":[9174408],"instal":[9174408],"myself":[9174408,9174417,9174426,9174763],"throw":[9174408,9175620],"linux":[9174408],"box/vm":[9174408],"suppos":[9174408,9174749,9174943],"involv":[9174408,9175081,9174052,9174495,9174624,9174969,9175048,9174654,9175604],"proprietary":[9174408],"technology":[9174408,9174302,9174559,9175206],"nev":[9174408,9175336,9175422,9174120,9174890,9174417],"wild":[9174408],"cas":[9174408,9175387,9174401,9174559,9174537,9174791,9174822,9174841,9175713,9175425,9174763],"prov":[9174408,9174170,9174388,9174559],"differ":[9174815,9174563,9174388,9174174,9174151,9174160,9174381,9174321,9174898,9174078,9174841,9175652,9175398,9174948,9175550],"definition":[9174815,9175184],"minecraft":[9174815],"build":[9174815,9174302,9174563,9174870,9174366,9175206,9174249,9174297],"cpu":[9174815],"redston":[9174815],"key":[9174815,9174052,9174429],"word":[9174815,9175107,9175241,9175184,9174969],"exampl":[9174815,9175519,9175262,9174559,9174249,9174708],"really":[9174815,9174170,9174056,9175088,9174534,9174772,9174447,9174443,9174624,9174878,9174739,9174918,9174982,9174537,9175726,9174588,9174657,9175425,9174732],"expect":[9174815,9175081,9174563,9174879,9174366,9174455,9175661,9174277,9175100],"rust":[9174815],"profession":[9174815,9175563,9174426,9174588],"setting":[9174815,9175057,9174588],"nor":[9174815,9174140],"prolog":[9174815],"today":[9174815,9175107],"pdp":[9174815],"machin":[9174815,9175081,9175328,9175564],"nuclear":[9174815],"reactor":[9174815],"cobol":[9174815],"bank":[9174815],"sur":[9174815,9175221,9174127,9174284,9174534,9174447,9174867,9174142,9174320,9174791,9174628,9174841,9174429,9175527,9175602,9174248,9175604],"hel":[9174815],"feeling":[9174815],"giving":[9174815,9175425],"geek":[9174815,9174056,9174202,9174495,9174169,9174878],"cor":[9174815,9174586],"boring":[9174815,9174930,9175013],"usually":[9175081,9174528],"wargam":[9175081],"whatev":[9175081,9174404,9174534,9175519,9174648,9175726,9174837],"radio":[9175081],"telephony":[9175081],"protocol":[9175081],"credit":[9175081],"card":[9175081,9174588],"homegrown":[9175081],"dealing":[9175081,9174772,9174631,9175604],"custom":[9175081,9174654],"vm":[9175081],"fil":[9175081,9174878],"format":[9175081,9174588],"networking":[9175081],"inst":[9175081,9174764,9174822,9174969,9175604],"tcp/ip":[9175081],"stack":[9175081,9174170],"writ":[9175081,9174495,9174955,9174559,9175563,9174918,9174708,9174631],"cli":[9175081,9174930,9175013,9174879,9174202,9175563],"lif":[9175081,9175336,9175425],"yet":[9175081,9175336,9174772,9174237,9174146,9174808,9175602],"thank":[9175107,9174103,9175728,9174925,9174537,9174764,9174943,9174763,9174737],"ch":[9175107,9174870,9174837],"highly":[9175107,9174443],"structured":[9175107,9174465],"environ":[9175107,9174870,9174883,9174320],"handhold":[9175107],"long":[9175107,9174359,9174151,9174624,9174878,9174268,9174426,9174537],"elimin":[9175107],"nonsens":[9175107],"expens":[9175107,9174443,9174918],"subscription":[9175107],"fee":[9175107,9174117,9174495],"bankrol":[9175107],"labor":[9175107],"earli":[9175107,9174127,9174903],"looking":[9175107,9174879,9174087,9174371,9174443,9175241,9174297,9174349,9174465,9174982,9175537,9174537,9175398,9174969,9175048,9175187,9174732],"wer":[9175107,9174378,9174870,9174890,9175519,9174165,9174443,9174531,9174249,9175537,9174277,9174588,9174808,9174969,9174988,9174248,9174392],"analog":[9175221],"sens":[9175221,9174930,9174201,9174428,9174087,9174367,9174891,9175405,9174918,9174537,9174588],"effort":[9175221,9174870,9174559,9174850],"level":[9175221,9175328,9174359,9174534,9174495,9174955,9174559,9174249,9174297,9174426,9174901,9175603,9174537,9175059,9175100,9174808,9174969,9175048,9174896,9175550],"paladin":[9175221],"und":[9175221,9174337,9174146],"achiev":[9175221,9174147,9174265,9174559],"manag":[9175221,9175620,9174443,9174528],"pass":[9175221,9174624,9174429],"candid":[9175221,9174120,9174286,9174359,9174174,9174879,9174903,9174772,9174870,9174117,9174177,9174202,9174366,9174624,9175241,9174588,9174657,9175398,9174429,9175527],"allow":[9175221,9174883,9174559,9174586],"outli":[9175221],"potentially":[9175221],"amazing":[9175221,9174895],"off":[9175221,9175336,9174284,9175387,9174286,9174534,9174447,9174867,9174237,9174471,9174443,9174275,9174933,9175398,9174631],"partn":[9175221],"exciting":[9175221],"today'":[9175221],"easy":[9175221,9174534,9175581,9175325,9174708,9175713],"access":[9175221,9174495,9174955,9174426,9174658],"cheap":[9175221,9175328],"cloud":[9175221],"computing":[9175221,9174918,9174666],"isol":[9175221,9174297],"instanced":[9175221],"raid":[9175221,9174275],"mmo":[9175221,9175652],"own":[9175221,9174104,9174174,9174772,9174495,9175262,9174305,9174559,9174850,9174248,9175604],"version":[9175221,9175563,9174982,9174841],"realist":[9175221],"whoah":[9174930],"misread":[9174930],"miswrot":[9174930],"reframing":[9174930,9175013],"read":[9174930,9174495,9174165,9174895,9174203,9175170,9174559,9175537,9174764,9174078,9175618,9174484],"plaus":[9174930],"sorry":[9174930,9174202,9174366,9174443,9174666,9175425],"i'd":[9175036,9174170,9174056,9174879,9174890,9175661,9174708,9174537,9174588,9174837],"rath":[9175036,9174170,9174890,9174371,9174426,9174901,9174666,9174841,9175398,9174248],"tot":[9175036,9174870],"complet":[9175036,9174890,9174229,9174237,9174275,9174825],"free":[9175036,9174302,9174337,9174079,9174104,9174120,9174359,9174140,9174870,9174979,9174559,9174206,9174982,9175726,9175048],"rein":[9175036],"wrongthat":[9174170],"first":[9174170,9174388,9174870,9174165,9174203,9174443,9174448,9174603,9174275,9175059,9175100,9174320,9174588,9174969,9175602],"impression":[9174170],"age":[9174170,9174426,9174901],"met":[9174170],"awesom":[9174170,9174056,9174465,9174808,9175146],"andrew":[9174170,9174201],"tridgel":[9174170,9174201],"pref":[9174170,9174371,9174929,9175527],"hack":[9174170,9174237,9174471,9175325,9174166,9174455,9175371,9174297],"unless":[9174170,9174879,9174772,9174890,9174316,9174531,9174588,9175425],"that'":[9174170,9174201,9174382,9175380,9174284,9174479,9175387,9174104,9174378,9174870,9175519,9174447,9175563,9174443,9175241,9174925,9174297,9174407,9174440,9174901,9174320,9174657,9174764,9175652,9175713,9174808,9175425,9174763],"noticed":[9174170,9174147],"target":[9174170,9175563,9175425],"market":[9174170,9174382,9174870,9175151,9174366,9174455,9174275],"cours":[9174170,9174201,9174359,9174401,9174559,9174367,9174275,9174918,9174901,9174588],"natur":[9174170,9174559],"expected":[9174170,9174563,9174764],"slip":[9174170,9174808],"through":[9174170,9174563,9175387,9175538,9174103,9174359,9174870,9175519,9174305,9174443,9174844,9174275,9174918,9174537,9174791,9174850],"crack":[9174170],"inclin":[9174170],"few":[9174201,9174284,9174140,9174879,9174979,9174559,9175728,9174275,9174918,9175652,9175398],"heard":[9174201,9175072,9175422,9175371,9175550,9174248],"concern":[9174201,9174479,9174120,9174300,9174534,9174890,9175550],"repeatedly":[9174201],"designing":[9174201,9175620,9175550],"releasing":[9174201],"reward":[9174201,9175581],"whom":[9174201,9174120,9174881],"motiv":[9174201,9174850],"tinkering":[9174201],"dwarf":[9174201],"fortress":[9174201],"g":[9174201,9174104,9174174,9174368,9175581,9174559,9174657,9174929,9175550],"direction":[9174201,9175581,9175206,9175425,9174929],"pulling":[9174201],"count":[9174201],"adjust":[9174201],"quickly":[9174201],"happen":[9174201,9174479,9174772,9174890,9175519,9174249,9174206,9174918,9174908,9175100,9174481],"focused":[9174040,9174056,9174147,9174559],"tradition":[9174040,9174879,9174861],"distributed":[9174040,9174142,9174918,9175604],"test":[9174382,9174563,9175387,9174890,9175519,9174146,9174367,9174297,9174918,9174841,9175527,9174988],"wid":[9174382,9174174],"rang":[9174382,9174918],"set":[9174382,9175328,9174388,9175398],"web":[9174382,9174870,9175581,9174297,9174528,9174440,9174918,9174896],"reasonably":[9174382],"assum":[9174382],"doe":[9174382,9174104,9174495,9174955,9174147,9175563,9175728,9174182,9174206,9175398,9174943,9174732],"proxy":[9174382,9174465],"assessing":[9174382,9174890,9174447,9174401],"lov":[9174382,9175072,9175564,9175422,9174056,9175620,9174366,9174440,9174588,9175398,9175550],"softwar":[9174382,9174302,9174870,9175581,9175728,9174182,9174407,9174901,9174969],"grand":[9174382],"ambition":[9174382,9174378],"wow":[9174812,9174443,9174808],"idea":[9174812,9175336,9174890,9174861,9174199,9174539,9174531,9174898,9175728,9174918,9174588,9175146,9174248,9175604],"couldn't":[9174812,9174120],"respect":[9174812,9174657],"started":[9174812,9174424,9174878],"nic":[9174812,9174967,9174901],"fac":[9174302],"faced":[9174302],"world’":[9174302],"programm":[9174302,9175072,9175336,9174104,9174772,9174883,9174177,9174147,9174164,9174443,9174925,9174407,9174528,9174078,9175527,9174988,9174415],"piec":[9174302],"wondering":[9174302,9174943,9174429],"model":[9174302,9174337,9175620,9174275,9174537,9174791,9174850,9174808],"us":[9174302,9175262,9174586,9175652,9174969,9175048],"bug":[9174302,9174337,9175262],"proving":[9174302,9175048],"san":[9174337,9174534],"assign":[9174337,9174056,9174249],"alon":[9174337],"explained":[9174337],"post":[9174337,9174117,9175241,9175728,9174426,9174666,9174537,9174764,9174628,9174841,9175618,9175425,9174429],"heading":[9174337],"briefly":[9174337],"engin":[9174337,9175336,9174903,9174471,9175206,9174528,9174537,9175398,9174808,9175604],"brok":[9174337,9174588,9174808],"introduction":[9174337],"pay":[9174337,9175538,9175620,9174177,9174443,9174426],"substanti":[9174337],"amount":[9174337,9174079,9174844],"servic":[9174337,9174772,9174142,9174559,9173961,9174791,9174933],"tptacek":[9175072,9174895,9174305,9174429,9174222,9173979],"cicada":[9175072],"3301":[9175072],"mysteri":[9175072],"group":[9175072,9174407,9174666,9174825,9175602],"anonymously":[9175072,9174657],"posted":[9175072,9174808],"cryptopuzzl":[9175072],"clear":[9175072,9174539,9174455],"theory":[9175072],"recruiting":[9175072,9174056,9175538,9174870,9175620,9175241,9175728,9174703,9174918,9173961,9174374],"intellig":[9175072],"agenc":[9175072],"agree":[9175072,9174237,9174624,9175728,9175603,9174825,9174791],"com":[9175072,9175336,9174284,9174104,9174653,9175620,9174559,9174366,9174443,9174844,9174367,9175206,9175241,9175728,9175661,9174703,9173961,9174320,9174837,9174429,9174482,9174248,9175604],"presenting":[9175072],"channel":[9175072,9174808],"align":[9175072,9174879],"exception":[9175072],"beat":[9175072],"troubl":[9175072],"ye":[9175601,9174299,9174199,9174539,9175728,9175405,9175100,9174657,9175187],"hey":[9175328,9174174,9174495,9174429],"seek":[9175328,9175336],"pow":[9175328,9175519,9174588,9175652],"blast":[9175328],"c++":[9175328],"python":[9175328,9174890,9174297],"100":[9175328],"p":[9175328,9174534],"abov":[9175328,9175336,9174844,9174791,9174896,9175017],"obviously":[9175328,9174772,9174870,9175620,9174883,9174371,9175537,9175618],"subcontract":[9175328],"port":[9175328],"forward":[9175328,9174103,9175563,9174537,9175146,9174732],"i'll":[9175328,9174103,9175048,9175425,9174943],"tak":[9175328,9174286,9175581,9174417,9174559,9174878,9174528,9175046,9173961,9175713,9175398,9175425],"car":[9175328,9175336,9174056,9174104,9174132,9174286,9174177,9174495,9175581,9174624,9174169,9174426,9174588,9174822,9175048],"rest":[9175328,9174381,9174455,9175371,9175206,9174426,9174588],"contact":[9175328,9174657],"info":[9175328],"profil":[9175328,9174284,9175387,9174890,9174117],"suckered":[9175328],"using":[9175328,9175387,9174534,9174890,9174447,9174878,9174739,9174918,9175604],"bot":[9175328],"short":[9175328,9175661],"run":[9175328,9175620,9175170,9174586,9174918,9175713,9175602,9174658],"lifebanned":[9175328],"pric":[9175328,9174443],"nothing":[9175328,9175336,9174867,9174202,9174559,9174808],"compared":[9175328],"futur":[9175328,9175336,9174284,9174772,9174447],"earning":[9175328,9174455],"whol":[9174563,9174979,9174749,9174367,9174918,9173961,9174666,9174588,9174933,9175652,9175398,9174808,9174732],"mind":[9174563,9174079,9174103,9174559,9174320,9174837,9175550,9175604],"should":[9174563,9174056,9175387,9174132,9174534,9174772,9175057,9174443,9174169,9175728,9174426,9174901,9174537,9175059,9174588,9174808,9175527,9175604],"rac":[9174563,9174448],"pe":[9174563,9174426],"tool":[9174563,9174955,9174808,9175048],"resum":[9174563,9174284,9175620,9174844],"via":[9174563],"daily":[9174563,9174415],"routin":[9174563],"github":[9174563,9174317,9174284,9174534,9174166,9174808],"hackerrank":[9174563,9174404,9175519,9174166,9174559,9174078],"administr":[9174563],"ose":[9174563],"cloud/iaas/paa":[9174563],"provid":[9174563,9174624,9174791,9174933],"insid":[9174563,9174657],"coding":[9174563,9174104,9174417,9175563,9174528,9174537],"portfolio":[9174563,9174104,9174838,9174537],"respected":[9174563],"los":[9174563],"unwanted":[9174563],"built":[9174563,9175387,9175603,9175652],"young":[9174563],"gals/guy":[9174563],"author":[9174052,9174182,9174407,9174808],"fan":[9174052],"starg":[9174052],"univers":[9174052,9174479,9174539,9174182,9174657],"show'":[9174052],"premis":[9174052],"charact":[9174052,9174918],"identified":[9174052,9175241],"embedded":[9174052],"video":[9174052,9174559,9175661,9174206],"presum":[9174094,9174901],"based":[9174094,9174132,9174881,9174440,9174918,9174426],"film":[9174094],"teen":[9174094],"perfect":[9174094,9174174],"arcad":[9174094],"selected":[9174094],"pilot":[9174094],"actu":[9174094,9174056,9175563,9174537,9175652],"spacecraft":[9174094],"mid":[9174127],"80":[9174127],"anoth":[9175336,9174346,9174772,9174559,9174366,9175728,9174248],"apply":[9175336,9175564,9174132,9174890,9174146,9174895,9174528,9174222],"data":[9175336,9175564,9175728,9174277,9174426,9174248],"analysi":[9175336,9175564,9174918,9175602],"produc":[9175336,9175564],"concret":[9175336,9175564],"numb":[9175336,9175564,9174151,9174559,9174739,9175652],"repres":[9175336,9175564,9174367],"merit":[9175336,9175564],"fellow":[9175336,9175564],"human":[9175336,9175564,9175550],"utterly":[9175336],"irr":[9175336],"both":[9175336,9174378,9174772,9174883,9174299,9174844,9174764,9174482],"leisur":[9175336],"day":[9175336,9174284,9175387,9174286,9174174,9174346,9174890,9175519,9174447,9174653,9175563,9174366,9175057,9174443,9174448,9175618,9174929,9174732],"except":[9175336,9174586,9174982],"else":[9175336,9174104,9174417,9174165,9174559,9174832,9175187,9174482],"roof":[9175336,9174443],"family'":[9175336],"l":[9175336,9174142,9175262,9174891],"cal":[9175336,9174878,9174837,9175469],"yourselv":[9175336],"treated":[9175336],"invested":[9175336,9174465],"offered":[9175336,9174867],"salary":[9175336,9174056,9175246,9174443,9174169],"averag":[9175336],"adult":[9175336],"lur":[9175336],"frivol":[9175336],"perk":[9175336],"stock":[9175336],"option":[9175336,9174117,9174275,9174328],"training":[9175336,9175057,9174426],"pension":[9175336],"secur":[9175336],"golden":[9175336],"union":[9175336],"join":[9175336,9175380,9174447,9174443],"demand":[9175336,9174870,9174969,9175048],"merg":[9175336],"patch":[9175336],"degrad":[9175336],"perform":[9175336,9174117,9174588,9174657],"introduc":[9175336,9174903,9175563],"timing":[9175336,9175241,9175728],"error":[9175336,9174495,9174955,9174898],"they'l":[9175336,9174177,9174198],"bottom":[9175336,9174165,9174654],"abilit":[9175336,9174359,9174417],"autom":[9175336],"away":[9175336,9175620,9174206,9174275],"poor":[9175336],"tel":[9175564,9174982,9174588,9175469],"hear":[9175564,9174056,9174890,9175620,9174320,9175550],"easi":[9175564,9174870,9174495,9174955],"linear":[9175564],"algebra":[9175564],"learning":[9175564,9174120,9174300,9174275,9174841,9175604],"certainly":[9175380,9174079,9174359],"view":[9175380,9174117,9175371,9174764],"rich":[9175380,9174822],"rememb":[9175422],"alway":[9175422,9174104,9174844,9175661,9174426,9174666,9174537,9175713,9175604],"varying":[9175422,9175652],"measur":[9175422,9175602],"ceo":[9175422,9175187,9175425,9175073],"lowliest":[9175422],"employee":[9175422,9174417,9175527,9175602],"waiting":[9174056,9174870],"thisthat":[9174056],"questionswil":[9174056],"common":[9174056,9175661],"coursera":[9174056],"ran":[9174056,9174103,9173961,9174248],"copying":[9174056],"intend":[9174056,9174844],"prev":[9174056,9174346,9175652],"mentioned":[9174056,9174841,9174429],"dmca":[9174056],"tutori":[9174056],"instead":[9174056,9174388,9174404,9175387,9174772,9174305,9174169],"track":[9174056,9174534],"iter":[9174056],"guess":[9174056,9174772,9174198,9174182,9174603,9174925,9174982,9173961,9175603,9175604],"rid":[9174056,9174443,9174624,9174367],"strateg":[9174056,9174933],"you've":[9174056,9174772,9174299,9174443,9174537,9174248],"tiny":[9174056,9175371],"typo":[9174056,9174169],"section":[9174056,9174165,9174203,9174169],"fold":[9174056,9174169],"gmail":[9174056,9174169],"saving":[9174056,9174169],"messag":[9174056,9174169],"used":[9174056,9174117,9174559,9174531,9174898,9174169,9174588,9174429],"advic":[9174056,9174104,9174169],"negoti":[9174056,9174624,9174169,9174764],"tip":[9174056],"advantag":[9174056,9174300,9175620,9175425],"interviewing":[9174317,9174772,9174870,9174142,9175713],"truly":[9174317,9174764],"putting":[9174317,9174879],"behind":[9174317,9174443,9174988],"contributing":[9174317],"thought":[9174388,9174890,9175241,9175728,9174901,9174320,9175550,9173979],"contribut":[9174388,9174359,9174901],"certain":[9174388,9174867,9174417,9174366,9174455,9175661,9175652],"nee":[9174388,9174479,9174140,9174879,9174903,9174772,9174955,9175581,9174166,9174559,9174443,9175241,9175728,9174407,9174918,9174791,9174841,9175398,9174936],"able":[9174388,9174229,9174166,9174297,9174275,9174537,9175398],"larg":[9174388,9174104,9174407,9175652],"codebas":[9174388],"design":[9174388,9174132,9174151,9175527,9175550,9175602],"algorithm":[9174388,9174142,9175206],"rarely":[9174388,9174534],"radically":[9174388],"changing":[9174388,9174146],"funda":[9174388],"angle":[9174428],"we'd":[9174428],"contribution":[9174428],"startfight":[9174574],"taken":[9174574,9175371],"insanely":[9175088,9174174],"subscribed":[9175088],"mo":[9175088],"ago":[9175088,9174878,9175618],"i’m":[9174079,9174979],"select":[9174079,9174879,9174979,9174177,9175527],"many":[9174079,9174120,9175519,9174151,9174471,9174559,9174844,9174898,9175728,9174528,9175100],"i’ve":[9174079],"played":[9174079,9174299],"trivi":[9174079,9174844],"didn’t":[9174079],"they’v":[9174079],"can’t":[9174079],"afford":[9174079,9174120],"dozen":[9174079,9174284,9174443],"hour":[9174079,9175387,9174120,9174359,9174174,9174870,9175246,9174366,9174455,9174275,9175652,9175398],"due":[9174079],"family/work/oth":[9174079],"oblig":[9174079],"significantly":[9174079,9174160],"altern":[9174079,9174479,9174861],"concerned":[9174079,9174366,9174531,9175527],"class":[9174079,9174237,9174557],"unfairly":[9174079],"poorly":[9174079],"they'r":[9174284,9175387,9174142,9174165,9174878,9174586,9174982,9174320,9174764,9174822,9174837],"hoping":[9174284,9174534,9174426,9174901],"hug":[9174284,9174120,9174300,9174870,9175581,9174537],"sav":[9174284,9174559],"updating":[9174284],"contacting":[9174284],"replying":[9174284,9174653],"searching":[9174284],"description":[9174284],"writing":[9174284,9175170,9175206,9175241,9174426,9174666],"cov":[9174284,9174918],"lett":[9174284],"tweaking":[9174284],"previously":[9174284,9174684],"updated":[9174284],"sending":[9174284],"maintaining":[9174284],"fit":[9174284,9174890,9174297,9174658],"spending":[9174284,9175387,9174648,9174424,9174666],"interviewingand":[9174284],"tried":[9174404,9174534,9174588,9175713,9174248],"stop":[9174404,9174479,9174534,9174870,9174367,9174537,9175713],"shop":[9174404,9174479],"hunting":[9174404,9174479,9174247],"suck":[9174404],"rep":[9174404],"stackoverflow":[9174404,9175387,9174534],"eles":[9174404],"term":[9174404,9174359,9174151,9174305,9174878,9174891,9174925,9175184,9174901,9174537,9175527],"correspond":[9174404],"reality":[9174404,9175538,9174424,9174969],"flattered":[9174479],"thread":[9174479,9175728],"somehow":[9174479,9174495,9174182,9174206],"monopol":[9174479],"standing":[9174479],"let":[9174479,9174166,9175563,9174448,9175206,9173961],"fear":[9175387,9175538,9174890,9174367,9174837],"domin":[9175387],"bunch":[9175387,9175398,9174808,9175550],"fiefdom":[9175387],"waxing":[9175387],"waning":[9175387],"stay":[9175387,9174559],"laid":[9175387],"scor":[9175387,9174534,9174117,9175206,9175241,9175527],"wherev":[9175387],"sp":[9175387,9174918],"otoh":[9175387],"easily":[9175387,9175469,9174658],"softwareco":[9175387],"foo":[9175387],"without":[9175387,9174534,9174772,9174890,9175241,9175661,9174739,9173961,9174901,9174850,9174808,9175604],"seri":[9175387,9174879],"respons":[9175387,9174132,9174844,9175728,9174822],"end":[9175387,9174249,9174918,9174708,9174666,9174837,9174658],"silly":[9175387,9174918],"d":[9175387,9174166,9174305,9174559,9174321,9174316,9175563,9174448,9175550],"ctf'":[9175387,9174447],"add":[9175387,9174772,9174166,9175563,9175728],"expert":[9175387,9174237,9175425],"disconnect":[9175538],"unplugged":[9175538],"incent":[9175538,9174879,9174903,9174657,9175652,9174969,9175048],"direct":[9175538,9175604],"financi":[9175538],"directly":[9175538,9174772,9174653,9175581,9175241,9175728,9175602],"privileg":[9175538],"microcorruption":[9174103,9174378,9174229,9174881,9174531,9174249,9173961,9174277,9175059,9175100,9174588,9174841,9174808,9175048,9174482],"unfair":[9174104,9174359],"fraction":[9174104],"honing":[9174104],"quality":[9174104,9174359,9174879,9174844,9175527],"edit":[9174104,9175563,9174588,9174764,9174933,9174936,9174763],"unpopular":[9174104],"craft":[9174104],"industry":[9174104,9175620,9174146,9174559,9174366,9174455,9175206,9175728,9174528],"ext":[9174104,9174918,9175550],"equ":[9174104,9174844,9174791],"impress":[9174104],"feet":[9174104],"disproportionately":[9174120],"avail":[9174120,9174559,9174732],"privileged":[9174120],"grew":[9174120,9174300],"household":[9174120,9174300],"wasn't":[9174120,9174300,9174925,9175550],"abund":[9174120,9174300],"math/comput":[9174120,9174300],"put":[9174120,9174870,9175581,9173979,9175604],"food":[9174120],"t":[9174120,9174772,9174841],"anhour":[9174120],"walking":[9174120],"ga":[9174120],"generally":[9174120,9175184],"forced":[9174120,9174588],"trad":[9174120,9174657,9174764],"terr":[9174120,9175620],"ratio":[9174120],"":[9174120],"energy":[9174120],"hacking":[9174120],"microcontrol":[9174120],"accumulated":[9174300],"describ":[9174300,9174883,9174299],"pres":[9174300],"length":[9174300],"chang":[9174300,9174407,9174732],"replac":[9174132,9174772,9175519,9174305,9174443,9175206,9174465,9175618],"entirely":[9174132,9175620,9174199,9174624],"won't":[9174132,9174346,9174879,9175563,9174537,9174657,9175048],"considered":[9174132,9174174,9175184],"children":[9174132],"policy":[9174132],"illeg":[9174132],"discrimin":[9174132],"irrelev":[9174132],"featur":[9174132,9174808],"li":[9174132],"parent'":[9174286],"implicitly":[9174286],"filt":[9174286,9174346],"asking":[9174286,9174890,9174117,9174764],"consuming":[9174286],"multi":[9174286],"phas":[9174286],"already":[9174286,9174174,9174534,9174772,9174890,9174883,9174237,9174471,9174537,9174841,9175398,9174631,9175602,9174658],"difficult":[9174286,9175170,9174249,9175425],"contract":[9174286,9174838,9174202,9175563,9174624],"sev":[9174286,9175713],"complicated":[9174286,9174586],"kid":[9174286],"skilled":[9174359],"less":[9174359,9174174,9174870,9174890,9174495,9174955,9174559,9175206,9174982,9174537,9175398,9174631,9175527,9174482],"necessarily":[9174359,9174371,9175604],"fact":[9174359,9174870,9174198,9174424,9175728,9174933,9174808,9175425],"sinc":[9174359,9174297,9174206,9174708,9174248],"each":[9174359,9174903,9174206,9173961],"judged":[9174359],"rel":[9174359],"progress":[9174359,9174808],"adapt":[9174359],"prior":[9174359,9175527],"moreov":[9174359],"offset":[9174359],"commit":[9174359,9174174,9174654],"paying":[9174359,9174117],"wag":[9174359,9174837],"worth":[9174359,9174881,9175581,9175398,9175048,9174482],"benefit":[9174359,9175581,9174401,9174666,9174933,9174078],"definitely":[9174378,9174895,9174559,9174429,9174484],"squar":[9174378,9175425],"ti":[9174378],"gen":[9174378,9174534,9174918],"rul":[9174378,9174772,9173961,9174832],"experienced":[9174378],"neith":[9174140],"demonstr":[9174140,9174624],"there'":[9174140,9174198,9174531,9174169,9174249,9174275,9174908,9174982,9174588,9175604],"identify":[9174140,9174881,9175425],"maximally":[9174174],"casting":[9174174],"net":[9174174],"pool":[9174174,9174982],"including":[9174174,9174890,9174979],"folk":[9174174,9175537],"demanding":[9174174],"career/family/etc":[9174174],"situ":[9174174],"salaryman":[9174174],"frustr":[9174174],"shouldn't":[9174174,9174537],"enemy":[9174174],"exist":[9174174,9174772,9174237,9174495,9174265,9175073],"march":[9174174],"9th":[9174174],"2015":[9174174,9174982],"hostil":[9174174,9174320],"scheduling":[9174174,9174870,9175398],"flexibility":[9174174],"specul":[9174174,9174898],"fly":[9174174,9174346],"contin":[9174174],"six":[9174174,9174557],"round":[9174174,9174202],"proposition":[9174174,9174988],"extract":[9174174],"gauntlet":[9174174],"substantially":[9174174],"delivered":[9174174],"candidate'":[9174174,9174903],"pac":[9174174,9174559],"unambigu":[9174174],"win":[9174174,9174147],"ensur":[9174346],"befor":[9174346,9174772,9174890,9175519,9174229,9175206,9175603,9175726,9175602,9174248],"begin":[9174346,9174588],"immedi":[9174534,9174901],"pre":[9174534,9174982],"thoma":[9174534,9174249,9174841,9175073,9174482],"asked":[9174534,9175206],"kick":[9174534],"least":[9174534,9174879,9174861,9174559,9174366,9174988,9175604],"ify":[9174534],"oddly":[9174534],"fascinated":[9174534],"watch":[9174534],"statu":[9174534,9174732],"quo":[9174534,9174732],"inertia":[9174534],"act":[9174534,9174903],"sabotag":[9174534],"imagin":[9174534,9174890,9174883,9174531,9174878,9174429],"contrib":[9174534],"metr":[9174534,9174844],"door":[9174534],"fast":[9174534,9175206],"ide":[9174534,9174918],"plu":[9174534,9174903],"screen":[9174534,9175519,9175398,9175618],"psycho":[9174534],"narcissist":[9174534],"pain":[9174534],"ass":[9174534,9174918],"virtually":[9174534,9175581],"obstacl":[9174534],"dept":[9174534],"hazing":[9174534],"cultur":[9174534,9174447,9174381,9174844,9174898,9175048],"stupid":[9174534],"guy/girl":[9174534],"distrust":[9174534],"nobody":[9174534,9175241,9174657,9174933],"fired":[9174534,9175187],"old":[9174534,9174320,9174328,9174929],"method":[9174534],"etc":[9174534,9175620,9174559,9174624,9174249,9174528,9174918,9174631,9174896,9174248],"watching":[9174534,9174424,9175550],"succ":[9174534,9174844,9174918],"worry":[9174879,9174772,9174890,9174316,9174448],"pitch":[9174879],"tr":[9174879],"ordinary":[9174879,9174415],"front":[9174879],"s":[9174879,9174169,9175206,9174440,9174918,9175726,9175398,9174248],"miser":[9174879,9174982],"bet":[9174879,9174841],"fir":[9174879],"selling":[9174879],"occasionally":[9174879],"tox":[9174879],"sided":[9174879],"marketplac":[9174879,9174237],"absolutely":[9174879,9174883,9175581],"cruci":[9174879],"screened":[9174879],"high":[9174879,9174844,9174297,9174918],"applic":[9174879,9174772,9174537],"consid":[9174879,9175398],"resourc":[9174879,9174166,9174559,9174648,9174429],"wast":[9174879,9175241],"deleted":[9174903],"draft":[9174903,9175603],"published":[9174903,9174808],"expeditiously":[9174903],"dignity":[9174903],"togeth":[9174903,9174482],"yeah":[9174903,9175325],"conflu":[9174903],"regarding":[9174903,9174870,9175184],"compatibility":[9174903],"ear":[9174368],"certif":[9174772,9174870,9174890,9174559,9174624],"counting":[9174772],"requir":[9174772,9174955,9174559,9174844],"coaching":[9174772],"remov":[9174772],"portion":[9174772],"placing":[9174772],"understanding":[9174772,9174955,9175048],"stand":[9174772,9173961],"placed":[9174772],"hired":[9174772,9174870,9175398,9174969],"employed":[9174772],"buying":[9174772],"keeping":[9174772,9174918,9174654,9174482],"teach":[9174772],"providing":[9174772,9174624,9174791,9174933],"maxim":[9174772],"interaction":[9174772],"meet":[9174772],"whit":[9174772],"board":[9174772],"ping":[9174772],"pong":[9174772],"bal":[9174772],"convers":[9174772,9174881],"potenti":[9174772,9174447,9174146,9174429],"bring":[9174772,9174603],"rebuild":[9174772],"destroying":[9174772,9175728],"adding":[9174772,9174366],"red":[9174772,9175519,9174142],"tap":[9174772,9175519],"literally":[9174870,9175620],"object":[9174870,9175241],"took":[9174870],"reduc":[9174870,9174559,9174448],"matasano'":[9174870],"cam":[9174870,9174447,9174381,9174539,9174763],"slashed":[9174870],"half":[9174870,9174447],"passed":[9174870,9175398],"wrot":[9174870,9174918,9174808,9174415],"liked":[9174870,9174895],"demanded":[9174870],"slightly":[9174870],"convention":[9174870,9174142,9173961,9174631],"totally":[9174870,9174895,9174531,9174537,9174588],"flex":[9174870],"unlik":[9174870],"rigidly":[9174870],"scheduled":[9174870],"morning":[9174870],"tuesday":[9174870],"threw":[9174870],"odd":[9174870,9174297],"needed":[9174870,9174447],"stress":[9174870],"couch":[9174870,9174415],"alien":[9174870],"offic":[9174870],"staring":[9174870],"properly":[9174870,9174739],"themselv":[9174870],"slaying":[9174870],"dragon":[9174870],"breaking":[9174870,9174537],"client/serv":[9174870],"distilled":[9174870],"ess":[9174870],"removed":[9174870],"decid":[9174870,9174588],"randomly":[9174870,9174631],"night":[9174870],"slic":[9174870,9174455,9175371,9174182],"pizza":[9174870],"mouth":[9174870],"weird":[9174870,9175581,9174969,9175048,9174227],"soci":[9174870],"pressur":[9174870],"string":[9174870,9174918],"pointless":[9174870,9175241],"once":[9174870,9174142,9174559,9174248],"pur":[9174870],"chil":[9174870],"filtered":[9174870],"hatred":[9174870],"wound":[9174870],"zero":[9174870,9174471],"dynam":[9174870,9173961,9175652],"becom":[9174890,9174448,9175206,9174925],"extra":[9174890,9174559,9174763],"called":[9174890],"suspect":[9174890,9175652,9175618],"capabilit":[9174890,9174559],"trying":[9174890,9175519,9175620,9174371,9174165,9175398,9174732],"invit":[9174890,9174206],"demonstrated":[9174890],"compet":[9174890,9175371,9173961],"bad":[9174890],"excit":[9174890,9174588],"__anyway__":[9174890],"multipl":[9174890,9175728,9174764,9174841],"greeting":[9174890,9174640],"spammed":[9174890,9174988],"random":[9174890,9175581,9175550],"linkedin":[9174890],"java":[9174890],"biggest":[9174890],"chop":[9174890],"happened":[9175519,9174648,9174749,9174588],"esque":[9175519],"me":[9175519],"ended":[9175519],"addition":[9175519],"step":[9175519,9174559,9174631],"jump":[9175519],"hoop":[9175519],"revers":[9175519,9174447,9174559],"desperately":[9175519],"dict":[9175519],"cannot":[9175519,9175425],"hyperbol":[9174447,9174653],"coming":[9174447,9174653,9174177,9174808,9175550],"anyway":[9174447,9174165],"meeting":[9174447,9174229],"mingling":[9174447],"surpass":[9174447],"hous":[9174447],"driver'":[9174447],"seat":[9174447],"realistically":[9174447],"newest":[9174447],"choic":[9174447,9174850],"versu":[9174447],"ful":[9174447,9174087,9175241,9175527,9175604],"visit":[9174447],"three":[9174447,9174257,9174657],"aft":[9174447,9174199,9174203,9174366,9174455,9174844,9174275,9174666,9175713],"finished":[9174447],"extended":[9174447],"ultimately":[9174447,9174559],"caused":[9174447],"massachusett":[9175246],"decided":[9175246],"start":[9175246,9174867,9174881,9175726,9174929,9174227],"negotiating":[9175246],"told":[9175246],"stopped":[9175246,9174424],"glad":[9175246],"furth":[9175246,9174967],"mechan":[9174979,9174559,9174528,9174078,9174948],"thinking":[9174229,9174918,9174841,9174896],"cryptop":[9174229,9174248],"grad":[9174229],"minut":[9174229],"sucked":[9174229],"wormhol":[9174229],"biz":[9175620],"early":[9175620,9175469,9174732],"goe":[9175620,9174891],"conting":[9175620],"neg":[9175620,9174666],"connot":[9175620],"constrain":[9175620],"bia":[9175620,9174407,9174901,9175527],"pipelin":[9175620,9175241],"backed":[9175620],"undermin":[9175620],"associating":[9175620],"interestingly":[9175620],"encountered":[9175620],"consum":[9175620],"suit":[9175620],"pointed":[9175620],"freelanc":[9174087],"scores/achiev":[9174838],"publ":[9174838,9174117],"accessed":[9174838],"bidding":[9174838],"implement":[9174861],"competing":[9174861,9174249],"threshold":[9174867],"stag":[9174867],"below":[9174867],"overthewir":[9174867],"progression":[9174867,9174249],"'levels'":[9174867],"hurt":[9174867],"twiddl":[9174881],"knob":[9174881],"subset":[9174881,9174471],"discov":[9174883],"formally":[9174883],"ability":[9174883,9174559,9174320],"known":[9174883,9174925,9175713],"solved":[9174883,9175603],"focusing":[9174883,9175398],"novel":[9174883],"comput":[9174883,9175581,9174539,9174586,9174440],"sci":[9174883,9175581,9174146],"blog":[9174117,9175241,9174426,9174537,9174764],"primarily":[9174117,9174381],"funnel":[9174117,9175563],"engag":[9174117,9174415],"bringing":[9174117],"qualified":[9174117,9174982],"ref":[9174117,9174967,9174528,9174394,9174429],"smal":[9174117,9174559,9174455,9174169,9174918,9175398],"allowing":[9174117,9174588,9174657],"pvp":[9174151,9174371],"el":[9174151],"matching":[9174151],"smart":[9174151,9175371,9175241,9175728],"overriding":[9174151],"dominating":[9174151],"comfort":[9174151,9174808],"complaint":[9174142],"heavy":[9174142],"tough":[9174142],"cach":[9174142],"latency":[9174142],"black":[9174142],"tree":[9174142],"optim":[9174142],"bashing":[9174142],"php":[9174142],"mysql":[9174142],"selecting":[9174142],"honestly":[9174177,9175100,9174588,9174658],"addicted":[9174198],"onlin":[9174198,9174424,9174628,9175713,9175425],"unlikely":[9174202,9174465],"choos":[9174202],"firm":[9174202,9174808],"making":[9174202,9175262,9174316,9174182,9174791,9174933,9174969,9175048,9175527,9175604],"diff":[9174202,9174381,9175371,9174841,9175048],"fairly":[9174202,9174401,9174708,9175652],"rost":[9174202],"tast":[9174202,9174495],"coy":[9174202],"jinx":[9174202],"signing":[9174202,9174237],"inundated":[9174237,9174471],"unattract":[9174237,9174471],"de":[9174237,9174933,9174929],"google/apple/dropbox/nsa":[9174237],"500k/year":[9174237],"100k":[9174237],"bonu":[9174237],"skunkwork":[9174237],"incred":[9174237],"flow":[9174237],"created":[9174237,9175728,9174841],"position":[9174237,9174844,9174588],"launching":[9174237],"true":[9174471,9174443,9174822],"conveniently":[9174471],"vis":[9174471],"industry'":[9174471],"antiquated":[9174471],"ineffici":[9174471,9174465],"exclusionary":[9174471],"practic":[9174471,9174146],"talented":[9174471,9174407,9174588,9175527],"arbitrag":[9174471],"inefficiency":[9174471],"who'v":[9174495,9174407],"assumed":[9174495],"w":[9174495],"finding":[9174495,9175262],"exploit":[9174495,9174265,9174249,9174841],"clev":[9174495],"bytecod":[9174495],"secret":[9174495,9174918],"mar":[9174495,9174955],"he":[9174495],"pron":[9174495,9174955],"insight":[9174495],"lowest":[9174495],"execution":[9174495,9174808],"revealed":[9174495],"science_":[9174495],"everyon":[9174495,9174559,9175187],"welcom":[9174495,9174443],"opinion":[9174495,9174657,9174248],"safety":[9174955],"low":[9174955,9174537],"happening":[9174955,9174367],"articl":[9174955,9174146,9174199,9175661,9174528,9174588,9174078],"ind":[9174955,9174764],"deep":[9174955,9175604],"break":[9175581,9175537],"singl":[9175581,9174537,9175652],"quot":[9175581],"/19'":[9175581],"address":[9175581,9175728,9174426,9174808,9175550,9175602],"tour":[9175581],"functionality":[9175581],"opportunity":[9175581,9174808,9175425],"crawl":[9175581],"ventil":[9175581],"duct":[9175581],"hatch":[9175581],"tink":[9175581],"inn":[9175581],"hugely":[9175581],"complex":[9175581],"coher":[9175581],"forc":[9175581,9174657,9174808],"retain":[9175581],"seeming":[9175581],"detail":[9175581,9175184,9174657,9174808],"endorphin":[9175581],"rush":[9175581,9174275],"competit":[9175581,9174147,9174844,9175728,9175527],"everything":[9175581,9174588,9174657],"learned":[9175581],"syllabu":[9175581],"exercis":[9175581,9175563],"framed":[9175581],"typically":[9175262],"penetr":[9175262],"auditing":[9175262],"people'":[9175262],"wellbeing":[9175262],"nsa":[9175262],"actively":[9175262,9174588,9175602],"remedi":[9175262],"analyst":[9175262],"googl":[9175262],"flaw":[9175262],"result":[9175262,9175469,9175146],"users'":[9175262],"leaked":[9175262],"repairing":[9175262],"approach":[9174401,9175563,9174297,9175537,9173979],"particular":[9174401,9174275],"cred":[9174401,9175241],"attracting":[9174401],"traditionally":[9174401],"reach":[9174401,9174850],"demograph":[9174401,9175527,9175602],"hidden":[9174146,9175527],"gem":[9174146],"settled":[9174146,9174247],"assess":[9174146,9175563,9174588],"tru":[9174146],"beyond":[9174146],"en":[9174146],"shin":[9174146],"miss":[9174247,9174808,9175602],"prop":[9174247],"trading":[9174247],"tax":[9174247],"return":[9174247],"basically":[9174247,9174841],"ruin":[9174247],"weekend":[9174247,9174206],"organ":[9174147],"viciously":[9174147],"determined":[9174147],"lead":[9174147,9174844],"society":[9174147,9174933],"effici":[9174147,9174465],"solution":[9174147,9174206,9174275,9174918,9174708,9174588,9174628,9175713],"elabor":[9174147,9174708],"richard":[9174147],"bartl":[9174147],"four":[9174147,9174988],"mud":[9174147],"iirc":[9174257],"explor":[9174257,9174265,9175057,9174588],"socialit":[9174257],"grief":[9174257,9174371],"4th":[9174371,9174169],"kil":[9174371],"specifically":[9174371,9174426],"generallyl":[9174371],"challenge/reward":[9174371],"fighting":[9174371],"winning":[9174371],"killed":[9174371,9174588],"griefing":[9174371],"impuls":[9174265],"topcod":[9174160,9174299],"until":[9174299,9174559,9174808,9175073],"warcraft":[9174299],"tetri":[9174299],"remind":[9174417,9175550,9174481,9174654,9174763],"loc":[9174417,9175170,9175652],"exclusively":[9174417],"organizing":[9174417],"contest":[9174417,9174878,9173961],"measuring":[9174417],"trait":[9174417],"again":[9174417,9174465],"beginn":[9174164],"signed":[9174164,9175151,9174206],"fight":[9174164],"star":[9174164,9174640],"r":[9174165,9174844],"crazy":[9174165],"block":[9174165],"creating":[9174165,9174588],"videogam":[9174165],"finally":[9174165,9174918,9174537],"text":[9174165,9174249,9174429],"halfway":[9174165,9174227],"down":[9174165,9174844,9174227],"applying":[9174165],"reminded":[9175151],"pickup":[9175151],"artist":[9175151],"books/seminar":[9175151],"gav":[9175151,9175652,9174248],"chuckl":[9175151],"nevertheless":[9175151],"immediately":[9175151],"www":[9175151],"blueprintdecoded":[9175151],"com/":[9175151],"bullshit":[9174895],"filter=strong":[9174895],"flag":[9174895,9175206,9174603,9174878,9173961,9174631],"appear":[9174199,9175713],"entir":[9174199,9175728],"genr":[9174199,9174182],"written":[9174381,9174631],"audi":[9174381,9175425],"infosec":[9174381,9174539,9175325,9174925],"across":[9174381,9174248],"clearly":[9174381,9174182,9174936],"intended":[9174381,9174297,9175618],"between":[9174381,9175371,9174426,9174901,9174764,9175048],"forget":[9175325],"culture/terminology":[9175325],"infomerci":[9174203],"closed":[9174203],"pag":[9174203,9175398,9174227],"patio11'":[9175170],"he'":[9175170],"presumably":[9175170],"tested":[9175170],"mayb":[9175170,9175728,9175398,9174227,9175604],"stuck":[9175170,9175059,9175100],"maxima":[9175170],"remain":[9174166],"meetup":[9174166],"preparing":[9174166],"conquering":[9174166],"jeez":[9174166],"monkey":[9174166,9174559,9174316,9175563,9174448],"gig":[9174305],"usu":[9174305,9174603],"song":[9174305,9174321],"acquir":[9174559],"degr":[9174559],"insta":[9174559],"signaling":[9174559],"vari":[9174559,9174249,9175652,9174248],"difficulty":[9174559,9174249],"entr":[9174559],"scarc":[9174559],"support":[9174559,9174275,9174791,9174850],"par":[9174559],"family":[9174559],"memb":[9174559,9174844,9174320],"subject":[9174559,9174275,9174918,9174708],"pertin":[9174559],"continually":[9174559],"theory/techniques/technolog":[9174559],"floss":[9174559],"'challenge'":[9174559],"possibly":[9174559],"mention":[9174559,9175563,9174206],"'administrative'":[9174559],"commun":[9174559],"noted":[9174559],"stab":[9174559],"replacing":[9174559],"favor":[9174559],"evolv":[9174559,9174763],"cycl":[9174559],"consolid":[9174559],"deconsolid":[9174559],"separ":[9174559],"devic":[9174559],"mus":[9174559],"increasingly":[9174559],"'skil":[9174559],"acquisition":[9174559],"simian":[9174559],"floor":[9174559],"theory/techniques/technology":[9174559],"ordinarily":[9174559],"mentor":[9174648,9174465],"green":[9174648],"factor":[9174316,9175563,9174448],"decreas":[9174316,9175563],"straight":[9175563],"cheat":[9175563,9174275,9174918,9174708],"exclus":[9175563],"confidenti":[9175563],"ad":[9175563],"preferred":[9175563],"contractor":[9175563],"arrang":[9175563],"cyn":[9174366],"burned":[9174366],"maintain":[9174366,9174455],"activit":[9174366,9174455],"personally":[9174366,9174624,9174844,9174407,9174588],"50+":[9174366],"week":[9174366,9175728,9174426,9174493],"studying":[9174366],"leveling":[9174366],"ord":[9174366,9175726],"exhausting":[9174366],"implied":[9174366,9175425],"responsibility":[9174366],"pl":[9174366],"overwhelming":[9174366,9175371],"seeking":[9174366],"match":[9174366],"asid":[9175057],"study":[9175057],"grow":[9175057,9175726],"therefor":[9175057,9174764],"draw":[9175057,9174426,9174666],"subjected":[9174455],"repeated":[9174455],"earn":[9174455,9174557,9174206],"living":[9174455,9174297,9174732],"assured":[9174455,9175371],"crowd":[9174455],"fin":[9174455,9174624],"enjoying":[9174455],"beauti":[9174557],"city":[9174557,9174732],"figur":[9174557,9175603,9175604],"asp":[9174557],"majority":[9175371,9174426],"percentag":[9175371],"seriously":[9175371,9174448,9174415],"rais":[9174424],"nyt":[9174424],"regularly":[9174424],"battl":[9174424],"drop":[9174424,9174844,9174206],"nightly":[9174424],"director":[9174443],"operating":[9174443],"schedul":[9174443],"10x":[9174443],"product":[9174443,9174426,9174666,9174791],"telling":[9174443,9174520],"directory":[9174443],"lat":[9174443,9174426,9175100,9174248],"dollar":[9174443],"accomplished":[9174443],"50k":[9174443],"laying":[9174443],"rating":[9174448],"posit":[9174448],"increasing":[9174448],"spee":[9174448],"rat":[9174448],"hip":[9174448],"n+1":[9174448],"blech":[9174448],"sheltered":[9174448],"tunnel":[9174448],"pip":[9174448],"recruiter'":[9174448],"desk":[9174448],"verify":[9174448,9174624],"eligibility":[9174448],"identit":[9174531,9174588],"priv":[9174531,9174588],"identifi":[9174531,9174588],"usernam":[9174531,9174588],"privacy":[9174531],"bizarro":[9174531,9174808],"third":[9174531],"party":[9174531],"emerg":[9174531,9174182],"interoper":[9174531],"shield":[9174531],"suggest":[9174624,9174182,9174764],"llc":[9174624],"cto":[9174624],"along":[9174624,9175241,9175425,9174429],"credibility":[9174624],"turn":[9174624,9174275],"intang":[9174624],"interperson":[9174624],"relationship":[9174624],"liability":[9174624],"measurably":[9174624],"crappy":[9174624],"disclaim":[9174624,9174078],"relating":[9174624],"futz":[9174624],"winded":[9174624],"alpha":[9174624],"mal":[9174624,9174426,9174666],"chest":[9174624,9174844],"thumping":[9174624,9174844],"capability":[9174624],"discuss":[9174624],"mesh":[9174624],"aspir":[9174624,9174407],"loud":[9174624],"mouthed":[9174624],"jackass":[9174624],"flying":[9174624],"color":[9174624],"cold":[9174844],"shifting":[9174844],"pursuing":[9174844],"tend":[9174844,9174666,9174808,9174948],"hyp":[9174844],"that":[9174844],"characterist":[9174844],"fair":[9174844,9175603,9174764],"famil":[9174898],"variety":[9174898,9174764],"personalit":[9174898],"bewar":[9174898],"attribution":[9174898],"underlying":[9174898],"extraordinarily":[9174898],"mov":[9174367,9174537],"uneas":[9174367],"xkcd":[9174367],"eye":[9174169,9174482],"'why":[9174169],"team'":[9174169],"paragraph":[9174169],"2nd":[9174169],"unfortunately":[9175206,9175652],"fundamentally":[9175206,9174586],"unseri":[9175206],"presently":[9175206],"identif":[9175206],"whiteboarding":[9175206],"anci":[9175206],"useless":[9175206],"trick":[9175206],"captur":[9175206,9174603,9173961],"that'l":[9175206],"unfathomably":[9175206],"ridicul":[9175206],"finish":[9175206,9175550],"god":[9175206],"gain":[9175206],"momentum":[9175206],"recogn":[9175206],"ranking":[9175206],"opening":[9175241],"vein":[9175241],"guessing":[9175241],"patrick'":[9175241,9175728],"led":[9175241],"itself":[9175241,9175728,9174969,9174482],"contain":[9175241],"halv":[9175241],"outreach":[9175241,9175728,9175550],"qualif":[9175241,9175728],"street":[9175241],"preach":[9175241],"mod":[9175241,9174603,9174739,9174808],"remun":[9175241],"effectively":[9175241],"resume/interview/github":[9175241],"buried":[9175241],"instinct":[9175241,9174969],"reconcil":[9175241],"patrick":[9175241,9174537,9174841,9174504,9175187,9174481,9174482],"chos":[9175241],"perceived":[9175241,9174901],"discrepanc":[9175241],"pleas":[9175241,9174929],"speak":[9175241,9175618],"erin":[9175241,9174249,9174277,9174808],"reply":[9175728],"regrettably":[9175728],"snarky":[9175728],"correl":[9175728,9175527],"cont":[9175728,9175652,9174808],"surprised":[9175728,9174808],"considering":[9175728,9174732],"ourselv":[9175728],"outlined":[9175728],"namely":[9175728],"consistency":[9175728],"“natural”":[9175728],"linked":[9175728,9174528],"disagr":[9175728],"purpos":[9175728,9174832,9174808],"reaching":[9175728],"email":[9175728,9174440,9174943],"apparently":[9175728],"seemingly":[9175728],"middleman":[9175728,9174537],"realm":[9175728],"int":[9175728,9174586],"fascinatingly":[9174182],"incomprehens":[9174182],"dist":[9174182],"min":[9174182],"acronym":[9174182,9174603],"familiar":[9174182,9174936,9175604],"confusing":[9174603],"unfortun":[9174603,9174407],"meaning":[9174603,9174878,9175652],"shoot":[9174603,9174878],"enemy'":[9174603],"unawar":[9174684],"existed":[9174684],"recognized":[9174878],"confusion":[9174878],"hearing":[9174878,9175048],"reput":[9174878,9174588],"conf":[9174878,9174925],"tourna":[9174878],"pr":[9174878],"disappointed":[9174878],"discovered":[9174878],"stol":[9174878],"pentesting":[9174878,9174918],"stealing":[9174878,9174925],"established":[9174878],"unrelated":[9174878,9174967,9175184],"fitting":[9174878],"defcon":[9174891,9174631],"1990":[9174891],"children'":[9175661],"wiki":[9175661],"discussion":[9175661,9174426,9175425],"morphed":[9175661],"terminology":[9175661],"etymology":[9175661],"researched":[9175661],"retract":[9174925],"widely":[9174925],"confused":[9174925,9175073],"recogniz":[9174925],"mainstream":[9174925],"check":[9174967,9174487,9173961,9175726,9174248],"netwar":[9174967],"sansactually":[9174967],"here'":[9174967,9174249],"disappear":[9174249],"internet":[9174249,9174918,9174666],"fiendishly":[9174249],"shipped":[9174249,9174407],"helped":[9174249],"hybrid":[9174249],"narr":[9174249],"flavor":[9174249,9173961],"leaderboard":[9174249],"assembly":[9174249,9174297,9174407],"input":[9174249],"vulnerability":[9174249],"planted":[9174249],"similarly":[9174249],"similarit":[9174249],"archetyp":[9174297],"haven't":[9174297,9175726,9174248],"touched":[9174297],"seasoned":[9174297],"hanging":[9174297],"refin":[9174297,9175603],"fully":[9174297,9174275],"pen":[9174297,9174407],"aim":[9174297,9174822],"refining":[9174297],"pentest":[9174349,9174918],"troubling":[9174407],"impl":[9174407,9174588],"they'd":[9174407,9174837],"messaging":[9174407],"'hackers'":[9174528],"'programmers'":[9174528],"doesnt":[9174528],"background":[9174528,9174415],"architectur":[9174528],"matur":[9174528],"architect":[9174528],"structur":[9174528,9174374,9174248],"electr":[9174528],"technologist":[9174528,9174588],"quantity":[9174528],"surveyor":[9174528],"– why":[9174567],"oper":[9174586,9174850],"nightmar":[9174586],"among":[9174586],"untrusted":[9174586],"execut":[9174586],"arbitrary":[9174586],"infrastructur":[9174586,9175550],"abus":[9174586],"mammoth":[9174586],"malici":[9174586],"bugged":[9174586],"submission":[9174586],"wors":[9174586,9174666,9175527,9175550],"moving":[9174586,9174732],"standard":[9174586,9174537],"compon":[9174586],"distraction":[9174586],"everywher":[9174586,9174708],"commonly":[9174739],"popular":[9174739],"multiplay":[9174739],"nich":[9174739],"jargon":[9174739],"qualifying":[9174739],"somebody":[9175184],"explain":[9175184,9175187],"concept":[9174440,9174841],"normally":[9174440],"intriguing":[9174440],"minor":[9174440],"alt":[9174440],"tab":[9174440],"click":[9174440],"confirm":[9174440,9175527],"link":[9174440],"ctrl":[9174440],"teenag":[9174703],"ahead":[9175046],"compli":[9175046],"caffein":[9174206],"fueled":[9174206],"ongoing":[9174206],"eul":[9174206,9174708,9175604],"form":[9174206,9174908,9174764,9175602],"latt":[9174206,9175602],"completion":[9174206],"customized":[9174206],"loved":[9174275],"adopt":[9174275,9174933,9175469],"boxed":[9174275],"blizzard":[9174275,9174808],"flagship":[9174275],"property":[9174275],"dropping":[9174275],"metagam":[9174275],"guild":[9174275],"serv":[9174275],"gonna":[9174275],"releas":[9174275,9174969],"casually":[9174275],"mastery":[9174275,9174918,9174708],"materi":[9174275,9174918,9174708],"sidestep":[9174918],"task":[9174918],"observ":[9174918],"shar":[9174918,9174808,9174429,9175550],"instruction":[9174918],"hold":[9174918],"personalized":[9174918],"pattern":[9174918],"shared":[9174918],"university":[9174918,9174822],"teaching":[9174918,9174658],"assist":[9174918],"interact":[9174918,9174837],"provided":[9174918],"unit":[9174918],"appropri":[9174918],"modif":[9174918],"succeeded":[9174918],"narrow":[9174918],"cheated":[9174918],"stak":[9174918,9174948,9175048],"attracted":[9174918],"chug":[9174918],"implod":[9174918],"almost":[9174918,9174666],"instantly":[9174918],"med":[9174918],"visu":[9174918],"verif":[9174918],"scientif":[9174918],"drawing":[9174918],"pictur":[9174918],"brows":[9174918],"sliv":[9174918],"opposit":[9174708],"randomized":[9174708],"gener":[9174708,9174764,9174822,9174850,9174631,9174482],"sounding":[9174708],"worried":[9174708],"gamed":[9174708],"dr":[9174708],"strong":[9174708],"community":[9174908,9174791,9174808],"sharing":[9174908,9174808],"timeboxed":[9174268,9174537],"mooc":[9174465],"book":[9174465,9174808,9174429],"pair":[9174487],"neat":[9174982],"interviewed":[9174982],"bullshitting":[9174982],"assembling":[9174982],"cne":[9174982],"stellar":[9175537],"frequ":[9173961],"conventionally":[9173961],"collection":[9173961],"guarded":[9173961],"collect":[9173961],"network":[9173961,9174426],"minutia":[9173961],"sql":[9173961,9174841],"query":[9173961],"quoting":[9173961],"congrat":[9174277],"women":[9174277,9174426,9174666,9175527],"chim":[9174277],"belong":[9174426],"sad":[9174426],"clos":[9174426],"attention":[9174426],"dreaming":[9174426,9174901],"regardless":[9174426,9174901],"gend":[9174426,9174901,9175603],"strongly":[9174426,9174666],"dedicating":[9174426],"eventually":[9174426],"femal":[9174426],"ton":[9174426,9174666],"politically":[9174426,9174666],"neutr":[9174426,9174666,9174764],"dialog":[9174426,9174666],"piling":[9174426,9174666],"stink":[9174426,9174666],"fl":[9174426,9174666],"vast":[9174426],"genuinely":[9174426],"addressing":[9174426,9174808],"avoid":[9174426],"covered":[9174426],"neighborhood":[9174901,9175603],"surrounding":[9174901],"gender/race/etc":[9174901],"overrated":[9174901],"proportion":[9174901],"birth":[9174901],"desir":[9175603,9175527],"aptitud":[9175603,9175550],"in":[9175603],"heretofor":[9175603],"unsolved":[9175603],"width":[9174666],"hint":[9174666],"fault":[9174666],"individu":[9174666],"pitchfork":[9174666],"she":[9174666],"toxicity":[9174666],"deb":[9174666],"shock":[9174666],"emac":[9174666],"treat":[9174666,9174588],"rap":[9174666],"and/or":[9174666],"genocid":[9174666],"awar":[9174666,9175048],"hearty":[9174025],"inexist":[9174537],"fal":[9174537],"combin":[9174537],"cracking":[9174537],"languagesyou'v":[9174537],"stated":[9174537],"excus":[9174537],"procrastinating":[9174537],"shiny":[9174537],"hinted":[9174537],"overal":[9174537],"reson":[9174537],"jok":[9174537],"correctly":[9174537],"loosely":[9175726],"connected":[9175726],"sized":[9175726],"fizzbuzz":[9175726],"100th":[9175726],"prim":[9175726],"limit":[9175726],"skip":[9175726],"whichev":[9175726],"moon":[9175100],"goddamn":[9175100],"\\o/":[9175215],"must":[9174825],"individually":[9174825],"screw":[9174832],"blurb":[9174320],"'oh":[9174320],"'team'":[9174320],"programmed":[9174320],"distracting":[9174320],"abras":[9174320],"pl/sql":[9174320,9174328],"prima":[9174320],"donna":[9174320],"'re":[9174320],"systems'":[9174320],"challenges'":[9174320],"anonym":[9174588,9174657,9175187,9175425],"creepy":[9174588],"enthusiast":[9174588],"api":[9174588],"record":[9174588,9174657,9174764],"fiddled":[9174588,9174657],"afternoon":[9174588,9174657],"disqualify":[9174588,9174657],"elsewher":[9174588],"report":[9174588],"stored":[9174588],"compar":[9174588],"owned":[9174588,9174657],"passively":[9174588],"reconstruct":[9174588],"candidates’":[9174588],"evalu":[9174588],"control":[9174588,9174657],"monitored":[9174588],"ugly":[9174588],"competitively":[9174588],"relaxed":[9174588],"treating":[9174588],"vi":[9174588],"res":[9174588],"alternatively":[9174588],"served":[9174588],"redoing":[9174588],"pseudonymously":[9174657],"copyright":[9174657],"gath":[9174657],"prerog":[9174657],"following":[9174764,9174631],"apprais":[9174764],"critic":[9174764],"implicit":[9174764],"explicit":[9174764],"accus":[9174764],"unrealist":[9174764],"patio":[9174764,9175048],"generosity":[9174764,9174822],"wanted":[9174764,9174248],"transaction":[9174764],"educ":[9174764,9174791,9174822,9174933],"endeavor":[9174764],"pretend":[9174764],"absolut":[9174764],"priority":[9174764,9174791,9174837],"simply":[9174764],"priorit":[9174764,9174791],"practically":[9174764,9174808],"defined":[9174764],"patio'":[9174764],"generously":[9174764],"expectation/oblig":[9174764],"'g":[9174764],"back'":[9174764],"asset":[9174764],"clarif":[9174764],"sustain":[9174791],"wheth":[9174791,9174841],"charit":[9174791,9175469],"minimum":[9174791],"perc":[9174791],"imposs":[9174791],"vic":[9174791],"versa":[9174791],"incompat":[9174791,9174850],"prepend":[9174822],"bart":[9174822],"universit":[9174822],"financing":[9174822,9174850],"division":[9174822],"focu":[9174822,9175602],"middlemen":[9174822],"dwarv":[9174822],"sing":[9174822],"subservi":[9174822],"idealist":[9174822],"carry":[9174850],"immor":[9174933],"big":[9174933],"forcing":[9174933],"socially":[9174933],"incentiv":[9174933],"eth":[9174933],"vow":[9174933],"poverty":[9174933],"tesla":[9174837],"motor":[9174837],"electrif":[9174837],"transport":[9174837],"startup":[9174837],"toilet":[9174837],"pap":[9174837],"gladly":[9174837],"switch":[9174837],"manufacturing":[9174837],"rend":[9174837],"acquihired":[9174837],"endeavour":[9174837],"skim":[9174078],"lazi":[9174078],"allapart":[9174078],"gameplay":[9174078],"planning":[9174628],"combating":[9174628],"dynamically":[9174841],"injection":[9174841],"overrunning":[9174841],"buff":[9174841],"depend":[9174841],"payload":[9174841],"naiively":[9174841],"varied":[9174841],"vulner":[9174841],"bob":[9174841],"posting":[9174841],"walkthrough":[9174841],"screencast":[9174841],"trust":[9174841],"savvy":[9174841],"overestim":[9175652],"obfuscating":[9175652],"sufficiently":[9175652],"recently":[9175652],"figuring":[9175652],"clue":[9175652],"meat":[9175652],"despit":[9175652],"collectively":[9175652],"figured":[9175652],"mapping":[9175652],"matt":[9175652,9175527],"relatively":[9175652],"cosmet":[9175652],"item":[9175652],"anecdotally":[9175652],"their":[9175652],"outpac":[9175652],"offering":[9175713],"detected":[9175713],"plagiar":[9175713],"risk":[9175713],"detecting":[9175713],"10+":[9175398],"lost":[9175398],"attrition":[9175398],"pan":[9175398],"depth":[9175398],"phon":[9175398,9175618],"doubl":[9175398],"worldwid":[9175398],"viewing":[9175618],"thomas'":[9175618],"generaliz":[9175469],"gleaned":[9175469],"pricing":[9174374],"codeg":[9174631],"git":[9174631],"barri":[9174631],"up":[9174631],"follow":[9174631,9174808,9174948,9175048],"letting":[9174808],"stal":[9174808],"honor":[9174808,9174948,9175048],"somewhat":[9174808,9174948],"revealing":[9174808],"officially":[9174808],"leeway":[9174808],"rev1":[9174808],"shortest":[9174808],"simplest":[9174808],"whos":[9174808],"brut":[9174808],"chri":[9174808],"eagle":[9174808],"ida":[9174808],"pro":[9174808],"plugin":[9174808],"msp430":[9174808],"emul":[9174808],"symbol":[9174808],"hollywood":[9174808],"uctf":[9174808],"freenod":[9174808],"favorit":[9174808],"fost":[9174808],"apart":[9174808],"irc":[9174808],"thesi":[9174808],"reallllllllllllly":[9174808],"ostensibly":[9174948],"jobs/hiring":[9174948],"recal":[9174948],"promoted":[9174948],"alex":[9174969],"minim":[9174969,9175048],"grooming":[9174969,9175048],"prospect":[9174969,9175048],"typing":[9174969],"ship":[9174969],"rev":[9174969],"calendar":[9174969],"lowering":[9174969],"bar":[9174969],"sensing":[9175048],"miscommun":[9175048],"major":[9175048],"stamped":[9175048],"'career'":[9175048],"losing":[9175048],"'fun":[9175048],"free'":[9175048],"communicated":[9175048],"throwaway":[9175187],"clock'":[9175187],"ticking":[9175187],"feedback":[9175425],"theoretically":[9175425],"middl":[9175425],"'colleg":[9175425],"course'":[9175425],"replic":[9175425],"notably":[9175425],"reorganizing":[9175425],"react":[9175425],"crit":[9175425],"summarily":[9175425],"executed":[9175425],"shal":[9175425],"merely":[9175425],"barred":[9175425],"depart":[9175425],"utopia":[9175425],"frickin'":[9175146],"wishlist":[9174896],"tackl":[9174896],"mobil":[9174896],"desktop":[9174896],"surpris":[9174929],"emailing":[9174929],"suggested":[9174929],"brushing":[9174929],"acquiring":[9174929],"overlap":[9174943],"tptacek'":[9174943],"amazon":[9174943],"arr":[9174943],"recruited":[9174640],"leagu":[9174640],"defend":[9174640],"fronti":[9174640],"xur":[9174640],"dan":[9174640],"armada":[9174640],"announced":[9175073],"heck":[9175073],"lol":[9175154],"sleep":[9174520],"loui":[9174520],"mom":[9174520],"playboy":[9174520],"ill":[9174936],"lookup":[9174936],"leg":[9174429],"cited":[9174429],"sampling":[9174429],"mastering":[9174429],"obliged":[9174429],"cryptography":[9174484,9174415],"eta":[9174462],"optimistically":[9174493],"flux":[9174732],"remot":[9174732],"opportunit":[9174732],"minority":[9174732],"circumst":[9174732],"rated":[9174732],"described":[9175527],"expressing":[9175527],"creativity":[9175527],"appe":[9175527],"men":[9175527],"inadvertently":[9175527],"sexist":[9175527],"carefully":[9175527],"analyz":[9175527],"bivari":[9175527],"voluntary":[9175527],"bias":[9175527,9175550,9175602],"strategy":[9175550],"deployed":[9175550],"enorm":[9175550],"english":[9175550],"professor":[9175550],"palp":[9175550],"surfaced":[9175550],"held":[9175550],"hostag":[9175550],"finishing":[9175550],"notic":[9175602],"delayed":[9175602],"unselected":[9175602],"popul":[9175602],"collected":[9175602],"studio":[9175602],"£100k":[9175017],"london":[9175017],"spreading":[9174988],"history":[9174988],"elptacek":[9174222],"someday":[9174222],"uhm":[9174222],"adject":[9174222],"charg":[9174658],"appoint":[9174481,9174654,9174763],"naturally":[9174654],"f":[9174763],"proof":[9174763],"solo":[9174763],"disadvantag":[9174763],"hum":[9174482],"specialized":[9174482],"advanced":[9174482,9174248],"british":[9174227],"breathless":[9174227],"enthusiasm":[9174227],"innov":[9174496],"recommend":[9174248],"privately":[9174248],"awhil":[9174248],"emailed":[9174248],"batch":[9174248],"'cod":[9174248],"gaming'":[9174248],"exempting":[9174248],"stepic'":[9174248],"bioinformat":[9174248],"main":[9174248],"expand":[9174248],"besid":[9174415],"whim":[9174415],"rendering":[9175604],"phys":[9175604],"fanci":[9175604],"audio":[9175604],"synthesi":[9175604],"compilers/parsers/transpil":[9175604],"puzzle/board":[9175604],"solvers/bot":[9175604],"3rd":[9175604],"search":[9175604],"consensu":[9175604],"raft":[9175604],"coolest":[9175604],"framework":[9175604],"angular":[9175604],"implementing":[9175604],"intern":[9175604],"wondered":[9175604],"pointing":[9174737],"tpacek":[9174737],"producing":[9174737]},"TotalComments":258}